{"album": {"@attr": {"position": "12"}, "artist": "Nina Simone", "url": "http://www.last.fm/music/Nina+Simone/The+Essential+Nina+Simone", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/60797073.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/60797073.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/60797073.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/60797073.png", "size": "extralarge"}], "title": "The Essential Nina Simone", "mbid": "41ada184-f564-4d4c-9b52-1c3e64e8beb6"}, "wiki": {"content": "&quot;Sinnerman&quot; is an American traditional spiritual song that has been recorded by a number of performers. The song dates to the turn of the 20th century[citation needed] but most modern recorded versions derive from 1959 changes and additions codified by the folk music group the Weavers. The Weavers' performance of the song appears on their compilation albums Gospel and Reunion at Carnegie Hall Part 2.\n &quot;Sinnerman&quot; (spelled as one word) is one of Nina Simone's most famous songs and she recorded her definitive 10-minute plus version on her 1965 album Pastel Blues. Simone learned the lyrics of this song in her childhood when it was used at revival meetings by her mother, (a Methodist minister) to help people confess their sins. In the early days of her career (early sixties when she was heavily involved in the Greenwich Village scene), Simone often used the long piece to end her live performances. An earlier version of this song exists, recorded live at The Village Gate, but was never used on the 1962 Colpix album Nina at the Village Gate.\n Nina Simone's version of Sinnerman has been sampled by hip-hop producer Kanye West for the Talib Kweli song &quot;Get By&quot;, by Timbaland for the song &quot;Oh Timbaland&quot;, and by Felix da Housecat for Verve Record's &quot;Verve Remixed&quot; series. It has also been covered by 16 Horsepower on their album Folklore, and by Zegota on their self-titled 7&quot;. French rapper Abd al-Malik sampled Simone's version for the title track of his 2006 album &quot;Gibraltar&quot;. He also sampled Simone's version of &quot;See Line Woman&quot; for the track &quot;Le grand frère&quot; on the same album.\n &quot;Sinnerman&quot; was featured in 1999's &quot;The Thomas Crown Affair, in 2004 in Cellular from David R. Ellis and in the 2006 Michael Mann film Miami Vice. On TV her song Sinnerman was heard on Homicide: Life On The Street Sins of the Father * 87. * Season: 6 * Episode: 10 * First Aired: 1/9/1998.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "published": "Thu, 26 Mar 2009 14:19:51 +0000", "summary": "&quot;Sinnerman&quot; is an American traditional spiritual song that has been recorded by a number of performers. The song dates to the turn of the 20th century but most modern recorded versions derive from 1959 changes and additions codified by the folk music group the Weavers. The Weavers' performance of the song appears on their compilation albums Gospel and Reunion at Carnegie Hall Part 2.\n &quot;Sinnerman&quot; (spelled as one word) is one of Nina Simone's most famous songs and she recorded her definitive 10-minute plus version on her 1965 album Pastel Blues."}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Sinnerman", "artist": {"url": "http://www.last.fm/music/Nina+Simone", "mbid": "2944824d-4c26-476f-a981-be849081942f", "name": "Nina Simone"}, "url": "http://www.last.fm/music/Nina+Simone/_/Sinnerman", "mbid": "00876661-88fb-4836-9eb3-d99b75ef4903", "comments": ["So easy to imaging somebody running - drums, piano and bass draw a perfect picture. Guitar and her voice are great on top.", "I love Ninas Music ...", "One of the best songs to run ever made! Run Forest run...", "Hearing the live version for the first time. Sounds great!", "Moriarty was real!", "C'est magnifique, entêtant. La voix, le piano, une des plus belles chansons que j'ai jamais entendu. Je découvre.", "Sherlock !", "She sang this for me...", "She sings this song to me..........", "A masterpiece. I was really pleased to hear this in Sherlock too!", "In my opinion one of her very best songs", "Power to da Lord", "Used to great effect in final episode of last series of Sherlock too. Awesome!", "Amazing.", "Caiu como uma luva no filme.", "wauw!", "Makes me so nervous, in a best possible way, amazing song! <3", "WELTKLASSE!", "Oh Slenderman, where will you make me run to", "pure bliss<3"], "id": "1102454", "listeners": "242156", "duration": "617000", "playcount": "1001155", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/nina%20simone", "name": "nina simone"}]}}