{"track": {"album": {"@attr": {"position": "1"}, "title": "Back to Black", "url": "http://www.last.fm/music/Amy+Winehouse/Back+to+Black", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87899249.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87899249.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87899249.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87899249.png", "size": "extralarge"}], "artist": "Amy Winehouse", "mbid": "8a67c241-f047-487d-8bed-5db7c65874fe"}, "wiki": {"content": "&quot;Rehab&quot; is a song by English singer-songwriter Amy Winehouse from her second studio album, Back to Black (2006). Written by Winehouse and produced by Mark Ronson, it was released as the album's lead single in the United Kingdom on 23 October 2006. The lyrics are autobiographical, describing a protagonist's drinking habits and refusal to enter rehabilitation clinics.\n \n The song received widespread critical acclaim and enjoyed commercial success in Winehouse's native England and abroad. The tune won the 2007 Ivor Novello Award for Best Contemporary Song. &quot;Rehab&quot; won three Grammy Awards in 2008, including Record of the Year, Song of the Year, and Best Female Pop Vocal Performance.\n \n Winehouse's subsequent public battle with substance abuse and the song's popularity contributed to its numerous appearances in the mainstream media. Several artists have covered the song, both in official releases and live.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Rehab&quot; is a song by English singer-songwriter Amy Winehouse from her second studio album, Back to Black (2006). Written by Winehouse and produced by Mark Ronson, it was released as the album's lead single in the United Kingdom on 23 October 2006. The lyrics are autobiographical, describing a protagonist's drinking habits and refusal to enter rehabilitation clinics.  The song received widespread critical acclaim and enjoyed commercial success in Winehouse's native England and abroad. The tune won the 2007 Ivor Novello Award for Best Contemporary Song.", "published": "Sun, 5 Apr 2009 00:47:31 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Rehab", "artist": {"url": "http://www.last.fm/music/Amy+Winehouse", "mbid": "23ee1942-3b50-4953-9b61-b3b0e932064c", "name": "Amy Winehouse"}, "url": "http://www.last.fm/music/Amy+Winehouse/_/Rehab", "listeners": "995738", "comments": ["\"Ironic\" doesn't even begin to describe it.[7]", "is it weird i heard this song first in jersey shore.", "I just, I just need a friend, I'm not going to spend ten weeks, and have everyone think I'm on the mend... It's not just my pride, It's just 'til these tears have dried.", "MY GIRL ........................SING FOR ME.....................R.I.P", "sempre realizo o compasso da música com o cara das palminhas'", "I felt so much sadness towards her when I first heard of her, thanks to this song.", "Check out the Jolly Boys take on this, also Lou Reeds , Perfect Day,  they're on You Tube", "jazz??", "\"Ironic\" doesn't even begin to describe it.[6]", "AmyXXX", "she did go to rehab once though :/ xx", "(danielbishop807) MAYBE!!!!!!!!!!!!!!!!!", "It's a pity she didn't go, go, go", "Sie ist jetzt im 27Club & I love her!", "♥♥♥♥♥", "I won't go, go, go", "i feel sick liking this song considering the circumstances :-/", "I will always love you Amy Winehouse. Heaven's beautiful angel.", "I just need a friend...", "AMY XXX"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/amy%20winehouse", "name": "amy winehouse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "011d1462-add5-440b-b0a3-dba4c4e9cce9", "duration": "214000", "playcount": "6519596", "id": "58830157"}}