{"track": {"album": {"@attr": {"position": "3"}, "title": "Time Out", "url": "http://www.last.fm/music/Dave+Brubeck/Time+Out", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91520107.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91520107.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91520107.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91520107.png", "size": "extralarge"}], "artist": "Dave Brubeck", "mbid": "ce61b145-c954-4fd4-86a4-bb2617544e62"}, "wiki": {"content": "&quot;Take Five&quot; is a classic jazz piece first recorded by The Dave Brubeck Quartet and released on the 1959 album “Time Out”. It became the first million-selling jazz single on the Billboard Hot 100 charts in 1961, at a time when rock and roll was still in fashion.\n \n “Take Five” became Brubeck’s best known, and signature, tune. It was composed by Paul Desmond, the group's saxophonist and became famous for its distinctive, catchy saxophone melody and use of the unusual quintuple (5/4) time, from which its name is derived. While &quot;Take Five&quot; was not the first jazz composition to use this meter, it was the first of United States mainstream significance.\n \n The original single was recorded at Columbia's 30th Street Studios in New York City on June 25, July 1 &amp; August 18, 1959. The track features Eugene Wright on bass and Joe Morello on drums.\n \n The song was recorded and broadcast many times by Brubeck’ Quartet, and has been recorded by scores of artists, from Swedish singer Monica Zetterlund in 1962 to a dub version by King Tubby in 2002. Some versions have included lyrics, including a 1961 recording with lyrics written by Dave Brubeck and his wife Iola and sung by Carmen McRae. The tune has also been included in countless movies and television soundtracks, and still receives significant radio play.\n \n The composer, Paul Desmond, died in 1977 and left his rights to royalties for performances and compositions, including &quot;Take Five,&quot; to the American Red Cross. Since that time, the organization has received approximately $100,000 per year in combined royalties.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Take Five&quot; is a classic jazz piece first recorded by The Dave Brubeck Quartet and released on the 1959 album “Time Out”. It became the first million-selling jazz single on the Billboard Hot 100 charts in 1961, at a time when rock and roll was still in fashion.  “Take Five” became Brubeck’s best known, and signature, tune. It was composed by Paul Desmond, the group's saxophonist and became famous for its distinctive, catchy saxophone melody and use of the unusual quintuple (5/4) time, from which its name is derived.", "published": "Fri, 26 Jun 2009 07:30:27 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Take Five", "artist": {"url": "http://www.last.fm/music/Dave+Brubeck", "mbid": "de0222a6-e1c4-403d-8b01-3f66d505061b", "name": "Dave Brubeck"}, "url": "http://www.last.fm/music/Dave+Brubeck/_/Take+Five", "listeners": "250430", "comments": ["Is it :-)", "This is his best known one. Really brilliant:-)", "Brilliant.", "Wundervoll! Ich kann es gar nicht oft genug hören :-)", "que amostra mais vagabunda essa o last fm, pegar a parte da improvisação olha lá eim", "cover 1 cover 2 cover 3 cover 4 cover 5 cover 6 e nada de enjoar", "!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Ahhhh Loove it!", "Bravo!! <3333333333333333333333333333", "The man, the legend! :-D", "ONE OF THE PASSED MASTERS", "He was great and willl be missed. RIP", "CLASSIC CUT  LOVE PAUL DESMOND", "Berkeley. Cal <3333333333333333333333333333333333", "Rich & Cool!!!!!!!!!! <33333333333333", "TOTAL GREATNESS", "My first real introduction to Jazz.  I had heard much of the Big Band Jazz from my mother - the old man preferred Bob Wills and so did I).  Bought the album with money earned caddying ( one dollar for 18 holes then).  Became a Jazz fan.", ".", "...dito....so good.....", "großartig"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/cool%20jazz", "name": "cool jazz"}, {"url": "http://www.last.fm/tag/instrumental", "name": "instrumental"}, {"url": "http://www.last.fm/tag/piano", "name": "piano"}, {"url": "http://www.last.fm/tag/saxophone", "name": "saxophone"}]}, "mbid": "04a0b8bd-bced-45a0-af86-e9a3cfad4dbe", "duration": "326000", "playcount": "990508", "id": "1109744"}}