{"track": {"album": {"@attr": {"position": "8"}, "title": "Frank", "url": "http://www.last.fm/music/Amy+Winehouse/Frank", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87899233.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87899233.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87899233.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87899233.png", "size": "extralarge"}], "artist": "Amy Winehouse", "mbid": "187e5a40-e083-43d6-bdc3-d472a35622e5"}, "wiki": {"content": "James Moody created his improvised solo in 1949 on a visit to Sweden. Moody’s version clearly shows the influence of Charlie Parker.[2] Later in 1952 , jazz singer Eddie Jefferson wrote lyrics to this improvisation by Moody, a practice known as vocalese.[3] This particular arrangement of the song did not come to be known by its now common title of &quot;Moody's Mood for Love&quot; until King Pleasure released a very popular vocal version in 1954.[4] Following King Pleasure's successful hit version of &quot;Moody's Mood for Love&quot; Jimmy McHugh the original author of &quot;I'm in the Mood for Love&quot; sued for copyright infringement and won a partial victory in court. He and Moody eventually agreed to share the proceeds on sales of any versions of the tune.[5] King Pleasure's version included vocals by Blossom Dearie as well as instrumental contributions from Teacho and Band. Other artists who later released renditions of the song include Van Morrison, George Benson, Aretha Franklin from &quot;Hey Now Hey (The Other Side of the Sky)&quot;, Queen Latifah, Tito Puente, Kermit Ruffins, The Ray Gelato Giants, Amy Winehouse, Mina and Georgie Fame. In 1995 Quincy Jones released a multi-harmony version of the track with his album Q's Jook Joint featuring the artists Take 6 in collaboration with Brian McKnight.[6] The Tony Award-winning musical Jersey Boys featured the song. The song also has been featured on an episode of The Cosby Show, as well as in an early 1990s Gap television commercial .\n The lyrics are often incorrectly attributed to King Pleasure because he was the first to record it. However, some sources report that when Pleasure was asked to write more lyrics to solos he confessed that he had not written this one. He had heard Jefferson perform it in a jazz club some years before and asked permission to reproduce it. James Moody later hired Jefferson to come on the road with him. Jefferson also appears on several recordings with Moody.\n Another repercussion of Jefferson’s lyrical marriage to Moody’s solo was the impact it had on jazz singer Jon Hendricks. The story goes that Hendricks was sitting in a café when the King Pleasure recording of &quot;Moody’s Mood&quot; came on the jukebox. According to Hendricks, he had been writing “unpopular” songs for some time, but when he heard the recording and realized that it was a saxophone solo with words he decided to change his approach to songwriting. “I didn’t have to stop at 32 bars. Now I could write lyrics for all the parts in the orchestra.” He went on to collaborate with the singer and arranger Dave Lambert and the singer Annie Ross to form the group Lambert, Hendricks &amp; Ross. The group multi-tracked their voices and recorded the album Sing a Song of Basie in which they sang lyrics by Hendricks to the full arrangements of the Count Basie Orchestra (Ross singing all the trumpet parts, Hendricks singing the saxophone parts and Lambert singing the trombone parts). With the exception of a small rhythm section, all 13 horn parts were reproduced by the three voices dubbed over.\n \n Hip hop artist Prince Paul sampled the song as the basis for the track &quot;Mood for Love&quot; on his album A Prince Among Thieves (1999).[7] In 2006, American Idol contestant Elliott Yamin performed the song. His version appears on the album American Idol Season 5: Encores. This version just missed the Billboard Hot 100, peaking at number one on Billboard's Bubbling Under Hot 100 Singles chart. The following year, urban jazz saxophonist Najee released album &quot;Rising Sun&quot; which contained a cover of the song.[8][9]\n The song has also been covered by Queen Latifah on The Dana Owens Album; and Amy Winehouse on her first album, Frank.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "James Moody created his improvised solo in 1949 on a visit to Sweden. Moody’s version clearly shows the influence of Charlie Parker.[2] Later in 1952 , jazz singer Eddie Jefferson wrote lyrics to this improvisation by Moody, a practice known as vocalese.[3] This particular arrangement of the song did not come to be known by its now common title of &quot;Moody's Mood for Love&quot; until King Pleasure released a very popular vocal version in 1954.", "published": "Fri, 17 Feb 2012 15:42:03 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Moody's Mood for Love", "artist": {"url": "http://www.last.fm/music/Amy+Winehouse", "mbid": "23ee1942-3b50-4953-9b61-b3b0e932064c", "name": "Amy Winehouse"}, "url": "http://www.last.fm/music/Amy+Winehouse/_/Moody%27s+Mood+for+Love", "listeners": "115980", "comments": ["listen to thisjazz phrasing, this is godly...now i understand why she didn't sun this track live", "Oh baby, you make me feel so good...", "Stunning...catchy...lovely!", "lovely song", "Fabuloso!", "I love this song so gosh dern much", "Im not afraid...", "wonderful", "and there she goes...what a tragedy.", "it's a miracle she's still with us, I don't know why.  She's memorable.", "amazing :D", "her version is i must say very good i really think she did it so well i love it", "most great artist in history are self destructive, that is what makes them what they are.", "Never heard this before. She's got skillz.", "go girl go   amazin track", "beautiful...", "I truly hope that one day she will get better because she is one of the biggest talents (if not THE biggest) talents out there right now!", "This is actually a unique and good version of this often-covered tune.  I never realized she had this  much talent.  I always thought she was another white British blues shouter ...", "NICE.", "One of the greatest trainwrecks in the history of music and its a shame too because she's actually quite good"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/amy%20winehouse", "name": "amy winehouse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "064b22cb-7d66-4474-9f12-dc0a01dcbec0", "duration": "170000", "playcount": "452717", "id": "2897174"}}