{"track": {"album": {"@attr": {"position": "6"}, "title": "Ken Burns Jazz", "url": "http://www.last.fm/music/John+Coltrane/Ken+Burns+Jazz", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/41049801.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/41049801.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/41049801.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/41049801.png", "size": "extralarge"}], "artist": "John Coltrane", "mbid": ""}, "wiki": {"content": "&quot;<strong>In a Sentimental Mood</strong>&quot; is a jazz composition by Duke Ellington which is also performed as a song. Ellington composed the piece in 1931 and recorded it with his orchestra the same year. Lyrics were later written for the tune by Irving Mills and Manny Kurtz. According to Ellington, the song was born in Durham, North Carolina. &quot;We had played a big dance in a tobacco warehouse, and afterwards a friend of mine, an executive in the North Carolina Mutual Insurance Company, threw a party for Amy. I was playing piano when another one of our friends had some trouble with two chicks. To pacify them, I composed this there and then, with one chick standing on each side of the piano.&quot; The original recording featured solos by Otto Hardwicke, Harry Carney, Lawrence Brown, and Rex Stewart.\n \n &quot;In a Sentimental Mood&quot; makes use of a musical technique called contrapuntal or chromatic embellishment of static harmony. This is also sometimes referred to as a line cliché.\n \n Ellington recorded his best-known version together with John Coltrane, which is featured on <em>Duke Ellington and John Coltrane</em> and <em>Coltrane for Lovers</em>. The Ellington and Coltrane version was performed in the key of D flat major, mainly from B flat minor 7th to E flat minor 7th, and then A flat 13th to D flat major 7th, with an interesting interlude in A major.\n \n The song has been performed by many other artists including Phyllis Hyman, Ella Fitzgerald, Sarah Vaughan, Art Tatum, Oscar Peterson, Bill Evans, Stan Getz, Django Reinhardt, Lucky Thompson, Jay McShann, Benny Goodman, Pedro Rossi, Billy Joel, Nancy Wilson, Dr. John, Sonny Rollins, Michael Brecker (Steps Ahead), Daniel Barenboim, Edvard Sađil, Larry Coryell (from his 2001 album Inner Urge), Rob Mullins, Archie Shepp, and Alex Bugnon.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;In a Sentimental Mood&quot; is a jazz composition by Duke Ellington which is also performed as a song. Ellington composed the piece in 1931 and recorded it with his orchestra the same year. Lyrics were later written for the tune by Irving Mills and Manny Kurtz. According to Ellington, the song was born in Durham, North Carolina. &quot;We had played a big dance in a tobacco warehouse, and afterwards a friend of mine, an executive in the North Carolina Mutual Insurance Company, threw a party for Amy. I was playing piano when another one of our friends had some trouble with two chicks.", "published": "Thu, 16 May 2013 06:18:46 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "In A Sentimental Mood", "artist": {"url": "http://www.last.fm/music/John+Coltrane", "mbid": "b625448e-bf4a-41c3-a421-72ad46cdb831", "name": "John Coltrane"}, "url": "http://www.last.fm/music/John+Coltrane/_/In+A+Sentimental+Mood", "listeners": "44407", "comments": ["If you're not big on jazz, you've been listening to the wrong jazz!", "i agree prof...this coltrane masterpiece would indeed make a beautiful and fitting requiem for a cultured jazz lover...like yourself...hope 2 c u in jazz heaven...!", "would like this played at my funeral", "ESSA MÚSICA É UM PRODUTO DE UM GÊNIO!!", "so nice", "makes us mellow", "I noticed people listen to this song almost twice as much as 6 months ago. hmm.", "perfect", "exactamente inexacta! irrepetible!", "wonderful", "Just simple perfect. Puts me in a sentimental mood :)", "Uma das melhores músicas do mundo!", "my favourite jazz song", "Coltrane and Ellington - what a great combo!", "so tender, deeply into conscience, so...sentimental. between smile and cry, between pleasure and sadness...like playing on my soul strings.", "This song is fantastic, and I'm not huge on jazz."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/saxophone", "name": "saxophone"}, {"url": "http://www.last.fm/tag/john%20coltrane", "name": "john coltrane"}, {"url": "http://www.last.fm/tag/lovesong", "name": "lovesong"}, {"url": "http://www.last.fm/tag/chillout", "name": "chillout"}]}, "mbid": "08467f05-ace9-4a6e-85d0-20e894e1b8a3", "duration": "259000", "playcount": "158518", "id": "1079648"}}