{"track": {"album": {"@attr": {"position": "1"}, "title": "Kind of Blue", "url": "http://www.last.fm/music/Miles+Davis/Kind+of+Blue", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/40450985.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/40450985.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/40450985.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/40450985.png", "size": "extralarge"}], "artist": "Miles Davis", "mbid": "3aaa9d21-4982-4c13-a1bb-caa57195fee6"}, "wiki": {"content": "\n There are two different compositions entitled &quot;So What&quot; performed by Miles Davis. \n \n Most notable is the version from the classic Miles Davis Album &quot;Kind of Blue&quot;, with personnel: Miles Davis (trumpet),  John Coltrane (tenor saxophone), Julian &quot;Cannonball&quot; Adderley (alto saxophone), Bill \n Evans (piano), Paul Chambers (bass), and Jimmy Cobb (drums).  Recorded March 2, 1959 at Columbia \n Studios, New York City.  Soloists are (in order): Davis, Coltrane, Adderley, Evans (with horns), \n Chambers (final melody).  Written by Miles Davis.\n \n This song is one of the first and most famous instances of modal jazz, where the harmony is based on a scale rather than a rapidly changing series of chords.  So What's bass line and melody are based on the D dorian scale, and the only changes are in the &quot;B&quot; section of the song, moving up a half step, \n before returning back down. The solos follow this same progression, using D dorian for the first \n 16 bars,  Eb dorian for the next 8 bars, and D dorian again for the last 8.\n \n The lesser known &quot;So What&quot; is from the 1951 album &quot;Conception&quot;, a standard that was also performed by Chubby Jackson featuring Gerry Mulligan in 1950, immediately after Miles' &quot;Birth of Cool&quot; sessions.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "\n There are two different compositions entitled &quot;So What&quot; performed by Miles Davis.   Most notable is the version from the classic Miles Davis Album &quot;Kind of Blue&quot;, with personnel: Miles Davis (trumpet),  John Coltrane (tenor saxophone), Julian &quot;Cannonball&quot; Adderley (alto saxophone), Bill \n Evans (piano), Paul Chambers (bass), and Jimmy Cobb (drums).  Recorded March 2, 1959 at Columbia \n Studios, New York City.  Soloists are (in order): Davis, Coltrane, Adderley, Evans (with horns), \n Chambers (final melody).  Written by Miles Davis. ", "published": "Tue, 8 Jun 2010 05:39:02 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "So What", "artist": {"url": "http://www.last.fm/music/Miles+Davis", "mbid": "561d854a-6a28-4aa7-8c99-323e6ce46c2a", "name": "Miles Davis"}, "url": "http://www.last.fm/music/Miles+Davis/_/So+What", "listeners": "435389", "comments": ["This is such a classic, BoyZ & girlZ! Revel in what has set the standard.....", "I listen to this and I'm playing Simcity3000 in my head....", "the name of this song should be So Awesome", "So good!", "A JAZZ CLASSIC FOR THE AGES A MESMORIZING CUT FROM  SOME OF LEGENDS OF JAZZ. MILES, CANNONBALL,EVANS,CHAMBERS  COLTRANE AND COBB. SMOKIN!!!!!!!!!", "Timeless", "Never grows old...", "Sophorific", "This what I call jazz. And his track is from the studio recording of Kind of Blue. Last.fm alternate this track with the live recording. That's what!", "So what?", "ButchGantenbein: I say what I like and you can too.\r\nPhil_PorcoDio: I question myself daily. I am very busy writing a book, photographing in black and white and colour with fil and digital cameras, making collages and designing. I am in very good spirits and am very creative.", "---------------------------------------------------------------sh", "Stuart you could say your face is like a sketching", "Phil_PorcoDeo I am not saying a word only writing that a promise is a promise.", "still my favourite", "This is my favourite track from the studio recording of Kind of Blue.", "Ah this is the studio version from the Kind of Blue LP. My favourite!", "Buscaba a Davis, no un cover....   :/", "prefer the studio recording of Kind of Blue to this live recording.", "IMMORTAL"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/trumpet", "name": "trumpet"}, {"url": "http://www.last.fm/tag/miles%20davis", "name": "miles davis"}, {"url": "http://www.last.fm/tag/cool%20jazz", "name": "cool jazz"}, {"url": "http://www.last.fm/tag/bebop", "name": "bebop"}]}, "mbid": "0b2dd80c-e2be-4b33-8215-63248de95afb", "duration": "560000", "playcount": "1991421", "id": "7153"}}