{"album": {"@attr": {"position": "7"}, "artist": "John Coltrane", "url": "http://www.last.fm/music/John+Coltrane/The+Heavyweight+Champion:+The+Complete+Atlantic+Recordings+(disc+2)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69246294.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69246294.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69246294.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69246294.png", "size": "extralarge"}], "title": "The Heavyweight Champion: The Complete Atlantic Recordings (disc 2)", "mbid": ""}, "wiki": {"content": "&quot;'Giant Steps'&quot; is a jazz recording by John Coltrane, on tenor saxophone, which is the first track on the album of the same name and is 4 minutes and 49 seconds long. The composition is a milestone for jazz musicians' progress, given the difficulty of improvising its rapid progression of chord changes that progress through three keys shifted by major thirds.\n \n The saxophonist had previously used this technique on the LP Blue Train on the tunes Moment's Notice and Lazy Bird. Coltrane continued in this vein on a recording with Cannonball Adderley of the standard &quot;Limehouse Blues,&quot; and on his original &quot;Fifth House.&quot; He continued to use this approach on other tunes, such as &quot;Countdown&quot;, based on the Miles Davis tune &quot;Tune Up&quot;; &quot;26 2&quot; based on Charlie Parker's &quot;Confirmation&quot;; and a reharmonization of the jazz standard &quot;Body and Soul.&quot; Songs such as &quot;Naima&quot; and &quot;Like Sonny&quot; also show some harmonic similarity to &quot;Giant Steps.&quot; Coltrane continued to employ similar concepts in his soloing during his more open and modal middle period. A Love Supreme features examples of lines based on &quot;Giant Steps&quot; cycles over modal vamps, to create a Polytonal effect.\n \n The progression continues to stimulate harmonic thinking in contemporary jazz. There are a number of different approaches to soloing on the song. While Coltrane favoured arpeggiation over the changes, other players have used different tricks and patterns to bring out the sound of the changes. The chord progression was later used by Freddie Hubbard as a basis for his composition &quot;Dear John.&quot; Covers have been recorded by such artists as Pat Metheny, Buddy Rich, Jaco Pastorius, Mike Stern, Greg Howe, Tommy Flanagan (who played on the original recording), McCoy Tyner, Kenny Werner, Kenny Garrett, Woody Herman, and Taylor Eigsti.\n \n John Coltrane was known for coming into the studio with unrehearsed songs - &quot;Giant Steps&quot; was no exception. On the original recording, Tommy Flanagan (piano) played a choppy start-stop solo where it sounds like he is struggling to improvise over Coltrane changes without adequate preparation. Flanagan would revisit Giant Steps on several recordings later in his career and mastered the progression.\n \n John Coltrane - tenor sax\n Tommy Flanagan - piano\n Paul Chambers - bass\n Art Taylor - drums\n \n Written by John Coltrane\n Recorded May 5, 1959 at Atlantic Studios, New York\n Originally released on the album Giant Steps, Atlantic SD-1311, January 1960\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "published": "Tue, 13 Jan 2009 14:05:33 +0000", "summary": "&quot;'Giant Steps'&quot; is a jazz recording by John Coltrane, on tenor saxophone, which is the first track on the album of the same name and is 4 minutes and 49 seconds long. The composition is a milestone for jazz musicians' progress, given the difficulty of improvising its rapid progression of chord changes that progress through three keys shifted by major thirds.  The saxophonist had previously used this technique on the LP Blue Train on the tunes Moment's Notice and Lazy Bird."}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Giant Steps", "artist": {"url": "http://www.last.fm/music/John+Coltrane", "mbid": "b625448e-bf4a-41c3-a421-72ad46cdb831", "name": "John Coltrane"}, "url": "http://www.last.fm/music/John+Coltrane/_/Giant+Steps", "mbid": "0d46f491-5737-45fa-b048-6d95b30ad088", "comments": ["Tonally uninhibited improvisation by Coltrane allowed subsequent generations of musicians consider him one of the pioneers of free jazz", "i'm actually hearing the alternate version with cedar walton on piano...and in any event...keepin' up with trane's giant steps wasn't that easy... ; D", "poor flanagan, cant take dem coltrane changes during the solo ;_;", "A Masterpiece...", "Makes the scenery so much better ^_^", "Tell'us aboutit!!", "He was a giant and punched above his weight", "The Garry Winogrand of the tenor sax. Way out front, street wise, miles ahead of his time!!", "Yes, last.fm,please keep this version. Full hard on. No one comes close to his genius. Thank you Trane.", "Masterpiece.", "Must suck to be someone else trying to be this good. ;-)", "maybe my favorite song ever", "Blows everyone else off the park.", "man this is intense", "musica para el alma yel espiritu es la musica de john coltrane", "Solid.", "<3 x 2", "So fast, so energetic.", "DAT BASS", "coltane super-hot and out-front...all company keeping up...outstanding...all on top form...keep this version...please...!"], "id": "13781", "listeners": "178227", "duration": "223000", "playcount": "583919", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/saxophone", "name": "saxophone"}, {"url": "http://www.last.fm/tag/bebop", "name": "bebop"}, {"url": "http://www.last.fm/tag/john%20coltrane", "name": "john coltrane"}, {"url": "http://www.last.fm/tag/free%20jazz", "name": "free jazz"}]}}