{"track": {"album": {"@attr": {"position": "6"}, "title": "Kind Of Blue (Legacy Edition)", "url": "http://www.last.fm/music/Miles+Davis/Kind+Of+Blue+(Legacy+Edition)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/59387503.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/59387503.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/59387503.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/59387503.jpg", "size": "extralarge"}], "artist": "Miles Davis", "mbid": ""}, "wiki": {"content": "&quot;Flamenco Sketches&quot; is a jazz composition written by American jazz trumpeter Miles Davis and pianist Bill Evans. It is the fifth track on Davis' 1959 album Kind of Blue, the best-selling jazz record of all time, and an innovative experiment in modal jazz. The track features Miles Davis, John Coltrane, Cannonball Adderley, Paul Chambers, Jimmy Cobb and Bill Evans.\n \n The piece has no written melody, but is rather defined by a set of chord changes that are improvised over using various modes of the major scale of each tonality. Each musician separately chose the number of bars for each of the modal passages in his solo. Davis gets credit for the song form, but Evans is credited with the opening 4-bar vamp over Cmaj7 and G9sus4, which is the opening theme to his ballad improvisation &quot;Peace Piece&quot;. Because of the presence of this vamp, &quot;Flamenco Sketches&quot; is usually played as a ballad. The modes used in &quot;Flamenco Sketches&quot; are as follows:\n \n C Ionian (natural major scale)\n A♭ Mixolydian (Major with a minor 7th)\n B♭ Ionian\n G Harmonic Minor over D Phrygian Dominant (alternates over bass notes D and E♭)\n G Dorian\n \n The alternate take of &quot;Flamenco Sketches,&quot; is the only complete alternate take from the original recording sessions of Kind of Blue, and was first unveiled on the 5-LP/4-CD box set of 1988, Miles Davis: The Columbia Years 1955-1985, which was the first Miles Davis box set ever issued by Columbia. The track is included on most recent reissues of Kind of Blue as the sixth and last track.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Flamenco Sketches&quot; is a jazz composition written by American jazz trumpeter Miles Davis and pianist Bill Evans. It is the fifth track on Davis' 1959 album Kind of Blue, the best-selling jazz record of all time, and an innovative experiment in modal jazz. The track features Miles Davis, John Coltrane, Cannonball Adderley, Paul Chambers, Jimmy Cobb and Bill Evans.  The piece has no written melody, but is rather defined by a set of chord changes that are improvised over using various modes of the major scale of each tonality.", "published": "Tue, 30 Jul 2013 19:01:11 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Flamenco Sketches (alternate take)", "artist": {"url": "http://www.last.fm/music/Miles+Davis", "mbid": "561d854a-6a28-4aa7-8c99-323e6ce46c2a", "name": "Miles Davis"}, "url": "http://www.last.fm/music/Miles+Davis/_/Flamenco+Sketches+(alternate+take)", "listeners": "127651", "comments": ["This, is Jazz.", "ABSOLUTELY BEAUTIFUL CUT FROM THE MASTER MILES DAVIS", "Sweet!", "This is smooth and soothing...reminds me of Bill Evans Peace, Piece...", "So,so smooth, love ya Miles", "exquisitely beautiful", "This is so to my taste. [2]", "GET IT MILES DAVIS JUST GOTTA LOVE HIM", "Love it.", "This is to my taste.", "This is not to my taste.", "Miles Davis just defines \"genius\".  And to have Coltrane and the rest on there is like adding homemade cream cheese icing to an already silky chocolate cake.", "Yes, exquisite", "The original album version is utterly sublime, this alternative take is merely exquisitely beautiful. Humans really are capable of the most wonderful things sometimes......", "....    :-))   ....", "Simply beautiful.....\r\n\r\nhttp://www.last.fm/music/Peter+Fearnley", "I really wish people were still making music like this. Or that I knew who they were (if someone is).", "sooooooooo timelesss     I just love it", "!", "ANY take from Miles is ALWAYS a fascinating look into his musical genius!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/miles%20davis", "name": "miles davis"}, {"url": "http://www.last.fm/tag/trumpet", "name": "trumpet"}, {"url": "http://www.last.fm/tag/instrumental", "name": "instrumental"}, {"url": "http://www.last.fm/tag/classic%20jazz", "name": "classic jazz"}]}, "mbid": "3f8ef352-16fc-4cb8-8848-75aa3d21bbee", "duration": "574000", "playcount": "445858", "id": "1108334"}}