{"track": {"album": {"@attr": {"position": "4"}, "title": "Head Hunters", "url": "http://www.last.fm/music/Herbie+Hancock/Head+Hunters", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/89741251.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/89741251.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/89741251.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/89741251.jpg", "size": "extralarge"}], "artist": "Herbie Hancock", "mbid": "c37188bc-2542-449f-adff-63bb612b2474"}, "wiki": {"content": "Vein melter is a short story told in musical form by a genius. It is an insight into heroin abuse.  It starts with the addict's heartbeat and a short, chirpy refrain which probably represents the addict's satisfaction at scoring.  Then comes a clash - that is the hit.  His heartbeat becomes louder and more pronounced now and we witness the effect the drug has on the user.  The high is expressed by some of the most beautuful, exquisite jazz you will ever hear.  It is poignant because the only way this person can experience beauty in his life is by using this drug.  As the gorgeous high goes on however, the music becomes crazy and disjointed like the junkie's outlook on life, and then Hancock manages to express his pity and great sorrow for this person's plight. The high fades away as the effects of the drug wear off and harsh reality returns, the heartbeat returns to normal, leaving the tragic addict right back where he started.  This incredible experience has been totally pointless.  He is left with absolutely nothing, except a need for more. \n Herbie Hancock is a grande master of his instument.  This brilliant composition is timeless, and on a par with works like Beethoven's piano sonata Op 81 Les Adieux, which also tells a story through music.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Vein melter is a short story told in musical form by a genius. It is an insight into heroin abuse.  It starts with the addict's heartbeat and a short, chirpy refrain which probably represents the addict's satisfaction at scoring.  Then comes a clash - that is the hit.  His heartbeat becomes louder and more pronounced now and we witness the effect the drug has on the user.  The high is expressed by some of the most beautuful, exquisite jazz you will ever hear.  It is poignant because the only way this person can experience beauty in his life is by using this drug.", "published": "Thu, 16 Oct 2008 05:30:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Vein Melter", "artist": {"url": "http://www.last.fm/music/Herbie+Hancock", "mbid": "27613b78-1b9d-4ec3-9db5-fa0743465fdd", "name": "Herbie Hancock"}, "url": "http://www.last.fm/music/Herbie+Hancock/_/Vein+Melter", "listeners": "70599", "comments": ["No. This tune is about junkies", "isn't this tune a reworking of \"Water Torture\" of his album Crossings? Oddly enough there it's credited to Bennie Maupin", "I'm High......... and need to hear it again....", "I Dig!", "chill the thrill", "Awesome.", "Another buddhist friend !", "The whole album this is from is 100% great, called Head Hunters. I first got this back in the 1970s,", "\" i love this track \"", "Really people? The track's titled 'Vein Melter\", of course its referring to heroin.", "TRUE JAZZ ARTIST BRO HAS BEEN PUTTING IT QUT  FOR YEARS AND STILL IS.", "favourite", "There is only One Herbie Hancock. He's been blowing people away for such a long time. Originality.", "so sweet and soulful", "gotta love the about this track section, wonder if it's true? or just an interpretation? made me laugh either way", "Happy Halloween!", "JAMM !!!", "I love that wah wah wah wah.", "well done", "Harvey Mason is the man. A truly creative drummer"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/jazz%20fusion", "name": "jazz fusion"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}, {"url": "http://www.last.fm/tag/jazz%20funk", "name": "jazz funk"}, {"url": "http://www.last.fm/tag/jazz%20piano", "name": "jazz piano"}]}, "mbid": "63d6c2fa-98be-4210-9861-5045085245c3", "duration": "550000", "playcount": "171773", "id": "1289581"}}