{"track": {"album": {"@attr": {"position": "1"}, "title": "Complete 1947-1952 (Disc 2)", "url": "http://www.last.fm/music/Thelonious+Monk/Complete+1947-1952+(Disc+2)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/4705519.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/4705519.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/4705519.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/4705519.jpg", "size": "extralarge"}], "artist": "Thelonious Monk", "mbid": ""}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Evidence", "artist": {"url": "http://www.last.fm/music/Thelonious+Monk", "mbid": "70105dc4-9881-4e99-b470-dbb5a01674d9", "name": "Thelonious Monk"}, "url": "http://www.last.fm/music/Thelonious+Monk/_/Evidence", "listeners": "73339", "comments": ["His style of playing piano with powerful tone and pulsating rhythm picks up the sound of the instrument over the general sound of the orchestra.", "watched straight no chaser years ago i was spellbound by monk and the way he attacked the piano keys said to my self this cat is baad. the one and only", "Evidently so. By triangulation the square of the Thelonious is worth as much as the squares on the other two sides. QED.", "evidence...\n :)", "Here is the Evidence of the Genius of the Be Bop Hipster Master, Mr. Thelonious Sphere Monk (His full Name).  He grew up on West 63rd Street, NYC along with Billy Batten and LeRoy Gill and other musicans. He had a special talent which did make a big difference in the world of 20th Century Music.   Vous et swing, vvia la jazz hot....A REAL MUSICAL GENIUS, Listen to the EVIDENCE....Later", "hahah...lesson well taken...if anybody missed...or skipped class...the tutorial is two doors down...prof Haden's room...", "I love Monk. The version I'm getting here is with Art Blakey's Jazz Messengers. What better drummer is there to play with Monk? Wonderfully fractured playing propelled by Art's rolling percussion", "Here is the evidence if evidence was needed. Listen to innovation. It is from a higher plane of conscienceness, an energy which is inspirational and mind expanding. This is the intuitive Thelonious School of Jazz. Money can't buy it.It is worth more than material things. Here endeth the lesson.", "Bebop. Great...", "Rockin' the vibes :P", "El Jazz es y sera la música del siglo 20 y 21 y de todos los tiempos", "just you just me = just us = justice = evidence", "The Monk rocks this shit like King-Kong on a meth binge taking out a squadron of spitfires.", "wow i love the Monk.", "mejor monk", "Monk monk monk", "This is a hell of a lot longer than Last FM thinks it is.", "heerlijk deze muziek", "ShaniaEve!  I may have had an abstract-cool dream last night in which you, ShaniaEve, and I, www.esperancesp.com , were in a very Subterranean obscure louche little bistro on 54th-53rd Street, enjoying a cool beverage near the bandstand, pleasantly nocturnally [...I recall a purple lighting effect on the stage and which light the great Thelonious, 5 feet away from us (we were together, again, your name was ShastakovoaYvette), complained to the owner about, the purple light, as \"show business faux\" -- he may have said 'synesthesia gestalt-offensive']. I had a vodka martini with lime and mint. Some of the bartenders (who knew Kerouac and Lou Welch), called it my ESP-MARTINI. Well, Monk pointed to it, by the way it was on my birthday [Oct. 1, hereto in balance on the zodiacal scale, \"feller say\", (apologies to Bill Burroughs:) --> today -- yaay!] --> and he said, indicating the ESP-MARTINI, \"Can't you hear at all? [*pointed to my E.M.*] -- use THAT color lighting, if you need more tones.\"", "Yesssssss cool...."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/bebop", "name": "bebop"}, {"url": "http://www.last.fm/tag/piano", "name": "piano"}, {"url": "http://www.last.fm/tag/jazz%20piano", "name": "jazz piano"}, {"url": "http://www.last.fm/tag/tmonk", "name": "tmonk"}]}, "mbid": "6866d273-2c4c-429c-9186-7d49be7774b8", "duration": "153000", "playcount": "171003", "id": "1251176"}}