{"track": {"album": {"@attr": {"position": "8"}, "title": "The Very Best Of John Coltrane", "url": "http://www.last.fm/music/John+Coltrane/The+Very+Best+Of+John+Coltrane", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/76959430.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/76959430.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/76959430.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/76959430.jpg", "size": "extralarge"}], "artist": "John Coltrane", "mbid": "6bcf9ed7-5468-45de-8f24-4b691cc1238e"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Impressions", "artist": {"url": "http://www.last.fm/music/John+Coltrane", "mbid": "b625448e-bf4a-41c3-a421-72ad46cdb831", "name": "John Coltrane"}, "url": "http://www.last.fm/music/John+Coltrane/_/Impressions", "listeners": "43547", "comments": ["damn ELVIN JONES", "Mad sounds. All hail Coltrane.", "aawesome", "I just enjoyed a 23 minute version of Impressions. Beautiful!", "This is incredibly visual for me. It's my favorite by Coltrane.", "I love it when versions of jazz tunes go on past the time it says they take up on the Last.fm player!", "I have this unnamed version with a stringed instrument (I reckon it's a guitar) playing the lead, 7:19 in length. Wish I knew the author of the interpretation.", "The Newport '63 version is so intense, one of my favorites. There are parts where just Coltrane and Roy Haynes are playing, going absolutely nuts and just pushing it to the limit. absolutely amazing.", ":)", "When composing this tune Coltrane maybe was inspired by a chapter of the book \"Mysticism of sound and music\" - the chapter is  titled \"Impressions\"  - the book is wrtten by Hazrat Inayat Khan - Sufi master", "I'v read all the Coltrane liner ntoes and what they say about what Coltrane \"was trying to do/ trying to accomplish.\" But when I listen to the music, it is Tyner that is most in line with that description. My vote for all-time greatest may be cast.", "this is not impressions!", "this is how i'm feelin... with coltrane, the longer the song is, the more i love it.", "for me it was his blue trane album, the first jazz i heard, was the rainy monsoons in bombay, green all around, cool breeze and coltrane", "The best of the best, moves me more than any other tune, the emotional and spirtitual communcation between man and insturument.", "Just in case you did'nt dig it yet. Let me pull your coat, impressions is mile's So what.", "I've only heard the version off the album for which it is the title track, but holy crap. This is amazing. Coltrane is fantastic.", "I'm on it.", "McCoy Tyner (p), Jimmy Garrison (b), Elvin Jones (dr) - 1963", "Here I go again"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/saxophone", "name": "saxophone"}, {"url": "http://www.last.fm/tag/hard%20bop", "name": "hard bop"}, {"url": "http://www.last.fm/tag/avant-garde", "name": "avant-garde"}, {"url": "http://www.last.fm/tag/coltrane", "name": "coltrane"}]}, "mbid": "686e08c2-fec1-4a49-acbd-9482c90f83ce", "duration": "451000", "playcount": "127504", "id": "1793769"}}