{"track": {"album": {"@attr": {"position": "10"}, "title": "Ken Burns Jazz", "url": "http://www.last.fm/music/Benny+Goodman/Ken+Burns+Jazz", "image": [{"#text": "http://images.amazon.com/images/P/B000055WWO.01._SCMZZZZZZZ_.jpg", "size": "small"}, {"#text": "http://images.amazon.com/images/P/B000055WWO.01._SCMZZZZZZZ_.jpg", "size": "medium"}, {"#text": "http://images.amazon.com/images/P/B000055WWO.01._SCMZZZZZZZ_.jpg", "size": "large"}, {"#text": "http://images.amazon.com/images/P/B000055WWO.01._SCMZZZZZZZ_.jpg", "size": "extralarge"}], "artist": "Benny Goodman", "mbid": ""}, "wiki": {"content": "&quot;Sing, Sing, Sing (With a Swing)&quot; is a 1936 song, written by Louis Prima, that has become one of the definitive songs of the big band and swing era. Although written by Prima, it is often most associated with Benny Goodman. The song has since been covered by numerous artists. It was used in the Broadway Musical Swing!\n \n On July 6, 1937, &quot;Sing, Sing, Sing&quot; was recorded in Hollywood with Benny Goodman on clarinet; Harry James, Ziggy Elman, and Chris Griffin on trumpets; Red Ballard and Murray McEachern on trombones; Hymie Schertzer and George Koenig on alto saxophones; Art Rollini and Vido Musso on tenor saxophone; Jess Stacy on piano; Allan Reuss on guitar; Harry Goodman on bass; and Gene Krupa on drums. The song was arranged by Jimmy Mundy. Unlike most big band arrangements of that era, which were limited in length to about 3 minutes so that they could be recorded on one side of a standard 10-inch 78-rpm record, the Goodman band's version of &quot;Sing, Sing, Sing&quot; was an extended work. The 1937 recording lasted 8 min 43 seconds, and took up both sides of a 12-inch 78. At its longest, a live recording (with several impromptu solos) was actually recorded and took up a whole 12 min 30 sec. Mundy's arrangement incorporated &quot;Christopher Columbus&quot;, a piece written by Chu Berry for the Fletcher Henderson band, as well as Prima's work.\n \n Benny Goodman is quoted as saying, &quot;'Sing, Sing, Sing' (which we started doing back at the Palomar on our second trip there in 1936) was a big thing, and no one-nighter was complete without it....&quot; Many swing aficionados consider the definitive performance of &quot;Sing, Sing, Sing&quot; to be from Goodman's famous 1938 Carnegie Hall jazz concert, in a performance that was very different from both the previous year's commercial release and from subsequent performances with the Goodman band. The personnel of the Goodman band for the Carnegie Hall concert was the same as for the 1937 recording session, except that Vernon Brown had replaced Murray McEachern on trombone, and Babe Russin had replaced Vido Musso on tenor sax. Goodman's solo is more introspective in the Carnegie performance, with a wider range of dynamics and colors and with Krupa playing a peculiar accompaniment accented on the third beat of the measure behind BG for the first half of the solo and Jess Stacy throwing in all manner of minor-chord punctuations. The defining difference in the performance, however, is the following solo by Stacy, a four-chorus, highly chromatic impressionistic masterpiece that sounds so different from everything that preceded it and yet somehow worked perfectly. That solo has widely analyzed by pianists both jazz and classical. Stacy was later quoted as saying he was glad he didn't know ahead of time Goodman was going to let him solo, because then he'd have gotten nervous and &quot;screwed it up.&quot;\n \n In the decades since, &quot;Sing, Sing, Sing&quot; has gone on to be one of the most visible symbols of the swing era. Easily accessible to rock audiences due to its big beat and showy drum breaks structure, it is heard everywhere from television commercials to high school marching bands. In 2005, Anita O'Day's version was remixed by RSL and was included on the Verve Remixed 3 compilation.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Sing, Sing, Sing (With a Swing)&quot; is a 1936 song, written by Louis Prima, that has become one of the definitive songs of the big band and swing era. Although written by Prima, it is often most associated with Benny Goodman. The song has since been covered by numerous artists. It was used in the Broadway Musical Swing!  On July 6, 1937, &quot;Sing, Sing, Sing&quot; was recorded in Hollywood with Benny Goodman on clarinet; Harry James, Ziggy Elman...", "published": "Fri, 14 Nov 2008 02:36:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Sing, Sing, Sing", "artist": {"url": "http://www.last.fm/music/Benny+Goodman", "mbid": "9b0b277d-f6dd-41c1-a980-7539655b515c", "name": "Benny Goodman"}, "url": "http://www.last.fm/music/Benny+Goodman/_/Sing,+Sing,+Sing", "listeners": "76388", "comments": ["Now this is swing!!", "The version from \"The Famous 1938 Carnegie Hall Jazz Concert\" LP is insanely good.", "Kickin' energy. Benny's the man. Gene on those drum is powerfully delightful.", "slammin'", "Love those drums!", "Just amazing", "wow", "timeless and amazing", "classic!!!!", "superb!", "Foot tappin music!!!!!!!!!!!!", "My wife and i heard this Music at our marriage its beautifull and greatest\nabout 25 years", "You could argue that this was the first rock and roll song. (2)", "this track is allsome", "I love this! Makes me wanna dance!", "Love the music at 4:28. Just a great song all around.", "Has to be a contender for my favourite song, and when it is Goodman on the clarinet and Krupa on the drums everything is alright in the world.", "Fantastic jive track.", "You could argue that this was the first rock and roll song.", "one of the best of all time"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/swing", "name": "swing"}, {"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/big%20band", "name": "big band"}, {"url": "http://www.last.fm/tag/30s", "name": "30s"}, {"url": "http://www.last.fm/tag/swing%20jazz", "name": "swing jazz"}]}, "mbid": "816ba916-9618-4c52-9c65-d2f42e2d7817", "duration": "522000", "playcount": "224984", "id": "1270897"}}