{"album": {"@attr": {"position": "20"}, "artist": "Frank Sinatra", "url": "http://www.last.fm/music/Frank+Sinatra/Sinatra+Reprise:+The+Very+Good+Years", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82784269.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82784269.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82784269.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82784269.png", "size": "extralarge"}], "title": "Sinatra Reprise: The Very Good Years", "mbid": "6dc1cb85-0dab-4993-8fee-93973079f2ae"}, "wiki": {"content": "&quot;Theme from New York, New York&quot; (or &quot;New York, New York&quot;) is the theme song from the Martin Scorsese film New York, New York (1977), composed by John Kander, with lyrics by Fred Ebb. It was written for and performed in the film by Liza Minnelli.\n \n In 1980, it was recorded by Frank Sinatra, for his album Trilogy: Past Present Future  (1980), and has since become closely associated with him. He occasionally performed it live with Minnelli as a duet. Sinatra recorded it a second time in duet with Tony Bennett for his 1993 album Duets.\n \n It should not be confused with the song &quot;New York, New York&quot;, from Leonard Bernstein/Adolph Green/Betty Comden's musical On the Town, which features the lyric &quot;New York, New York, is a helluva town / The Bronx is up and the Battery's down...&quot;\n \n Composers Kander and Ebb stated on the A&amp;E Biography episode about Liza Minnelli that they attribute the song's success to actor Robert De Niro, who rejected their original theme for the film because he thought it was &quot;too weak.&quot;\n \n The song did not become a popular hit until it was picked up in concert by Frank Sinatra during his performances at Radio City Music Hall in October 1978. Subsequently, Sinatra recorded it in 1979 for his 1980 Trilogy set (Reprise Records), and it became one of his signature songs. The single peaked at #30 in June 1980, becoming one of his final hits on the charts. Sinatra made two more studio recordings of the song in 1981 (for his NBC TV special The Man and His Music) and 1993 (for Capitol Records). From the latter, an electronic duet with Tony Bennett was produced for Sinatra's Duets album.\n \n The lyrics of the Sinatra versions differ slightly from Ebb's original lyrics. Notably, the phrase &quot;A-number-one,&quot; which does not appear at all in the original lyrics, is sung twice at the song's rallentando climax. (Ebb has said he &quot;didn't even like&quot; Sinatra's use of &quot;A-number-one&quot;).[1] The phrase is both the first and fourth on a list of four superlative titles the singer strives to achieve — &quot;A-number-one, top of the list, king of the hill, A-number-one&quot; — where Ebb's original lyrics were closer to &quot;king of the hill, head of the list, cream of the crop, at the top of the heap.&quot;\n \n The song has been embraced as a celebration of New York City, and is often heard at New York-area social events, such as weddings and bar mitzvahs. Many sports teams in the New York area have played this song in their arenas/stadiums, but the New York Yankees are the most prominent example. It has been played over the loudspeakers at both the original and current Yankee Stadiums at the end of every Yankee home game. At first, Sinatra's version was played after a Yankees win, and the Minnelli version after a loss. Minnelli also raised some controversy when, in 2001, she demanded that the Yankees play her version after a win, or not play it at all. The Yankees took the latter option, and played Sinatra's version after wins and losses. \n \n As of the 2005 season, at the Richmond County Bank Ballpark following Staten Island Yankees games, the Sinatra version is heard regardless of the game's outcome, and was formerly done at Shea Stadium at the end of New York Mets games after the September 11 attacks. \n \n Previously, Mets fans believed that the song was a &quot;Yankee Song,&quot; and began booing it when it was played. It actually first had snippets of the song played after World Series home runs by Ray Knight and Darryl Strawberry during Game 7 of the 1986 World Series.\n \n  The song is also sometimes played at New York Knicks games. The Sinatra version is played at the end of every New York Rangers game at Madison Square Garden. It was played at the opening faceoff of Game 7 of the 1994 Stanley Cup Finals at the Garden.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "published": "Fri, 19 Feb 2010 03:25:23 +0000", "summary": "&quot;Theme from New York, New York&quot; (or &quot;New York, New York&quot;) is the theme song from the Martin Scorsese film New York, New York (1977), composed by John Kander, with lyrics by Fred Ebb. It was written for and performed in the film by Liza Minnelli.  In 1980, it was recorded by Frank Sinatra, for his album Trilogy: Past Present Future  (1980), and has since become closely associated with him. He occasionally performed it live with Minnelli as a duet. Sinatra recorded it a second time in duet with Tony Bennett for his 1993 album Duets. "}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Theme from New York, New York", "artist": {"url": "http://www.last.fm/music/Frank+Sinatra", "mbid": "197450cd-0124-4164-b723-3c22dd16494d", "name": "Frank Sinatra"}, "url": "http://www.last.fm/music/Frank+Sinatra/_/Theme+from+New+York,+New+York", "mbid": "a6b73567-dc49-46b6-83bf-205d98726509", "comments": ["<3", "velvet, damn charming voice!!!!!!!!", "Ole' blue eyes.", "'Theme from New York, New York' is a description, not a title. The title is 'New York, New York.'' - I actually think 'Theme from...' is the correct tag since this is displayed on the Trilogy album. Each to their own though. [2]", "really nice music", "Lindo!!!", "''Theme from New York, New York' is a description, not a title. The title is 'New York, New York.'' - I actually think 'Theme from...' is the correct tag since this is displayed on the Trilogy album. Each to their own though.", "Bring it home, Frankie!", "Einne Pferdekopf im Bett?!\nWas zur Hölle...\nWenn alle aus der Mafia aussehen wie Robert de Niro, dann... :)", "Hahaha!", "dont mention that or you will find a horses head in your bed", "Word on the street is that he used to work for the Mafia...", "Beautiful", "The best song in music history.", "A true legend...", "Big apple for a new start to DSK!", "Classic. !!", "gosh, why does that song only has 235.000 scrobbles. this is the love song for NY.", "everyone thinks that Frank Sinatra sang this song - Lucille 2", "Ol' blue eyes at the top of his game."], "id": "10923", "listeners": "132203", "duration": "206000", "playcount": "445717", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/swing", "name": "swing"}, {"url": "http://www.last.fm/tag/frank%20sinatra", "name": "frank sinatra"}, {"url": "http://www.last.fm/tag/oldies", "name": "oldies"}, {"url": "http://www.last.fm/tag/easy%20listening", "name": "easy listening"}]}}