{"album": {"@attr": {"position": "5"}, "artist": "Miles Davis", "url": "http://www.last.fm/music/Miles+Davis/Kind+of+Blue", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/40450985.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/40450985.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/40450985.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/40450985.png", "size": "extralarge"}], "title": "Kind of Blue", "mbid": "3aaa9d21-4982-4c13-a1bb-caa57195fee6"}, "wiki": {"content": "“Flamenco Sketches” is a jazz composition written by American jazz trumpeter Miles Davis and pianist Bill Evans. It is the fifth track on Davis’ 1959 album Kind of Blue, the best-selling jazz record of all time, and an innovative experiment in modal jazz. The track features Miles Davis, John Coltrane, Cannonball Adderley, Paul Chambers, Jimmy Cobb and Bill Evans. \n \n The piece has no written melody, but is rather defined by a set of chord changes that are improvised over using various modes of the major scale of each tonality. Each musician separately chose the number of bars for each of the modal passages in his solo. Davis gets credit for the song form, but Evans is credited with the opening 4-bar vamp over Cmaj7 and G9sus4, which is the opening theme to his ballad improvisation “Peace Piece”. Because of the presence of this vamp, “Flamenco Sketches” is usually played as a ballad. The modes used in “Flamenco Sketches” are as follows:\n \n C Ionian (natural major scale)\n A♭ Mixolydian (Major with a minor 7th)\n B♭ Ionian\n G Harmonic Minor over D Phrygian Dominant (alternates over bass notes D and E♭)\n G Dorian\n \n Most reissues since then have included the alternate take of &quot;Flamenco Sketches&quot; as the 6th track, which is the only complete alternate take from the two recording sessions that make up this recording.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "published": "Tue, 30 Jul 2013 19:06:06 +0000", "summary": "“Flamenco Sketches” is a jazz composition written by American jazz trumpeter Miles Davis and pianist Bill Evans. It is the fifth track on Davis’ 1959 album Kind of Blue, the best-selling jazz record of all time, and an innovative experiment in modal jazz. The track features Miles Davis, John Coltrane, Cannonball Adderley, Paul Chambers, Jimmy Cobb and Bill Evans.   The piece has no written melody, but is rather defined by a set of chord changes that are improvised over using various modes of the major scale of each tonality."}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Flamenco Sketches", "artist": {"url": "http://www.last.fm/music/Miles+Davis", "mbid": "561d854a-6a28-4aa7-8c99-323e6ce46c2a", "name": "Miles Davis"}, "url": "http://www.last.fm/music/Miles+Davis/_/Flamenco+Sketches", "mbid": "d9c1e2f5-cef5-4ba6-a83a-469a973598db", "comments": ["Yo, this is Peace Piece~ Bill Evans. That's wack!", "He will remain forever in the memory of jazz musicians and jazz fans.", "This is one of the first jazz pieces I ever heard as a little kid. It's still one of my favourite jazz songs of all time.", "A great take from Miles Davis. but on my \"Kind of Bue\" the time is different with 12;22.", "A once in a lifetime artist!", "all you need to know about jazz", "sublime", "my jazz hands are out of control", "Masterpiece.", "Sublime in deed.", "Tears... beautiful", "Sublime, beautiful and wonderful. Did Trane ever play such beautiful lines before or after?", "THIS MUSIC JUST MAKES YOU WANT TO CURL UP NEXT TO YOUR MAN!!\nHOW DELIGHTFUL , DELICIOUS, AND DELANE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Flame 'n' co. at it again, sketching out of sight and roamin' free as birds.\nMiles is flame and co. is Coltrane, Evans et al.\nThis perfectly captures that magical time lost forever and our melancholic feeling about it. We will never ever forget Miles, Coltrane, Evans.....the flame never dies..........it never extinguishes our enthusiasm for jazz", "Trane of thought and melody following is sympathetic and moving and then there is Miles miles ahead in timeless flow of beauty", "talk 2 me john...talk 2 me...!", "flame 'n' co. Miles 'n Bill 'n' John......an old flame and his gang. What a line up. The best. And these are sketches!!! Can't wait for the finished masterpiece. Nine minutes of ecstasy.... Thank you Miles Davis, Bill Evans et al. So full of soul. Soulful.", "I guess there is not alot you can say except \"Wow simply wonderful\"! I had an acetate record of Kind of Blue. a really nice recording (that presence quality)  but got somewhat worn out !", "Fucking beautiful ending.", "superb soulful recollection of those sultry hot days in the Iberian Penninsular"], "id": "7150", "listeners": "275217", "duration": "560000", "playcount": "1076039", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/trumpet", "name": "trumpet"}, {"url": "http://www.last.fm/tag/cool%20jazz", "name": "cool jazz"}, {"url": "http://www.last.fm/tag/miles%20davis", "name": "miles davis"}, {"url": "http://www.last.fm/tag/instrumental", "name": "instrumental"}]}}