{"track": {"album": {"@attr": {"position": "9"}, "title": "The Ultimate Collection", "url": "http://www.last.fm/music/Nat+King+Cole/The+Ultimate+Collection", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/35559895.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/35559895.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/35559895.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/35559895.png", "size": "extralarge"}], "artist": "Nat King Cole", "mbid": "e5f4f8c4-f7ed-42bb-9760-f18ddcd666c6"}, "wiki": {"content": "This song was written by Eden Ahbez, one of the strangest songwriters of the pre-Hippie era. He was a beatnik poet, but more accurately a proto-Hippie, choosing to wear long hair, a full beard and long, white, flowing garments that promoted a Christ-like appearance. He lived in Griffith Park in Los Angeles and ate fruit, vegetables and nuts. Ahbez was born in Brooklyn in 1908, and he claimed to have been raised in an orphanage and to have crossed the US on foot 8 times before age 35. He moved to Los Angeles in the '40s, lived on 3 dollars a week, and lectured on Hollywood street corners about Oriental mysticism.\n \n Ahbez implored Nat King Cole's manager to look at his manuscript of &quot;Nature Boy.&quot; Cole recognized the Yiddish melody, liked the lyrics and added it to his act. It was well received so Cole decided to record it. One problem: Cole and Capitol Records could not find Ahbez in order to secure the publishing rights. Finally they located Ahbez, camped beneath the first L in the &quot;Hollywood&quot; sign.\n \n Nat King Cole recorded one other Ahbez song - &quot;Land of Love.&quot; Ahbez released his own album in 1960 called Eden's Island. He spent time with Brian Wilson before The Beach Boys recorded Pet Sounds. Ahbez, his wife, Anna, and their son Zoma lived in Griffith Park with their bicycle, sleeping bags and a juicer. With their unusual lifestyle, the family became legendary.\n \n According to his friend Joe Romersa, Ahbez wanted to correct the last lyric. He decided that &quot;The greatest thing you'll ever learn is to love and be loved in return,&quot; was not really what he wanted to say, since to be loved in return is too much of a deal and has nothing to do with love. Ahbez said that the last line should be, &quot;The greatest thing you'll ever learn is to love, just to love, and be loved.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "This song was written by Eden Ahbez, one of the strangest songwriters of the pre-Hippie era. He was a beatnik poet, but more accurately a proto-Hippie, choosing to wear long hair, a full beard and long, white, flowing garments that promoted a Christ-like appearance. He lived in Griffith Park in Los Angeles and ate fruit, vegetables and nuts. Ahbez was born in Brooklyn in 1908, and he claimed to have been raised in an orphanage and to have crossed the US on foot 8 times before age 35.", "published": "Mon, 3 Nov 2008 20:04:05 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Nature Boy", "artist": {"url": "http://www.last.fm/music/Nat+King+Cole", "mbid": "80c7de6a-0415-410f-ac8d-4b6406af87a6", "name": "Nat King Cole"}, "url": "http://www.last.fm/music/Nat+King+Cole/_/Nature+Boy", "listeners": "129922", "comments": ["legendary song.", "eden ahbez", "{%:+", "♥", ":-D", ":-)", "Mezmerising song!", "The minor chords are haunting in this, and the words are beautiful. Many covers of this are out there.", "I know :-)", "such a beautiful song :-)", "XOX", "Every artist who gets into the fallout playlist is an icon.\nFallout brings the 50`s to my heart.\nThank you Bethesda Softworks.", "stunning....", "One of my all time favorite songs...", "This brings a big smile to my face!", "the first version of this song I ever heard- and still, for me, THE version...", "smooooth as silk!!", "Whimsical!:)", ":)", "Masterpiece."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/oldies", "name": "oldies"}, {"url": "http://www.last.fm/tag/easy%20listening", "name": "easy listening"}, {"url": "http://www.last.fm/tag/vocal%20jazz", "name": "vocal jazz"}, {"url": "http://www.last.fm/tag/love", "name": "love"}]}, "mbid": "da5b32ad-ec61-477d-b9f4-514d64c69089", "duration": "158000", "playcount": "348188", "id": "1144656"}}