{"album": {"@attr": {"position": "7"}, "artist": "Nina Simone", "url": "http://www.last.fm/music/Nina+Simone/Anthology", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/58234589.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/58234589.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/58234589.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/58234589.png", "size": "extralarge"}], "title": "Anthology", "mbid": "8ad974f7-091f-41b7-ae1c-1294b4b32cd5"}, "wiki": {"content": "The song is her response to the murder of Medgar Evers in Mississippi; and the bombing of a church in Birmingham, Alabama, killing four black children. On the recording she cynically announces the song as &quot;a show tune, but the show hasn't been written for it yet.&quot; The song begins jauntily, with a show tune feel, but demonstrates its political focus early on with its refrain &quot;Alabama's got me so upset, Tennessee's made me lose my rest, and everybody knows about Mississippi goddam.&quot; In the song she rails on the common argument at the time that civil rights activists and African Americans should &quot;go slow&quot; and make changes in the United States incrementally: &quot;Keep on sayin' 'go slow'...to do things gradually would bring more tragedy. Why don't you see it? Why don't you feel it? I don't know, I don't know. You don't have to live next to me, just give me my equality!&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "published": "Mon, 2 Feb 2009 08:50:46 +0000", "summary": "The song is her response to the murder of Medgar Evers in Mississippi; and the bombing of a church in Birmingham, Alabama, killing four black children. On the recording she cynically announces the song as &quot;a show tune, but the show hasn't been written for it yet.&quot; The song begins jauntily, with a show tune feel, but demonstrates its political focus early on with its refrain &quot;Alabama's got me so upset, Tennessee's made me lose my rest, and everybody knows about Mississippi goddam."}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Mississippi Goddam", "artist": {"url": "http://www.last.fm/music/Nina+Simone", "mbid": "2944824d-4c26-476f-a981-be849081942f", "name": "Nina Simone"}, "url": "http://www.last.fm/music/Nina+Simone/_/Mississippi+Goddam", "mbid": "ed1c3cc0-ccd4-48ea-9bc7-834ec6a470d1", "comments": ["\"All I want is equality for my sister, my brother, my people and me\"", "I betcha thought I was kidding ya, didn't you? [2]", "NINA!!!!!!!!!!!!!!!!", "Nina on the song's origins: \"At first I gathered some materials to make a gun. I was going to take one of them out, and I didn't care who it was. Then my husband said, 'Nina, you can't kill anyone. You are a musician. Do what you do.'\" \nGathering materials to make a gun? Note that Simone suffered from bipolar disorder all her adult life and that she once made headlines for shooting and wounding a neighbor with a BB gun when his laughter disturbed her concentration. She also fired a gun at a record company executive who she accused of stealing royalties.", "Strong Lady. Strong Song. Thank you Nina!", "she had major balls to say this at the time and place that she did.", "RIP, Nina.", "Hot, hot, hot.", "Ah, Nina...I missed you so much. <3", "Deep!", "!!!", "do it slow!!!", "As a white man who once lived in the \"Deep South\" region of the U.S., and who vocally opposed the racism that was still very much alive there, at least as recently as the end of the '90s, when I moved away, this song has a special resonance for me. I don't pretend to be anything *close* to a martyr. That belongs to those who actually did die in the pursuit for civil rights in the Deep South. With that said though, I did suffer for my open opposition to racism there, and it leads me to ask, will things ever truly change there, in a really deep sense? Don't get me wrong-- there are wonderful things about the South, even for those who don't necessarily \"fit in\" well (I was one). However, it's just so sad to me that interracial relationships and marriages are seemingly no big deal where I now live, but where I was born and raised, they could still lead to one or both people being assaulted or killed. How long, O Lord, how long? We are all human beings, and we bleed the same blood.", "she is a wonderful artist!!!", "thats the true! love this song!!!!!! nina i miss you ;)", "Wow.", "You don't have to live next to me just give me my EQUALITY! [2]", "Not the best version.", "never heard this version", "up there with Martin Luther with this one in my eyes."], "id": "1033602", "listeners": "78085", "duration": "278000", "playcount": "225474", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/vocal%20jazz", "name": "vocal jazz"}, {"url": "http://www.last.fm/tag/nina%20simone", "name": "nina simone"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}}