{"track": {"album": {"@attr": {"position": "1"}, "title": "The Best Of Bobby McFerrin - The Blue Note Years", "url": "http://www.last.fm/music/Bobby+McFerrin/The+Best+Of+Bobby+McFerrin+-+The+Blue+Note+Years", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/28774077.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/28774077.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/28774077.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/28774077.jpg", "size": "extralarge"}], "artist": "Bobby McFerrin", "mbid": ""}, "wiki": {"content": "Don't Worry, Be Happy is the title and principal lyric of a song by musician Bobby McFerrin. In September of 1988, it became the first a cappella song to reach number one on the Billboard Hot 100 chart and held that position for two weeks. On the UK Singles Chart, the song reached number 2 during its fifth week on the chart. At the 1989 Grammy Awards, &quot;Don't Worry Be Happy&quot; won the awards for Song of the Year, Record of the Year, and Best Male Pop Vocal Performance. The song's title is taken from a famous quote by Meher Baba. The original music video stars Robin Williams and Bill Irwin. The &quot;instrumentals&quot; in the song are entirely composed of sounds made by McFerrin and combined in production. There are no instruments used in the song.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Don't Worry, Be Happy is the title and principal lyric of a song by musician Bobby McFerrin. In September of 1988, it became the first a cappella song to reach number one on the Billboard Hot 100 chart and held that position for two weeks. On the UK Singles Chart, the song reached number 2 during its fifth week on the chart. At the 1989 Grammy Awards, &quot;Don't Worry Be Happy&quot; won the awards for Song of the Year, Record of the Year, and Best Male Pop Vocal Performance. The song's title is taken from a famous quote by Meher Baba.", "published": "Sat, 7 Mar 2009 12:29:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Don't Worry, Be Happy", "artist": {"url": "http://www.last.fm/music/Bobby+McFerrin", "mbid": "a996b5bd-db99-4257-b036-336f63448aa2", "name": "Bobby McFerrin"}, "url": "http://www.last.fm/music/Bobby+McFerrin/_/Don%27t+Worry,+Be+Happy", "listeners": "148924", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/happy", "name": "happy"}, {"url": "http://www.last.fm/tag/vocal", "name": "vocal"}]}, "mbid": "ffb6b069-6143-47ca-b54d-b1307a1ed5c6", "duration": "289000", "playcount": "597906", "id": "1204282"}}