{"album": {"wiki": {"content": "<a href=\"http://www.last.fm/music/SuperHeavy\" class=\"bbcode_artist\">SuperHeavy</a> is a <a href=\"http://www.last.fm/tag/rock\" class=\"bbcode_tag\" rel=\"tag\">rock</a> supergroup consisting of <a href=\"http://www.last.fm/music/Mick+Jagger\" class=\"bbcode_artist\">Mick Jagger</a>, <a href=\"http://www.last.fm/music/Dave+Stewart\" class=\"bbcode_artist\">Dave Stewart</a>, <a href=\"http://www.last.fm/music/Joss+Stone\" class=\"bbcode_artist\">Joss Stone</a>, <a href=\"http://www.last.fm/music/Damian+Marley\" class=\"bbcode_artist\">Damian Marley</a>, and <a href=\"http://www.last.fm/music/+noredirect/A.+R.+Rahman\" class=\"bbcode_artist\">A. R. Rahman</a>. Stone and Stewart had collaborated in the past with Jagger.\n \n The band's formation was announced on May 20, 2011. The <a href=\"http://www.songfacts.com/detail.php?id=23376\" rel=\"nofollow\">Miracle Worker Songfacts</a> reports that the band's name came about after Damian Marley started riffing the term &quot;SuperHeavy,&quot; inspired by Muhammad Ali being the Super Heavyweight champion of the world, and the phrase became the band's catchphrase. &quot;It was Mick who said, 'Why don't we call it SuperHeavy?&quot;, recalled Stewart, &quot;We all thought about it for ages and then it sort of stuck.&quot;\n Jagger said of the band, &quot;We wanted a convergence of different musical styles... We were always overlapping styles, but they were nevertheless separate.&quot;\n \n What is SuperHeavy? <a href=\"http://www.superheavy.com\" rel=\"nofollow\">www.superheavy.com</a>\n Mick Jagger | Dave Stewart | Joss Stone | Damian “Jr Gong” Marley | A.R. Rahman\n Mick Jagger has teamed up with Eurythmics founder Dave Stewart, soul singer Joss Stone, Academy Award winning composer and global superstar A.R.Rahman and reggae star Damian “Jr Gong” Marley to form a cooperative project called SuperHeavy.\n \n This diverse and eclectic line up who share eleven Grammy Awards between them, have been recording together in various studios around the world, with the majority of the tracks on the project laid down over three weeks in Los Angeles earlier this year. Their self titled debut album will be unveiled in September and tracks include the first single ‘Miracle Worker’, plus ‘One Day One Night’, ‘Energy’, ‘Unbelievable,’ ‘SuperHeavy,’ I Can’t Take It No More,’ ‘You’re Never Gonna Change’ and ‘I Don’t Mind.’\n \n It’s little wonder that Stewart refers to SuperHeavy as, “A mad alchemist type experiment“. Fusing the talents of one of the greatest front-men of all time, a two time Academy award winning Indian composer, a soul vocal prodigy, a three time Grammy winning reggae star, and one of the most sought after producers in the world, you would expect the explosive results to defy categorisation.\n \n Formation of the bandSuperHeavy came together after Jagger and Stewart considered what a band comprising of musicians from different genres would sound like. Jagger explains, “Dave really wanted to make a record with a different group of musicians, in other words, with different backgrounds of music. Instead of everyone being a rock musician, or basically a blues musician, or some other genre, he wanted to get as many genres together that would fit. I said it sounds like a good idea, I never thought it would actually happen.”\n \n Yet soon enough Jagger found himself back in the studio with Stewart and Joss Stone, having previously worked together on the 2004 Alfie movie soundtrack. Stewart says Stone was, “an obvious choice for us. She’s such an incredible singer and spirit.” Stewart and Jagger’s dream team took further shape when they were inspired to bring Damian “Jr Gong” Marley into the mix, says Stewart, “We’d always wanted a Jamaican musician because Mick and I are crazy about Jamaica and Jamaican music.” Stewart has worked with legend Jimmy Cliff while Mick has duetted with Peter Tosh from the Wailers on the Tempatations tune “Don’t Look Back” in 1978.\n \n “We were listening to loads of stuff and suddenly a light bulb went off and we thought about Damian “Jr Gong” Marley.” Jagger had long been a fan of Marley’s, fresh from another cross-genre collaboration with American rapper Nas, citing his strength as a lyricist and toaster along with his penchant for experimentation and collaborative spirit. Marley brought on board his rhythm section, bassist and composer Shiah Coore and drummer Courtney Diedrick, while Stewart introduced the band to his long-term collaborator Ann Marie Calhoun, a rock violinist who had previously worked with the Foo Fighters.\n \n Recording in LA meant the band’s path crossed with legendary Indian composer A.R. Rahman, in the City of Angels fresh from his Slumdog Millionaire Oscar glory. Jagger explains, “We didn’t know what kind of music we’d make, we didn’t know if it would be any good, but we hoped we’d have fun.” They were thrilled to have Rahman on board, Stewart says, “He brings so much musical knowledge, amazing musicianship, melody and singing power from a different culture.”\n \n The creative process beginsDespite their disparate backgrounds, the members of SuperHeavy instantly connected and hit the ground running, writing twenty-two songs in the first six days. Stone was thrilled with the results, “That’s what you need, all these opinionated people who have been brilliant in their own field, shove them together and see what comes out. It’s really unexpected, its mind blowing” she enthuses. Similarly enthused was Rahman, “The first day I was in a daze thinking, ‘What am I doing? What’s my role?’ and then slowly we started writing with each other, and it was great. It took me way back to my high school days when I was playing in a rock band, but this one was a real one!” Jagger says of the writing process, “We ran the gamut of all our different styles mixed up, so we got Joss singing, Damian doing toasting, and me singing different styles.“\n \n However, despite the free flow of creative juices and the easy rapport they established, getting the band together in one place became very difficult, as Stewart explains, “It’s the most complicated record ever made. Imagine, some of it’s recorded in LA, some of it’s recorded in the South of France, some of it’s recorded off the coast of Cyprus, some of it’s recorded in Turkey, some of it’s recorded in Miami, some of it’s recorded in the Caribbean, and some of it’s recorded in Chennai, in India.”\n \n The project needed a name. Marley had been riffing the term “SuperHeavy”, inspired by Muhammad Ali being the super heavyweight champion of the world and the phrase became the band’s catchphrase, “It was Mick who said, ‘Why don’t we call it SuperHeavy?”, recalls Stewart, “We all thought about it for ages and then it sort of stuck.”\n \n SuperHeavy is a new and spontaneous way of working for all the collaborators as Jagger explains, “I said to Dave, normally [with the Stones] we’d always have written songs before we go into the studio,” but the jam sessions resulted in some great work. Stone explains, “It felt better when we were just jamming, that way we made it up as we went along and it was easy.”\n \n The band found a harmonious way of working together, “With five of you everyone has to give and take quite a lot. We tried to understand everyone wouldn’t be too egotistical, start throwing things around the studio, we wouldn’t have fights!” says Jagger. However they weren’t averse to telling each other to be better either, Jagger continues, “We were writing a lot of stuff and throwing it away. I would say, ‘That’s rubbish, another cliché Joss’, and she’d say, ‘Well you come up with something then!” The experience was refreshing and exciting for the band, “We’re four vocalists and we’ve never worked like that before. It’s great because the whole burdens not on you, and that made it fun.” Jagger enthuses.\n \n The SuperHeavy soundBack to that alchemical experiment, Jagger, Stewart, Marley, Rahman and Stone appear to have created a new genre. “It’s a new kind of music, it’s a new genre, one that cannot be placed” says Stone. Yet, Jagger is keen to point out the music is accessible; “It’s very approachable. If you’re a Rolling Stones fan there’s definitely stuff you can relate to. Other stuff that you can’t relate to so much, maybe if you listen you’ll enjoy it.”\n \n A first for Mick Jagger is singing in Urdu, on a song composed by Rahman, entitled “Satyameva Jayate”, meaning, “the truth alone triumphs”, Rahman wrote the song after some gentle teasing from the others. Rahman explains, “In the daytime I was playing with them, in the night time and evenings I was gigging” “Then”, says Jagger, “He didn’t come into the studio one day, so I said, ‘Where’s A.R?’ and he came in really late at night, really pleased saying, ‘I’ve got my song!’ I manage one line in Urdu, only one!“\n \n Marley’s way of working was different to the rest of the band. Stone reveals, “Damian is kind of quiet but he has some brilliant ideas. He works on stuff at night. Sometimes he’ll just go away and sit with the lyrics and bring something to it. His rhythm section brings so much. He has his own thing going in the next room so I pop in and out.” Marley would work on toasting over the record by himself and re-join the band when he was happy with it.\n \n The art of SuperHeavyThe striking artwork that graces the front of the SuperHeavy album is the work of Shepard Fairey, the artist responsible for the iconic ‘Hope’ poster used in Barack Obama’s successful election campaign.\n \n An introduction to the band members\n Mick Jagger\n \n Mick Jagger is rock’s premier frontman and one of the most popular and influential British musicians of all time. Instantly recognizable as the iconic lead singer with the Rolling Stones, the greatest rock’n'roll band in the world, he has set standards for performance and creativity that remain unmatched to this day.\n \n Dave Stewart\n \n Dave Stewart’s music career spans three decades and more than 100 million album sales, highlighted by his collaboration with Annie Lennox in the groundbreaking pop-rock group The Eurythmics (“Sweet Dreams [Are Made of This]“, “Would I Lie to You?” and dozens more).\n \n Behind the scenes, he’s produced albums and co-written songs for Stevie Nicks, Tom Petty, Bono, Sinead O’Connor, Mick Jagger, Katy Perry, Jon Bon Jovi and a host of others, racking up numerous Producer, Songwriter and Grammy Awards along the way.\n \n \n Joss Stone\n \n Joss Stone has been obsessed with soul music since she was a little girl. By the time she was in her early teens she had begun to intuitively hone her now trademark gravely-but-lustrous vocals by singing along to Aretha’s Franklin’s Greatest Hits.\n \n She began pursuing a singing career at thirteen, when she auditioned for UK talent show Star For a Night. This eventually led to a record deal and the release of Stone’s star- making debut album, ‘The Soul Sessions’, in 2003. Her second record, 2004′s ‘Mind Body &amp; Soul’ earned Stone three Grammy nominations and was followed by 2007′s ‘Introducing Joss Stone’ which achieved the highest debut billboard chart position for a female British solo artist.\n \n \n Damian “Jr Gong” Marley\n \n Though his debut album was released in 1996, Damian “Jr Gong” Marley had been honing his skills as a singer, MC, songwriter, lyricist and producer since long before then, performing both with a group and as a solo artist from the age of 13.\n \n His breakthrough album ‘Halfway Tree’ won Marley his first Grammy in 2002. This was followed in 2005 by ‘Welcome to Jamrock’ which received two more Grammys and featured the massive single of the same name.\n \n In 2010 Marley released ‘Distant Relatives’, a collaborative album with the American Rapper Nas which confronted the plight of the people of Africa.\n \n \n A. R. Rahman\n \n A two-time winner of the Academy Award (Oscar), A. R. Rahman is popularly known as the man who has redefined contemporary Indian music.\n \n Hailed by Time magazine as the ‘Mozart of Madras’, Rahman, according to a BBC estimate, has sold more than 150 million copies of his work comprising of music from more than 100 film soundtracks and albums across over half a dozen languages, including landmark scores such as ‘Roja’, ‘Bombay’, Dil Se’, ‘Taal’, ‘Lagaan’, ‘Vandemataram’ and more recently, ‘Jodhaa Akbar’, ‘Delhi 6′ and ‘Slumdog Millionaire’.\n \n \n The present and future of SuperHeavyThe astonishing video for ‘Miracle Worker’ was filmed at Paramount studios in Los Angeles and directed by Paul Boyd and Dave Stewart. All five members of the band are featured in the video which culminates with a breathtaking live performance. Click here to watch the video for Miracle Worker on YouTube.\n \n As far as the future of SuperHeavy goes, “We haven’t planned to do a tour or anything, but if people really like it maybe we will. We’d love to get out and play some of it live,” says Jagger humbly. “As soon as we started playing together in the studio it gelled, and all these different styles didn’t seem to be a problem to make them fit together… I hope people will like it….“\n \n SuperHeavy’s debut album is co-produced by Jagger &amp; Stewart and will be released by Universal Music on their A&amp;M label imprint on the 19th of September.\n \n Website :<a href=\"http://www.superheavy.com\" rel=\"nofollow\">http://www.superheavy.com</a>\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "<a href=\"http://www.last.fm/music/SuperHeavy\" class=\"bbcode_artist\">SuperHeavy</a> is a <a href=\"http://www.last.fm/tag/rock\" class=\"bbcode_tag\" rel=\"tag\">rock</a> supergroup consisting of <a href=\"http://www.last.fm/music/Mick+Jagger\" class=\"bbcode_artist\">Mick Jagger</a>, <a href=\"http://www.last.fm/music/Dave+Stewart\" class=\"bbcode_artist\">Dave Stewart</a>, <a href=\"http://www.last.fm/music/Joss+Stone\" class=\"bbcode_artist\">Joss Stone</a>, <a href=\"http://www.last.fm/music/Damian+Marley\" class=\"bbcode_artist\">Damian Marley</a>, and <a href=\"http://www.last.fm/music/+noredirect/A.+R.+Rahman\" class=\"bbcode_artist\">A. R. Rahman</a>. Stone and Stewart had collaborated in the past with Jagger.  The band's formation was announced on May 20, 2011. The <a href=\"http://www.songfacts.com/detail.php?id=23376\" rel=\"nofollow\">Miracle Worker Songfacts</a> reports that the band's name came about after Damian Marley started riffing the term &quot;SuperHeavy,&quot; inspired by Muhammad Ali being the Super Heavyweight champion of the world, and the phrase became the band's catchphrase.", "published": "Sun, 18 Sep 2011 13:54:19 +0000"}, "name": "SuperHeavy", "artist": "SuperHeavy", "url": "http://www.last.fm/music/SuperHeavy/SuperHeavy", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/67767192.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/67767192.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/67767192.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/67767192.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/67767192/SuperHeavy.png", "size": "mega"}], "listeners": "24869", "toptags": {"tag": [{"url": "http://www.last.fm/tag/2011", "name": "2011"}, {"url": "http://www.last.fm/tag/superheavy", "name": "superheavy"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/reggae", "name": "reggae"}]}, "releasedate": "    20 Sep 2011, 00:00", "mbid": "f0b7fade-b1c2-418d-87f8-b34b7c93f317", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Superheavy", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Superheavy", "mbid": "beb2c401-13b0-4361-8817-0ec81244c170", "duration": "305"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Unbelievable", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Unbelievable", "mbid": "1e3e3c21-49ed-4e5b-95c7-a0470659613e", "duration": "230"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "Miracle Worker", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Miracle+Worker", "mbid": "bec3b125-04c2-4f3e-944d-f5487050530e", "duration": "247"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Energy", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Energy", "mbid": "17199535-8cda-409f-bd8a-fc3bbffbb766", "duration": "221"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Satyameva Jayathe", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Satyameva+Jayathe", "mbid": "94a9cfbb-8f2b-4830-b411-7a3c4ba4a1ba", "duration": "247"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "One Day One Night", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/One+Day+One+Night", "mbid": "d6676631-ccc7-435e-9e89-1a08864931eb", "duration": "276"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Never Gonna Change", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Never+Gonna+Change", "mbid": "671c60cf-cc8d-4e1e-b754-c66bcfaf6fbc", "duration": "263"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Beautiful People", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Beautiful+People", "mbid": "408620ca-3476-47a5-b00a-b37717ff3d24", "duration": "299"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Rock Me Gently", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Rock+Me+Gently", "mbid": "17919a18-5c5a-4ec0-a34c-2c33513f89b6", "duration": "360"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "I Can't Take It No More", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/I+Can%27t+Take+It+No+More", "mbid": "8bb2f87c-68fe-4bac-980a-65df9c7ec836", "duration": "200"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "I Don't Mind", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/I+Don%27t+Mind", "mbid": "3e6545d1-2e0d-42ca-be57-c755cd22effd", "duration": "298"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "World Keeps Turning", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/World+Keeps+Turning", "mbid": "5997747d-f3bf-49d9-aa9f-05ed4d95da2c", "duration": "221"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "Mahiya", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Mahiya", "mbid": "6d345815-2db8-4c33-95c6-219e61f72770", "duration": "205"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "Warring People", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Warring+People", "mbid": "1a6b2cb9-cc53-4a86-bccf-1d76173d3605", "duration": "304"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "15"}, "name": "Common Ground", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Common+Ground", "mbid": "db0bcf77-35c9-49ca-9fd9-69d3ebf0f7ef", "duration": "222"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "16"}, "name": "Hey Captain", "artist": {"url": "http://www.last.fm/music/SuperHeavy", "mbid": "7c891f6b-1abd-4b35-bb48-b163bdbf9c0e", "name": "SuperHeavy"}, "url": "http://www.last.fm/music/SuperHeavy/_/Hey+Captain", "mbid": "816a9ee0-b63a-4824-a9a7-fa171db5327c", "duration": "213"}]}, "playcount": "378057", "id": "276749841"}}