{"track": {"album": {"@attr": {"position": "14"}, "title": "Little Walter", "url": "http://www.last.fm/music/Little+Walter/Little+Walter", "image": [{"#text": "http://images.amazon.com/images/P/B00004UGYX.01.MZZZZZZZ.jpg", "size": "small"}, {"#text": "http://images.amazon.com/images/P/B00004UGYX.01.MZZZZZZZ.jpg", "size": "medium"}, {"#text": "http://images.amazon.com/images/P/B00004UGYX.01.MZZZZZZZ.jpg", "size": "large"}, {"#text": "http://images.amazon.com/images/P/B00004UGYX.01.MZZZZZZZ.jpg", "size": "extralarge"}], "artist": "Little Walter", "mbid": "e15a2648-73a1-4fd1-945b-8f1ed039fb7d"}, "wiki": {"content": "&quot;Juke&quot; is a harmonica instrumental recorded by then 22-year-old Chicago bluesman <a href=\"http://www.last.fm/music/Little+Walter\" class=\"bbcode_artist\">Little Walter</a> Jacobs in 1952. Although <a href=\"http://www.last.fm/music/Little+Walter\" class=\"bbcode_artist\">Little Walter</a> had been recording sporadically for small Chicago labels over the previous five years, and had appeared on <a href=\"http://www.last.fm/music/Muddy+Waters\" class=\"bbcode_artist\">Muddy Waters</a>' records for the Chess label since 1950, Juke was Little Walter's first hit, and it was the most important of his career. Due to the influence of Little Walter on blues harmonica, Juke is now considered a <a href=\"http://www.last.fm/tag/blues\" class=\"bbcode_tag\" rel=\"tag\">blues</a> <a href=\"http://www.last.fm/tag/harmonica\" class=\"bbcode_tag\" rel=\"tag\">harmonica</a> standard.\n \n In May 1952, Little Walter had been a regular member of the Muddy Waters Band for at least 3 years. Juke was recorded on 12 May 1952 at the beginning (not the end, as commonly thought) of a recording session with Muddy Waters and his band, which at the time consisted of Waters and <a href=\"http://www.last.fm/music/Jimmy+Rogers\" class=\"bbcode_artist\">Jimmy Rogers</a> on guitars, and <span title=\"Unknown artist\" class=\"bbcode_unknown\">Elga Edmunds</span> on drums, in addition to Little Walter on harmonica. The originally released recording of Juke was the first completed take of the first song attempted at the first Little Walter session for Leonard Chess; the song was released three months later on Chess's subsidiary label Checker Records. The song was recorded by recording engineer Bill Putnam at his Universal Recorders studio at 111 E. Ontario St. on the near north side of Chicago, Illinois. (Coincidentally, several years earlier Putnam had recorded one of the few other harmonica instrumentals ever to become a hit record, &quot;<a title=\"Harmonicats &ndash; Peg O' My Heart\" href=\"http://www.last.fm/music/Harmonicats/_/Peg+O%27+My+Heart\" class=\"bbcode_track\">Peg O' My Heart</a>&quot; by The <a href=\"http://www.last.fm/music/Harmonicats\" class=\"bbcode_artist\">Harmonicats</a>.)\n \n After recording two takes of Juke (the second, vastly different alternate take - <a title=\"Little Walter &ndash; Juke (Alternate Take)\" href=\"http://www.last.fm/music/Little+Walter/_/Juke+(Alternate+Take)\" class=\"bbcode_track\">Juke (Alternate Take)</a> - finally being issued for the first time over 40 years later), at the same session Little Walter recorded &quot;<a title=\"Little Walter &ndash; Can't Hold On Much Longer\" href=\"http://www.last.fm/music/Little+Walter/_/Can%27t+Hold+On+Much+Longer\" class=\"bbcode_track\">Can't Hold On Much Longer</a>&quot;, which took considerably more takes than Juke to complete. After the completion of Little Walter's recordings, Muddy Waters recorded his only song that day, &quot;<a title=\"Muddy Waters &ndash; Please Have Mercy\" href=\"http://www.last.fm/music/Muddy+Waters/_/Please+Have+Mercy\" class=\"bbcode_track\">Please Have Mercy</a>&quot;, backed by Little Walter and the band.\n \n Juke reached the number-one spot on Billboard's R&amp;B chart, unheard of for a harmonica instrumental; no other harmonica instrumental ever achieved this feat, before or since. Juke was not only a major success for Little Walter, but it was the biggest hit for Chess or any of its associated labels until that time, and only the third Chess record to hit #1. Juke stayed in the #1 spot for 8 weeks, surpassing both previous Chess #1s, which had occupied the #1 position for a combined total of 6 weeks. The record stayed on the Billboard charts for a total of 20 weeks, and was one of the biggest R&amp;B hits in the U.S. in 1952.\n \n The hit song launched Little Walter's successful solo career, and he immediately left the Muddy Waters band to form his own band, which was initially known as &quot;<a href=\"http://www.last.fm/music/Little+Walter+and+His+Jukes\" class=\"bbcode_artist\">Little Walter and His Jukes</a>&quot; in order to capitalize on the success of his hit single. Beginning with the massive success of Juke, Little Walter would go on to eclipse the chart success of his former boss Muddy Waters through the rest of the 1950s.\n \n Juke became the most important and influential song for blues harmonica players of the era, and was expected to be in the repertoire of any serious blues harmonica player; at least in Chicago, blues harmonica players were judged on the ability to play it. In addition, Juke popularized the Chicago blues harmonica technique still in use today by harmonica players around the world: using a small hand-held microphone cupped to the harmonica to produce a dynamic, rich and slightly distorted amplified harmonica sound.\n \n Juke is played as a swinging shuffle featuring a boogie-woogie guitar pattern, and is originally in the major key of E; since Walter played in second position (cross harp), the harmonica he used is actually in the key of A. Juke is a standard 12-Bar blues song, set for the most part in the time signature of 4:4, but its time changes once to 3:4 and once to 2:4. Juke contains 8 choruses.\n \n The harmonica in Juke is deep-toned and features long saxophone-like phrases. Juke is a dynamic song, building and releasing in intensity several times. The opening eight bars of the song, or &quot;head&quot;, consist of a repeated six note phrase commonly and frequently played by jazz and swing horn players in the 1940s and '50, but of undetermined origin. The remainder of the song is an improvisation of Little Walter's own invention.\n \n Juke was originally titled on the recording session log as &quot;Your Pat Will Play&quot;; later it was discovered that this was a mistake, a mis-hearing of Little Walter's intended title, &quot;Your Cat Will Play&quot;. The song was re-named &quot;Juke&quot; upon release in August of 1952, probably by label owner Leonard Chess.\n \n <a href=\"http://www.last.fm/music/Junior+Wells\" class=\"bbcode_artist\">Junior Wells</a> later claimed that he was playing Juke prior to Little Walter's recording of it, although he never recorded it. <a href=\"http://www.last.fm/music/Snooky+Pryor\" class=\"bbcode_artist\">Snooky Pryor</a>'s 1948 recording &quot;<a title=\"Snooky Pryor &ndash; Snooky and Moody's Boogie\" href=\"http://www.last.fm/music/Snooky+Pryor/_/Snooky+and+Moody%27s+Boogie\" class=\"bbcode_track\">Snooky and Moody's Boogie</a>,&quot; begins with precisely the same repeated ascending riff that Little Walter uses in the first eight bars of Juke, although the remainder is distinctly different. (Prior himself claimed in an interview that Walter &quot;picked up 'Snooky and Moody's Boogie' and made Juke out of it.&quot;) <a href=\"http://www.last.fm/music/Jimmy+Rogers\" class=\"bbcode_artist\">Jimmy Rogers</a>, guitarist on Juke, claimed that parts of Juke were based on an unrecorded intermission/theme song frequently played by piano player <a href=\"http://www.last.fm/music/Sunnyland+Slim\" class=\"bbcode_artist\">Sunnyland Slim</a>, which he called &quot;Get Up The Stairs Madamoiselle&quot;.\n \n Juke has been covered by <a href=\"http://www.last.fm/music/Big+Walter+Horton\" class=\"bbcode_artist\">Big Walter Horton</a>, <a href=\"http://www.last.fm/music/James+Cotton\" class=\"bbcode_artist\">James Cotton</a>, <a href=\"http://www.last.fm/music/Billy+Branch\" class=\"bbcode_artist\">Billy Branch</a>, <a href=\"http://www.last.fm/music/Paul+Butterfield\" class=\"bbcode_artist\">Paul Butterfield</a> and <a href=\"http://www.last.fm/music/Carey+Bell\" class=\"bbcode_artist\">Carey Bell</a>, among others.\n \n On December 19th, 2007, The Recording Academy announced that it was inducting Little Walter's recording of Juke into the Grammy Hall of Fame in 2008, as a song that &quot;...[exemplifies] the best qualities that make the recording arts such a vital part of our culture — and each not only uniquely reflects the zeitgeist of its time, but also possesses the enduring power of transcending time.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Juke&quot; is a harmonica instrumental recorded by then 22-year-old Chicago bluesman <a href=\"http://www.last.fm/music/Little+Walter\" class=\"bbcode_artist\">Little Walter</a> Jacobs in 1952. Although <a href=\"http://www.last.fm/music/Little+Walter\" class=\"bbcode_artist\">Little Walter</a> had been recording sporadically for small Chicago labels over the previous five years, and had appeared on <a href=\"http://www.last.fm/music/Muddy+Waters\" class=\"bbcode_artist\">Muddy Waters</a>' records for the Chess label since 1950, Juke was Little Walter's first hit, and it was the most important of his career. Due to the influence of Little Walter on blues harmonica, Juke is now considered a <a href=\"http://www.last.fm/tag/blues\" class=\"bbcode_tag\" rel=\"tag\">blues</a> <a href=\"http://www.last.fm/tag/harmonica\" class=\"bbcode_tag\" rel=\"tag\">harmonica</a> standard.  ", "published": "Thu, 15 Oct 2009 00:16:33 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Juke", "artist": {"url": "http://www.last.fm/music/Little+Walter", "mbid": "5545a012-0977-46ff-9d69-39bf5952616f", "name": "Little Walter"}, "url": "http://www.last.fm/music/Little+Walter/_/Juke", "listeners": "48650", "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/harmonica", "name": "harmonica"}, {"url": "http://www.last.fm/tag/chicago%20blues", "name": "chicago blues"}, {"url": "http://www.last.fm/tag/instrumental", "name": "instrumental"}, {"url": "http://www.last.fm/tag/harmonica%20blues", "name": "harmonica blues"}]}, "mbid": "00bacf78-6bfe-4b34-bf18-a4136b1c3bd6", "duration": "164000", "playcount": "112935", "id": "3532954"}}