{"track": {"album": {"@attr": {"position": "3"}, "title": "Led Zeppelin", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90391351.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90391351.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90391351.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90391351.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "913e4310-e710-4f8d-8c33-41befd7591f1"}, "wiki": {"content": "The song was recorded by various rock musicians, including Jeff Beck on his album Truth (1968), and most famously by English rock band Led Zeppelin on their debut album Led Zeppelin (1969).\n \n Since the Led Zeppelin version was released in 1969, months after Beck's, he accused them of stealing his idea. This, along with the overall similarity between the sound of Led Zeppelin and that of Truth, led to a long rift between Beck and Led Zeppelin's Jimmy Page.[1] Beck and Page had been friends for years at that point.[2] Interestingly, Led Zeppelin bassist and keyboardist John Paul Jones had played the organ on Beck's version of the song as well, while still a session musician.\n \n In an interview he gave in 1977, Page commented:\n “ \t[Led Zeppelin had] done our first LP ... with “You Shook Me”, and then I heard [Beck had] done “You Shook Me” ... I was terrified because I thought they’d be the same. But I hadn’t even known he’d done it, and he hadn’t known that we had.[3] \t”\n \n In another interview, also given by Page in 1977, he elaborated:\n “ \t[Beck] had the same sort of taste in music as I did. That's why you'll find on the early LPs we both did a song like &quot;You Shook Me.&quot; It was the type of thing we'd both played in bands. Someone told me he'd already recorded it after we'd already put it down on the first Zeppelin album. I thought, &quot;Oh dear, it's going to be identical,&quot; but it was nothing like it, fortunately. I just had no idea he'd done it. It was on Truth but I first heard it when I was in Miami after we'd recorded our version. It's a classic example of coming from the same area musically, of having a similar taste.[2] \t”\n \n For his part, Beck has said that he first heard that Page had recorded the same song was when Page himself played it to him:\n “ \tHe said, &quot;Listen to this. Listen to Bonzo, this guy called John Bonham that I've got.&quot; And so I said I would, and my heart just sank when I heard &quot;You Shook Me&quot;. I looked at him and said &quot;Jim, what?&quot; and the tears were coming out with anger. I thought &quot;This is a piss-take, it's got to be.&quot; I mean, there's Truth still spinning on everybody's turntable, and this turkey's come out with another version. Oh boy ... then I realised it was serious, and he did have this heavyweight drummer, and I thought &quot;Here we go again&quot; - pipped at the post kind of thing.[4] \t”\n \n On the Led Zeppelin recording, Jones double tracked the organ and the electric piano. Page used his &quot;backward echo&quot; technique on this towards the end with Robert Plant's screaming vocals and the guitar. This production technique involved hearing the echo before the main sound instead of after it, achieved by turning the tape over and employing the echo on a spare track, then turning the tape back over again to get the echo preceding the signal. Page had originally developed the method when recording the single &quot;Ten Little Indians&quot; with The Yardbirds in 1967.[5]\n \n &quot;You Shook Me&quot; was one of the first Led Zeppelin songs to feature the call-and-response effect of blues style music, a style used frequently by the band on subsequent studio tracks and live in concert.[1] Jimmy Page uses a slide on this track and the song opens with a blues lick reminiscent to that of Elmore James. Perhaps because the song so effectively showcases the talents of all four band members, it was played frequently during early Led Zeppelin concerts. From 1973, however, the song was dropped from the band's live setlist as they began to incorporate more material from subsequent albums into their on-stage performances. (In fact, in its entirety the song was played until October 1969, and until 1973 it was from time to time added as a part of &quot;Whole Lotta Love&quot;).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The song was recorded by various rock musicians, including Jeff Beck on his album Truth (1968), and most famously by English rock band Led Zeppelin on their debut album Led Zeppelin (1969).  Since the Led Zeppelin version was released in 1969, months after Beck's, he accused them of stealing his idea. This, along with the overall similarity between the sound of Led Zeppelin and that of Truth, led to a long rift between Beck and Led Zeppelin's Jimmy Page.", "published": "Fri, 2 Jan 2009 03:59:37 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "You Shook Me", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/You+Shook+Me", "listeners": "307525", "comments": ["SHAVED PUSSY", "HAPPENS", "sexy as Hell (2)", "Jimmy Page could sing happy b-day and I'd LOve it;) What a voice! 0.what a band♥", "sexy as Hell", "I have a bird that whistles, I have a bird that sings...", "just... wow ;)", "page's guitar vs plant's voice", "Rocked back and forth so much I thought I had Parkinsons.", "1.turn volume up\r\n2.lean back and listen\r\n3.mop the brain", "so true--really a monster album---quickly over shadowed by led zep II", "so heavy sounding when this first came out it blew everybody mind", "Solid Rock n Roll blues!", "What a blues monster", "Baby, baby, please come home ;)", "I said you shoooooook me babbbbby, you shook me allllll night lonnnnnnnnnnngg", "Classic Zep! ♫ ♥ ♥ ♥ ♫", "One of Zep's BEST!", "great cover", "strip song"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}]}, "mbid": "00eca842-a1e1-4c71-90db-fda0fcfc49e8", "duration": "388000", "playcount": "1498945", "id": "12739"}}