{"track": {"album": {"@attr": {"position": "3"}, "title": "Cow Fingers and Mosquito Pie", "url": "http://www.last.fm/music/Screamin%27+Jay+Hawkins/Cow+Fingers+and+Mosquito+Pie", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/80933751.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/80933751.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/80933751.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/80933751.png", "size": "extralarge"}], "artist": "Screamin' Jay Hawkins", "mbid": "4c25cbca-bd52-4fca-8fbf-702374620419"}, "wiki": {"content": "“I Put a Spell on You” \n  \n Single by Screamin' Jay Hawkins\n from the album At Home with Screamin' Jay Hawkins \n Released 1957 \n Format 7&quot; 45 RPM \n Genre Rock and Roll \n Length 2:25 \n Label Grand (1949)[dubious – discuss]\n OKeh (1957) \n Writer(s) Screamin' Jay Hawkins \n Producer Arnold Maxon \n \n &quot;I Put a Spell on You&quot; is a 1957 song written by Screamin' Jay Hawkins, whose recording was selected as one of The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll. It was also ranked #313 on the Rolling Stone magazine's list of The 500 Greatest Songs of All Time. The song was later covered by numerous other artists, including Creedence Clearwater Revival, Crazy World of Arthur Brown, Nina Simone, The Animals, Them, The Alan Price Set and Marilyn Manson.\n \n \n The original version\n Hawkins had originally intended to record &quot;I Put a Spell on You&quot; as a refined love song, a blues ballad. He reported, however, that the producer &quot;brought in ribs and chicken and got everybody drunk, and we came out with this weird version. I don't even remember making the record. Before, I was just a normal blues singer. I was just Jay Hawkins. It all sort of just fell in place. I found out I could do more destroying a song and screaming it to death.&quot;\n \n Some sources claim that &quot;I Put a Spell on You&quot; had been released earlier than 1956 in a more sedate form, but this has not been verified. The date of 1949 for an original release on the Grand label would appear unlikely, since it predates both the formation of the record label and the beginning of Hawkins's performing career.\n \n &quot;I Put a Spell on You&quot; became a quick success, despite being banned by some stores and radio stations. A softer version minus certain sounds deemed &quot;cannibalistic&quot; reached the Top 40 and brought Hawkins together with Alan Freed and his &quot;Rock and Roll Review&quot;.\n \n Up to this time, Hawkins had been a blues performer, emotional, but not wild. Freed suggested a gimmick to capitalize on the &quot;demented&quot; sound of &quot;I Put a Spell on You&quot;: Hawkins wore a long cape, and appeared onstage by rising out of a coffin in the midst of smoke and fog.\n \n The act was a sensation, later bolstered by tusks worn in Hawkins' nose, on-stage snakes and fireworks, and a cigarette-smoking skull named &quot;Henry&quot;. The theatrical act was one of the first shock rock performances, and was the progenitor of much that came later in rock and roll, including Dr. John, Alice Cooper, Eric Burdon, Screaming Lord Sutch, Warren Zevon, Arthur Brown, Black Sabbath, Ted Nugent, George Clinton, The Butthole Surfers, The Cramps, and Marilyn Manson, among the many who vied for Hawkins' title as a rock and roll madman.\n \n “I Put a Spell on You” \n  \n Single by Sonique \n Released 25 April 2001 (US) \n Format CD Single \n Genre Pop \n Sonique singles chronology \n &quot;Sky&quot;\n (2000) &quot;I Put a Spell on You&quot;\n (2001) &quot;Can't Make Up My Mind&quot;\n (2003) \n  \n Alternate cover \n [[Image:|Alternate cover|200px]] \n  \n \n [edit] Covers and samples\n &quot;I Put a Spell on You&quot; has been covered dozens of times, perhaps most famously by Nina Simone on the 1965 album I Put A Spell On You, but also by performers such as\n \n Alan Price \n The Animals \n Natacha Atlas \n Audience \n Jimmy Barnes \n Batmobile \n Tab Benoit \n Eric Burdon performed it live at his show in Lugano in 2006. \n Nick Cave's band The Birthday Party \n Champion with guest vocalist Betty Bonifassi \n Ray Charles \n Joe Cocker \n Crazy World of Arthur Brown \n Creedence Clearwater Revival (who performed it at Woodstock) \n Tim Curry \n Julien Doré \n Eels \n Estelle \n Bryan Ferry. This cover peaked at #18 in the UK charts in 1993. \n Diamanda Galas \n Buddy Guy (featuring Carlos Santana) \n Veronika Harcsa Hungarian jazz singer \n Jarboe \n Queen Latifah \n Phil Lesh &amp; Friends (Famously covered the song at the Nokia Theater in New York City on Halloween Night 2007) \n Marilyn Manson \n Katie Melua \n Kim Nalley \n Alan Price and The Electric Blues Company \n Gabriel Rios \n Roxy Music \n She and Him \n Sonique's version of the song peaked at #8 in the UK in 2001. \n Them (featuring Van Morrison) \n Pete Townshend on his Deep End Live! album (with David Gilmour). \n Bonnie Tyler \n Leslie West \n Demon Fuzz \n Most of the covers treat the song seriously; few attempt to duplicate Hawkins's bravura performance. Arthur Brown comes close.\n \n In 1966, James Brown used an arrangement near identical to &quot;I Put a Spell on You&quot;'s for his hit, &quot;It's a Man's Man's Man's World&quot;. In 1967, the arrangement was used once more for Frank Sinatra's &quot;The World We Knew (Over and Over)&quot;.\n \n Also, it has been sampled on tracks by The Notorious B.I.G. (“Kick In The Door”), The Beatnuts (&quot;Se Acabo&quot;) and LL Cool J (“LL Cool J”).\n \n It is also sung by Bette Midler, Kathy Najimy, and Sarah Jessica Parker in the 1993 Disney Film Hocus Pocus.\n \n \n [edit] In the media\n In films, it has been performed (with different lyrics) by Bette Midler in Disney's Halloween movie, Hocus Pocus, of which this version has been used as exit music for the HalloWishes Halloween-themed fireworks show at Mickey's Not-So-Scary Halloween Party in Walt Disney World's Magic Kingdom theme park; while the original version has also been covered by Diamanda Galás, which was featured in Oliver Stone's Natural Born Killers. Marilyn Manson's version was featured in David Lynch's Lost Highway as well as television ads for M. Night Shyamalan's The Sixth Sense. The Creedence Clearwater Revival version and the Nina Simone version were used in Rebecca Miller's The Ballad of Jack and Rose. It has been also played in an episode of The Simpsons (I'm Spelling as Fast as I Can) and an episode of The PJ's. It was featured in the movie Stranger Than Paradise. Hawkins performed the song on film in A Rage in Harlem and the song was also used in the Supernatural episode, &quot;Malleus Maleficarum&quot;.\n \n The Hawkins version has even become a standard accompaniment for ice skaters, including Michelle Kwan, Alexei Urmanov and the team of Elizabeth Punsalan and Jerod Swallow.\n \n The song has also figured in countless radio and television advertisements, such as those for Pringles, Levi's, McDonald's and Burger King.\n \n It has recently featured in the BBC's Holby City promotional advert, and rock musician Danko Jones plays the track after every live show he performs with his band.\n \n Don Imus has used a sample of this song to bridge a cut to a radio commercial for many years\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "“I Put a Spell on You” \n  \n Single by Screamin' Jay Hawkins\n from the album At Home with Screamin' Jay Hawkins \n Released 1957 \n Format 7&quot; 45 RPM \n Genre Rock and Roll \n Length 2:25 \n Label Grand (1949)\n OKeh (1957) \n Writer(s) Screamin' Jay Hawkins \n Producer Arnold Maxon   &quot;I Put a Spell on You&quot; is a 1957 song written by Screamin' Jay Hawkins, whose recording was selected as one of The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll. It was also ranked #313 on the Rolling Stone magazine's list of The 500 Greatest Songs of All Time.", "published": "Thu, 26 Mar 2009 13:57:35 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "I Put a Spell On You", "artist": {"url": "http://www.last.fm/music/Screamin%27+Jay+Hawkins", "mbid": "185af318-55c7-405f-8b00-0fa308e56da9", "name": "Screamin' Jay Hawkins"}, "url": "http://www.last.fm/music/Screamin%27+Jay+Hawkins/_/I+Put+a+Spell+On+You", "listeners": "187553", "comments": ["<¹³>~", "God damn incredible.", "Groooooarrrrrrrr", "Porque ?", "° ♥ ♫¸¸.• ( ace ) •.¸¸ ♫ ♥ °", "the grandfather of shock rock.what a fantastic voice,if you dont love this ,you already dead.", "How could you not love the man who was the basis for the Tasmanian Devil?", "One of the greatest things ever recorded. [2]", "<3", "One of the greatest things ever recorded.", "looove it!", "GREAT!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "by that time, the first black man who scared white people. well done, jay!!! A+", "\"Screamin' Jay's my main man.\"", "so amazing!", "X3", "this and the nina simone versions are golden", "lol.... Screamin' Jay. Gotta love 'em.", "hahahahahahahahahhah bblblbllblbbmlarararararararragaga! :) - 444", "you gotta appreciate the skill of being able to shout like a crazy man and it still be in tune. Hard to do."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/rhythm%20and%20blues", "name": "rhythm and blues"}, {"url": "http://www.last.fm/tag/halloween", "name": "halloween"}, {"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/voodoo", "name": "voodoo"}]}, "mbid": "01640da3-0baf-4457-8888-19bfe9e42bc4", "duration": "146000", "playcount": "639175", "id": "1214590"}}