{"track": {"album": {"@attr": {"position": "6"}, "title": "AXIS: Bolder Than Love", "url": "http://www.last.fm/music/Jimi+Hendrix/AXIS:+Bolder+Than+Love", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92935469.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92935469.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92935469.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92935469.png", "size": "extralarge"}], "artist": "Jimi Hendrix", "mbid": "34612d16-f249-4af1-be52-b1513a1d1ac1"}, "wiki": {"content": "Little Wing is a song written by Jimi Hendrix. He first recorded the song on the 1967 album Axis: Bold as Love. It is ranked #357 on the Rolling Stone magazine's list of &quot;the 500 Greatest Songs of All Time&quot;, and has been covered by numerous artists, notably Derek and the Dominoes, Joe Satriani, Stevie Ray Vaughan, Pearl Jam, Sting, John Mayer, The Corrs, Toto among many others.\n \n &quot;Little Wing&quot; is played using the unique chord/melody guitar style that Hendrix developed during his early career stints in rhythm and blues bands. In this style, the guitar sounds as though it is playing two parts. This is done by simultaneously playing multiple complementary notes, often parts of chords, and then changing a note within the chord to create a melodic effect. Other songs played in this style include &quot;Life Without You&quot; by Stevie Ray Vaughan, &quot;Catch The Rainbow&quot; by Rainbow, &quot;When A Blind Man Cries&quot; by Deep Purple &quot;The Boy From Seattle&quot; by Steve Vai, &quot;Yellow Ledbetter&quot; by Pearl Jam, and &quot;Under the Bridge&quot; by Red Hot Chili Peppers. The unusual flanging sound of the lead guitar part is a result of the Doppler effect which is created using a rotating speaker cabinet, or Leslie speaker.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Little Wing is a song written by Jimi Hendrix. He first recorded the song on the 1967 album Axis: Bold as Love. It is ranked #357 on the Rolling Stone magazine's list of &quot;the 500 Greatest Songs of All Time&quot;, and has been covered by numerous artists, notably Derek and the Dominoes, Joe Satriani, Stevie Ray Vaughan, Pearl Jam, Sting, John Mayer, The Corrs, Toto among many others.  &quot;Little Wing&quot; is played using the unique chord/melody guitar style that Hendrix developed during his early career stints in rhythm and blues bands.", "published": "Sat, 7 Mar 2009 12:40:45 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Little Wing", "artist": {"url": "http://www.last.fm/music/Jimi+Hendrix", "mbid": "06fb1c8b-566e-4cb2-985b-b467c90781d4", "name": "Jimi Hendrix"}, "url": "http://www.last.fm/music/Jimi+Hendrix/_/Little+Wing", "listeners": "398018", "comments": ["take me back! to good times!!!", "Take anything you want from me.", "When I click on my Rolling Stones station, I hear 20 or MORE others, but NO Rolling Stones. In 20 tries, I would THINK you could get it right! WHAT IS THE PROBLEM? Dave Reamy", "I take it back.", "classic", "ugh this song is just too fucking good", "Most beautiful song ever!!!!!!!!!", "my first love.", "This song is a pearl.\nwww.jackybullfrog.com", "What a magnificent mind!", "beautiful", "Me too djnonplus. I love Stevie's version of it best, but the lyrics are truly beautiful as well. The original is gorgeous. I really despise that people debate who did Little Wing best. It's like Amazing Grace, anyone can take a spin on it and make it their own. In any form, it soothes me.", "I've loved this song since I was very young. Always made me feel at peace. So beautiful.", "Great song by a great artist. However, I do like Derek and Dominoes version better", "Fully Crimson-Phantom, the only problem with this track is it's not nearly long enough!  It's one of my all time fav tracks, ever, just wish there was more of it.", "I love when my lastfm radio reads my mind....could do without the commercials every four songs though :P", "If only it was longer...", "Unusual cover of this tune by Skid Row on a little CD called \"B-Sides Ourselves\".  All covers by Hendrix, Rush, Kiss, Judas Priest, and others.", "this song kills every thing out there, long live jimi", "One of my favourite songs of all time."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/psychedelic", "name": "psychedelic"}]}, "mbid": "01727ba6-6501-43b7-8078-2d0eac6e8ec7", "duration": "142000", "playcount": "2080646", "id": "11078"}}