{"track": {"album": {"@attr": {"position": "1"}, "title": "Eric Clapton's Rainbow Concert", "url": "http://www.last.fm/music/Eric+Clapton/Eric+Clapton%27s+Rainbow+Concert", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87367981.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87367981.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87367981.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87367981.jpg", "size": "extralarge"}], "artist": "Eric Clapton", "mbid": ""}, "wiki": {"content": "Layla is the title track on the <a href=\"http://www.last.fm/music/Derek+and+the+Dominos\" class=\"bbcode_artist\">Derek and the Dominos</a> album <a title=\"Derek and the Dominos - Layla And Other Assorted Love Songs\" href=\"http://www.last.fm/music/Derek+and+the+Dominos/Layla+And+Other+Assorted+Love+Songs\" class=\"bbcode_album\">Layla And Other Assorted Love Songs</a>, released in December 1970. It is considered one of rock music's definitive love songs, featuring an unmistakable guitar figure, played by <a href=\"http://www.last.fm/music/Eric+Clapton\" class=\"bbcode_artist\">Eric Clapton</a> and <a href=\"http://www.last.fm/music/Duane+Allman\" class=\"bbcode_artist\">Duane Allman</a>, as lead-in. Its famously contrasting movements were composed separately by Clapton and Jim Gordon.\n \n Inspired by Clapton's then-unrequited love for Pattie Boyd, the wife of his friend and fellow musician <a href=\"http://www.last.fm/music/George+Harrison\" class=\"bbcode_artist\">George Harrison</a>, &quot;Layla&quot; was unsuccessful on its initial release. The song has since experienced great critical and popular acclaim. It is often hailed as being among the greatest rock songs of all time. Two versions have achieved chart success, first in 1972 and again twenty years later. In 2004, it was ranked #27 on Rolling Stone's list of The 500 Greatest Songs of All Time.\n \n The album Layla and Other Assorted Love Songs opened to lackluster sales (the album never reached the charts in Britain) as with Clapton unmentioned except on the back it appeared to be a double album from an unknown band. In addition the song's length proved prohibitive for radio airplay; as a result an edited version of the song, trimmed to 2:43, was released as a single in March 1971 by Atco (U.S.). It peaked at only #51 on the Billboard Hot 100.\n \n During the late 1980s and early 1990s, the iconic guitar riff from Layla featured on a series of British TV adverts for Vauxhall cars. It also featured prominently in the 1990 film Goodfellas.\n \n In 1992, Clapton was invited to play for the MTV Unplugged series. His subsequent album, Unplugged, featured a number of blues standards and his new &quot;Tears in Heaven&quot;. It also featured an &quot;unplugged&quot; version of &quot;Layla&quot;. The new arrangement slowed down and reworked the original riff and dispensed with the piano coda. This version climbed to number twelve on the U.S. charts but failed to chart in Britain. It would later win a Grammy Award in 1992 for Best Rock Song, beating out &quot;Smells Like Teen Spirit&quot; by Nirvana. The win would later be named one of the 10 biggest upsets in Grammy history by Entertainment Weekly.[\n \n &quot;Layla&quot; is featured on a number of &quot;greatest ever&quot; lists, including The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll, 27th place on Rolling Stone's The 500 Greatest Songs of All Time and 16th place on VH1's 100 Greatest Songs of Rock and Roll. &quot;Layla&quot; also has had an effect on popular culture, with the piano coda featured in Martin Scorsese's film Goodfellas.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Layla is the title track on the <a href=\"http://www.last.fm/music/Derek+and+the+Dominos\" class=\"bbcode_artist\">Derek and the Dominos</a> album <a title=\"Derek and the Dominos - Layla And Other Assorted Love Songs\" href=\"http://www.last.fm/music/Derek+and+the+Dominos/Layla+And+Other+Assorted+Love+Songs\" class=\"bbcode_album\">Layla And Other Assorted Love Songs</a>, released in December 1970. It is considered one of rock music's definitive love songs, featuring an unmistakable guitar figure, played by <a href=\"http://www.last.fm/music/Eric+Clapton\" class=\"bbcode_artist\">Eric Clapton</a> and <a href=\"http://www.last.fm/music/Duane+Allman\" class=\"bbcode_artist\">Duane Allman</a>, as lead-in. Its famously contrasting movements were composed separately by Clapton and Jim Gordon.  Inspired by Clapton's then-unrequited love for Pattie Boyd, the wife of his friend and fellow musician <a href=\"http://www.last.fm/music/George+Harrison\" class=\"bbcode_artist\">George Harrison</a>, &quot;Layla&quot; was unsuccessful on its initial release.", "published": "Sat, 14 Nov 2009 18:10:48 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Layla", "artist": {"url": "http://www.last.fm/music/Eric+Clapton", "mbid": "05c35c95-dcbd-4492-b091-7f05a2091d47", "name": "Eric Clapton"}, "url": "http://www.last.fm/music/Eric+Clapton/_/Layla", "listeners": "559447", "comments": ["GUITAR GOD!!", "Fantastic.", "Unplugged version <3", "W       O                W!", "Never a bad version of this song...", "love this song his guitar was great in his early years specially with cream", "He may have slow hands but they sound darn good on his guitar....Love this song and his guitar.", "Better than acoustic version.", "Can't get enough of this song!", "many versions of this song but they are all good to me.", "Worked with a Layla once, evertime I called her name I wanted to air-guitar.  Love this song.", "Love this song.", "Not many are better.", "@kipra. No no no no. Hey Michael,no way! They say ol' EC is really nicknamed \"Slowhand\" because of the slow way he reaches for the Dinner  check at the end of the meal when they are all out for some dinner & drinks.        Also,they said in EC's earlier struggling days to get gigs as a youth,he was nicknamed \"Fast \" Eric Dine n' Dash-ton. Haha. Jk. ( ;", "love the version on Rainbow concert.", "Great song. Like this version better than the slow one.  The acoustic Layla is still good, it just lost something in the transition.", "I love this tune and talent! Piano and Gitar! HAAA! HAAA! I love! Do not laugh at my spelling! MKay! I am just being really real!", "WHOOOOOOOO! Spank! Ohh! Did I say I love this tune? Nice!", "Love the rips!!!!!!!!!!!!!!!!!!", "Slowhand, yes of course, but fast hands too as needed :-) That's what makes him so special :-)"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}]}, "mbid": "03a523da-306d-499d-bc57-d6ab67be3e0a", "duration": "386000", "playcount": "2680964", "id": "27887"}}