{"track": {"album": {"@attr": {"position": "1"}, "title": "The Jazz Ladies Volume 3", "url": "http://www.last.fm/music/Lena+Horne/The+Jazz+Ladies+Volume+3", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/15844537.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/15844537.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/15844537.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/15844537.jpg", "size": "extralarge"}], "artist": "Lena Horne", "mbid": ""}, "wiki": {"content": "&quot;Strange Fruit&quot; is a song performed most famously by Billie Holiday. It condemned American racism, particularly the lynching of African Americans that had occurred chiefly in the South but also in all regions of the United States. Holiday's version of the song was inducted into the Grammy Hall of Fame in 1978. It was also included in the list of Songs of the Century, by the Recording Industry of America and the National Endowment for the Arts.\n \n <strong>Author</strong>\n \n &quot;Strange Fruit&quot; began as a poem written by Abel Meeropol, a Jewish high-school teacher from the Bronx, about the lynching of two black men. He published under the pen name Lewis Allan. Meeropol and his wife adopted Robert and Michael, sons of Julius and Ethel Rosenberg, who were convicted of espionage and executed by the United States.\n \n Meeropol wrote &quot;Strange Fruit&quot; to express his horror at lynchings after seeing Lawrence Beitler's photograph of the lynching of Thomas Shipp and Abram Smith in Marion, Indiana. He published the poem in 1936 in The New York Teacher, a union magazine. Though Meeropol/Allan had often asked others (notably Earl Robinson) to set his poems to music, he set Strange Fruit to music himself. The song gained a certain success as a protest song in and around New York. Meeropol, his wife, and black vocalist Laura Duncan performed it at Madison Square Garden.\n \n Barney Josephson, the founder of Cafe Society in Greenwich Village, New York's first integrated nightclub, heard the song and introduced it to Billie Holiday. Holiday performed the song at Cafe Society in 1939. She said that singing it made her fearful of retaliation. Holiday later said that because the imagery in &quot;Strange Fruit&quot; reminded her of her father, she persisted in singing it. The song became a regular part of Holiday's live performances.\n \n Holiday approached her recording label, Columbia, about recording the song. Columbia, fearing a backlash by record retailers in the South, as well as negative reaction from affiliates of Columbia's co-owned radio network, CBS, refused to record the song.  Even her great producer at Columbia, John Hammond, refused. In frustration she turned to her friend Milt Gabler (uncle of comedian Billy Crystal) whose Commodore label produced alternative jazz. Holiday sang the song for him a cappella which so moved Gabler that he wept. In 1939 Gabler worked out a special arrangement with Vocalian Records to record and distribute the song and Columbia allowed Holiday a one-session release from her contract in order to record it.\n \n She recorded two major sessions at Commodore, one in 1939 and one in 1944. &quot;Strange Fruit&quot; was highly regarded. In time it became Holiday's biggest selling record. Though the song became a staple of her live performances, Holiday's accompanist Bobby Tucker recalled that Holiday would break down every time after she sang it.\n \n In her autobiography Lady Sings the Blues, Holiday suggested that she, together with Lewis Allan, her accompanist Sonny White, and arranger Danny Mendelsohn, put the poem to music. David Margolick and Hilton Als dismissed that claim in their work Strange Fruit: The Biography of a Song. They wrote that hers was &quot;an account that may set a record for most misinformation per column inch&quot;. When challenged, Holiday—whose autobiography had been ghostwritten by William Dufty—claimed, &quot;I ain't never read that book.&quot;\n \n <strong>Meaning</strong>\n \n The &quot;strange fruit&quot; referred to in the song are the bodies of African American men being hanged during a lynching. They contrast the pastoral scenes of the South with the ugliness of racist violence. The lyrics were so chilling that Holiday later said &quot;The first time I sang it, I thought it was a mistake. There wasn't even a patter of applause when I finished. Then a lone person began to clap nervously. Then suddenly everyone was clapping and cheering.&quot;\n \n <strong>Impact</strong>\n \n Barney Josephson recognized the impact of the song and insisted that Holiday close all her shows with it. Just as the song was about to begin, waiters would stop serving, the lights in club would be turned off, and a single pin spotlight would illuminate Holiday on stage. During the musical introduction, Holiday would stand with her eyes closed, as if she were evoking a prayer.\n \n The song ultimately became the anthem of the anti-lynching movement. The dark imagery of the lyrics struck a chord. It also contributed to what would later become the Civil Rights movement of the 50s and 60s.\n \n The song became an instant success and was most identified with Holiday. Numerous other singers have performed it. In October 1939, Samuel Grafton of The New York Post described &quot;Strange Fruit&quot;: &quot;If the anger of the exploited ever mounts high enough in the South, it now has its Marseillaise.&quot;\n \n In December, 1999, Time (magazine) magazine called it the song of the century.\n \n In 2002, the Library of Congress honored the song as one of 50 recordings chosen that year to be added to the National Recording Registry.\n \n The Atlanta Journal-Constitution listed the song as Number One on 100 Songs of the South.   <a href=\"http://www.last.fm/music/Bob+Dylan\" class=\"bbcode_artist\">Bob Dylan</a> cited &quot;Strange Fruit&quot; as an influence in the 2005 documentary No Direction Home. The movie also had a brief clip of Holiday singing.\n \n Serbian rock musician, journalist and writer Dejan Cukić wrote about &quot;Strange Fruit&quot; among forty-five other songs that changed the history of popular music in his book 45 obrtaja: Priče o pesmama.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Strange Fruit&quot; is a song performed most famously by Billie Holiday. It condemned American racism, particularly the lynching of African Americans that had occurred chiefly in the South but also in all regions of the United States. Holiday's version of the song was inducted into the Grammy Hall of Fame in 1978. It was also included in the list of Songs of the Century, by the Recording Industry of America and the National Endowment for the Arts.  Author  ", "published": "Sun, 12 Apr 2009 10:26:57 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Strange Fruit", "artist": {"url": "http://www.last.fm/music/Billie+Holiday", "mbid": "d59c4cda-11d9-48db-8bfe-b557ee602aed", "name": "Billie Holiday"}, "url": "http://www.last.fm/music/Billie+Holiday/_/Strange+Fruit", "listeners": "200746", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/billie%20holiday", "name": "billie holiday"}, {"url": "http://www.last.fm/tag/vocal%20jazz", "name": "vocal jazz"}]}, "mbid": "0641c2e5-d4d9-4b79-b6d7-9b771c66306b", "duration": "178000", "playcount": "606757", "id": "1045948"}}