{"track": {"album": {"@attr": {"position": "3"}, "title": "Feels Like Rain", "url": "http://www.last.fm/music/Buddy+Guy/Feels+Like+Rain", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/59141127.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/59141127.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/59141127.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/59141127.jpg", "size": "extralarge"}], "artist": "Buddy Guy", "mbid": "aba55262-6c1b-4920-ba41-37d2a6ddd11f"}, "wiki": {"content": "           From the first four bars of that beautiful tremeloed guitar work,to the spine chilling slide guitar work later in  the song , Buddy takes this cover and makes it his own. Knowing he's been there,or if you don't know, Buddy let's you know from the first line of the vocals. And continues to let you know as he gets a little help from his friends in the background into the chorus and beyond. A great song , covered by many others, but never replicated in Buddy's style, he takes you along with him on his trip back home. which may or may not be there since Katrina, and Buddy passes this along in this track , with his heartfelt soul-driven trip back down south. His vocals definitely make you feel as though it could rain at anytime. Without mentioning the name of the writer I'm certain Buddy has made him proud. He definitely stirred my soul with his awesome vovals and guitar work on this track. Listen once and I think you'll want to buy it for your library. (no I do not work for Last.FM or anyone else connected with them)   rd\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "           From the first four bars of that beautiful tremeloed guitar work,to the spine chilling slide guitar work later in  the song , Buddy takes this cover and makes it his own. Knowing he's been there,or if you don't know, Buddy let's you know from the first line of the vocals. And continues to let you know as he gets a little help from his friends in the background into the chorus and beyond.", "published": "Tue, 30 Sep 2008 14:00:39 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Feels Like Rain", "artist": {"url": "http://www.last.fm/music/Buddy+Guy", "mbid": "4336a134-d091-4e54-9967-c7c433db6d4e", "name": "Buddy Guy"}, "url": "http://www.last.fm/music/Buddy+Guy/_/Feels+Like+Rain", "listeners": "48333", "comments": ["Good track!!!!!!WOW!!!!!!! Cool!!,As they used to say!!", "damn, this good", "Great song, John Hiatt?. Great version. Love Buddy when he reigns it in. So much Blues today is either rock or soul.", "Sounds like Bonnie Raiit on backing vocals ?", "An excellent blues from Buddy.", "(There's a certain Hendrix track a bit reminiscent of the intro) WHAT A SONG!! Just Sooooo GOOD.", "Smoooooth", "Interesting and original creativity of this musician intended more on contemplation than on listening. Many will find something familiar, see the familiar musical images that are professionally encoded in harmonic symbolism.", "Love the Liquid SUNSHINE !!!", "Sweet sounds by one of the best.", "master guitarist---master showman", "We needed the rain, too.  (-:", "oh yeah!!!! and it feels like rain!!", "Thanks Cida, wonderful", "Beautiful!!!!!", "'Dis is da blues", "Most people don't know that Mel Torme played bass on this song! Of course I'm lying but the important thing is that we enjoy this wonderful song by Mr. Buddy Guy!", "I saw him perform this at an outdoor venue and halfway through the song, it started to rain. Very cool.", "Testify,Buddy !", "My goodness!!! Wow,fantastic!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/guitar%20blues", "name": "guitar blues"}, {"url": "http://www.last.fm/tag/buddy%20guy", "name": "buddy guy"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}]}, "mbid": "0b7abc81-d95b-44fb-896d-04605dad8baa", "duration": "276000", "playcount": "110918", "id": "1122686"}}