{"track": {"album": {"@attr": {"position": "12"}, "title": "Texas Flood", "url": "http://www.last.fm/music/Stevie+Ray+Vaughan+and+Double+Trouble/Texas+Flood", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/10355111.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/10355111.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/10355111.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/10355111.jpg", "size": "extralarge"}], "artist": "Stevie Ray Vaughan and Double Trouble", "mbid": "7346e94f-b803-4163-ae64-c71a3acdc73e"}, "wiki": {"content": "Tin Pan Alley is the name given to the collection of New York City-centered music publishers and songwriters who dominated the popular music of the United States in the late 19th century and early 20th century.\n \n The start of Tin Pan Alley is usually dated to about 1885, when a number of music publishers set up shop in the same district of Manhattan. The end of Tin Pan Alley is less clear cut. Some date it to the start of the Great Depression in the 1930s when the phonograph and radio supplanted sheet music as the driving force of American popular music, while others consider Tin Pan Alley to have continued into the 1950s when earlier styles of American popular music were upstaged by the rise of rock &amp; roll.\n \n Tin Pan Alley was originally a specific place in New York City, West 28th Street between Fifth and Sixth Avenue. There is a plaque on the sidewalk on 28th St between Broadway and Fifth with a dedication. This block is now considered part of Manhattan's Flatiron District.\n \n The origins of the name &quot;Tin Pan Alley&quot; are unclear. The most popular account holds that it was originally a derogatory reference to the sound made by many pianos all playing different tunes in this small urban area, producing a cacophony comparable to banging on tin pans. With time this nickname was popularly embraced and many years later it came to describe the U.S. music industry in general.\n \n The term is also used to describe any area within a major city with a high concentration of music publishers or musical instrument stores - a good example being Denmark Street near Covent Garden in London. In the 1920s the street became known as &quot;Britain's Tin Pan Alley&quot; because of the large number of music shops, a title it holds to this day. The Tin Pan Alley Festival is held there each July.\n \n The music houses in lower Manhattan were lively places, with a steady stream of songwriters, vaudeville and Broadway performers, musicians, and &quot;song pluggers&quot; coming and going.\n \n Aspiring songwriters came to demonstrate tunes they hoped to sell. When tunes were purchased from unknowns with no previous hits, the name of someone with the firm was often added as co-composer (in order to keep a higher percentage of royalties within the firm), or all rights to the song were purchased outright for a flat fee (including rights to put someone else's name on the sheet music as the composer). Songwriters who became established producers of commercially successful songs were hired to be on the staff of the music houses. The most successful of them, like Harry Von Tilzer and Irving Berlin, founded their own publishing firms.\n \n &quot;Song pluggers&quot; were pianists and singers who made their living demonstrating songs to promote sales of sheet music. Most music stores had song pluggers on staff. Other pluggers were employed by the publishers to travel and familiarize the public with their new publications.\n \n When vaudeville performers played New York City, they would often visit various Tin Pan Alley firms to find new songs for their acts. Second- and third-rate performers often paid for rights to use a new song, while famous stars were given free copies of publisher's new numbers or were paid to perform them, the publishers knowing this was valuable advertising.\n \n Initially Tin Pan Alley specialized in melodramatic ballads and comic novelty songs, but it embraced the newly popular styles of the cakewalk and ragtime music. Later on jazz and blues were incorporated, although less completely, as Tin Pan Alley was oriented towards producing songs that amateur singers or small town bands could perform from printed music. Since improvisation, blue notes, and other characteristics of jazz and blues could not be captured in conventional printed notation, Tin Pan Alley manufactured jazzy and bluesy pop-songs and dance numbers. Much of the public in the late 1910s and the 1920s did not know the difference between these commercial products and authentic jazz and blues.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Tin Pan Alley is the name given to the collection of New York City-centered music publishers and songwriters who dominated the popular music of the United States in the late 19th century and early 20th century.  The start of Tin Pan Alley is usually dated to about 1885, when a number of music publishers set up shop in the same district of Manhattan. The end of Tin Pan Alley is less clear cut. Some date it to the start of the Great Depression in the 1930s when the phonograph and radio supplanted sheet music as the driving force of American popular music...", "published": "Wed, 16 Sep 2009 15:02:25 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Tin Pan Alley (aka Roughest Place In Town)", "artist": {"url": "http://www.last.fm/music/Stevie+Ray+Vaughan+and+Double+Trouble", "mbid": "e3c8b0c8-3fa0-464b-b1f5-119cb52d3817", "name": "Stevie Ray Vaughan and Double Trouble"}, "url": "http://www.last.fm/music/Stevie+Ray+Vaughan+and+Double+Trouble/_/Tin+Pan+Alley+(aka+Roughest+Place+In+Town)", "listeners": "39196", "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/stevie%20ray%20vaughan", "name": "stevie ray vaughan"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}]}, "mbid": "0e1033db-817f-4d9b-9df3-d3d6dbc302eb", "duration": "551000", "playcount": "112606", "id": "1530440"}}