{"track": {"album": {"@attr": {"position": "1"}, "title": "Blues", "url": "http://www.last.fm/music/Jimi+Hendrix/Blues", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/77971760.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/77971760.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/77971760.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/77971760.png", "size": "extralarge"}], "artist": "Jimi Hendrix", "mbid": "1ae54907-3130-3482-97d8-1b8b88a66f83"}, "wiki": {"content": "“Hear My Train A Comin’ (Acoustic)” (aka (by Hendrix) “Getting My Heart Back Together Again”) is a Hendrix original that he often played live in concert, particularly in 1969 and 1970. The song was from a long lost master tape of Hendrix alone playing a 12 string acoustic <strong>right hand guitar,</strong> strung for left hand and singing in a delta blues manner. This live studio performance was filmed for, and included in the film &quot;See My Music Talking,&quot; and later included in the 1973 documentary Jimi Hendrix and accompanying soundtrack LP. The last song on Blues is a live version of “Hear My Train A Comin’” recorded on May 30, 1970, at the Berkeley Community Theater that had previously been released on the posthumous Rainbow Bridge album in 1971.\n \n A different version of “Hear My Train A Comin’” was included on the posthumous 1975 album &quot;Midnight Lightning&quot; and was considered somewhat controversial since producer Alan Douglas used session musicians to augment Hendrix’ guitar and Mitch Mitchell’s drums (overdubbing the bass guitar in the process). Another studio version from February 1969 was included on The Jimi Hendrix Experience box set in 2000.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "“Hear My Train A Comin’ (Acoustic)” (aka (by Hendrix) “Getting My Heart Back Together Again”) is a Hendrix original that he often played live in concert, particularly in 1969 and 1970. The song was from a long lost master tape of Hendrix alone playing a 12 string acoustic right hand guitar, strung for left hand and singing in a delta blues manner. This live studio performance was filmed for, and included in the film &quot;See My Music Talking,&quot; and later included in the 1973 documentary Jimi Hendrix and accompanying soundtrack LP.", "published": "Mon, 24 Sep 2012 15:53:13 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Hear My Train A Comin' (Acoustic)", "artist": {"url": "http://www.last.fm/music/Jimi+Hendrix", "mbid": "06fb1c8b-566e-4cb2-985b-b467c90781d4", "name": "Jimi Hendrix"}, "url": "http://www.last.fm/music/Jimi+Hendrix/_/Hear+My+Train+A+Comin%27+(Acoustic)", "listeners": "33484", "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/jimi%20hendrix", "name": "jimi hendrix"}, {"url": "http://www.last.fm/tag/acoustic", "name": "acoustic"}, {"url": "http://www.last.fm/tag/delta%20blues", "name": "delta blues"}, {"url": "http://www.last.fm/tag/hear%20my%20train%20a%20comin", "name": "hear my train a comin"}]}, "mbid": "1602820b-e027-4c40-a976-34a09fe86e58", "duration": "185000", "playcount": "96670", "id": "1196527"}}