{"track": {"album": {"@attr": {"position": "1"}, "title": "King Of The Blues Guitar", "url": "http://www.last.fm/music/Albert+King/King+Of+The+Blues+Guitar", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/46659195.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/46659195.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/46659195.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/46659195.jpg", "size": "extralarge"}], "artist": "Albert King", "mbid": "b6f83b06-9cf1-4e39-81ed-5bd1ce9c44c3"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Laundromat Blues", "artist": {"url": "http://www.last.fm/music/Albert+King", "mbid": "10f89195-3af1-46f5-aa36-504aa3309f5a", "name": "Albert King"}, "url": "http://www.last.fm/music/Albert+King/_/Laundromat+Blues", "listeners": "58915", "comments": ["Perfect for work! yeaaah. Smooooooth stuff", "saw Albert & his dancing girls at the shrine auditorium in 1970, what a great show!!", "He is a soulful and energetic performer who brings the best of what people love about music together in one total package: great stage presence and quality sound. His guitar is powerful and inviting in a way that makes you want to hear more. He also has the ability to create an exciting atmosphere anywhere. He can deliver his message on a broadly appealing level with a sincerity that comes through every note and every word.", "too smooth", "great to hear this track again x", "Again the evening colored with tone of blues notes ... Dipping fearlessly in these rhythms, willingly I play the chords in unison of my mood passing  hopeless years  into oblivion...", "there's room in the world, and the world is a better place, for including BB, Albert, Freddie, Eric, Peter G., Michael B., Magic Sam, John Mayall, Otis R, T-Bone, Luther A, Buddy, Jimi Hendrix, Jerry G. Terry Haggerty, Alvin Lee, Robert Johnson, Missippi John, Rev Gary D., Jorma K, Steve Winwood, Chris Smither, Vince Gill, Andy Reiss, John Mclaughlin, Paco DeLucia, Larry C., Al D, Pat M, Ralph T, T-Bone, Tony Rice, Martin Barre, Pete Townsend, Dave Davies, John Lee, Banana, Eric Brann, John Cippolina, Gary Duncan, Hal Wegent, Shawn Phillips, Elvin Bishop, Bill Champlin, Terry Kath, Barry Melton, Tryone Downey, Mick Taylor, George Harrison, Buddy Holly, Dan Crary, Bola Sete, Wes M., Herb E, Bob Weir, Henry Vestine, Jeremy Spencer, Danny Kirwan, Frank Zappa, Chet Atkins, Merle Travis, Richie Havens, Joni Mitchell, Bonnie Raitt ---and on and on---in no particular order.", "If the blues have to be explained to you, you'll just never understand.  One way or another, the Blues; baby we live em' everyday.", "A class act through and through !!", "Lots of people appreciated them; just not the ones that society takes notice of. Every Friday and Saturday nite in juke joints across the US people that work hard for a living spent their hard-earned money to laugh and dance and drink and have a good time... and they don't give a shit if you know about it or not.", "It always amazes me that these old blues legends were living in the time that nobody appreciated them until they were dead.", "one of the 3 Kings bearing gifts", "lubię bluesa", "I do like the blues!", "awsome", "for mine, there's nowhere more romantic than the local laundromat. :p killer tune!", "Imagine playing without using picks, he played with the meat of his thumb. Amazing tone. Just fabulous", "LOVE IT!!!", "the KING", "I think Albert and Freddie learned from and played with BB. Are you kidding."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20guitar", "name": "blues guitar"}, {"url": "http://www.last.fm/tag/electric%20blues", "name": "electric blues"}, {"url": "http://www.last.fm/tag/albert%20king", "name": "albert king"}, {"url": "http://www.last.fm/tag/super%20standard%20blues", "name": "super standard blues"}]}, "mbid": "240db22f-645e-49dc-9102-041b3c08c0b5", "duration": "189000", "playcount": "125099", "id": "1514076"}}