{"track": {"album": {"@attr": {"position": "16"}, "title": "Public Enemies", "url": "http://www.last.fm/music/Elliot+Goldenthal/Public+Enemies", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/58265887.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/58265887.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/58265887.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/58265887.png", "size": "extralarge"}], "artist": "Elliot Goldenthal", "mbid": "2b784fdf-2725-4b1e-85ab-af59cb6c1613"}, "wiki": {"content": "Ry Cooder, who based his desolate soundtrack to Paris, Texas on &quot;Dark Was the Night, Cold Was the Ground&quot;, described it as &quot;the most soulful, transcendent piece in all American music.&quot;\n \n Dark Was The Night, Cold Was the Ground was included on the Voyager Golden Record, sent into space with the Voyager spacecraft in 1977 - Johnson's music left the solar system on December 16, 2004.\n \n The song is also used in Pier Paolo Pasolini's The Gospel According to St Matthew; Walk the Line, a biopic of country singer Johnny Cash; The Devil's Rejects, a serial killer film by rocker Rob Zombie; and Public Enemies, a Michael Mann's movie about John Dillinger, a famous criminal from '30s.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Ry Cooder, who based his desolate soundtrack to Paris, Texas on &quot;Dark Was the Night, Cold Was the Ground&quot;, described it as &quot;the most soulful, transcendent piece in all American music.&quot;  Dark Was The Night, Cold Was the Ground was included on the Voyager Golden Record, sent into space with the Voyager spacecraft in 1977 - Johnson's music left the solar system on December 16, 2004.  The song is also used in Pier Paolo Pasolini's The Gospel According to St Matthew; Walk the Line, a biopic of country singer Johnny Cash; The Devil's Rejects...", "published": "Thu, 23 Jul 2009 21:59:53 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Dark Was the Night, Cold Was the Ground", "artist": {"url": "http://www.last.fm/music/Blind+Willie+Johnson", "mbid": "8a14c00b-4779-44e4-9b2e-4cc9dcd92e9b", "name": "Blind Willie Johnson"}, "url": "http://www.last.fm/music/Blind+Willie+Johnson/_/Dark+Was+the+Night,+Cold+Was+the+Ground", "listeners": "25748", "comments": ["this song sends shivers down my spine", "i hope the aliens like this one", "\"Not this McTell character, whoever HE is. Good day, sir.\" Are you serious? You've never heard fuckin Blind Willie McTell? Jesus. You should probably rectify that ASAP. Anyway, this song is amazing.", "Brilliant. Love the comment about the Dylan quote. Mr McTell could not have made much of a contribution to music if Dylan didn't mention him.", "magnifique", "The weight and depth of so many souls on his shoulders. Chilling. ♫ ♥ ♥ ♥ ♫", "Hogwash, Snitsie, on my Bootlegs Mr Bob Dylan sings \"I’m gazing out the window of the St. James Hotel and I know no one can sing the blues like Blind Willie Johnson.\" Johnson! Not this McTell character, whoever HE is. Good day, sir.", "The wrong Blind Willie, captainDread.", "&", "Man's inhumanity to man put down in a wordless dirge. Amen brothers and sisters.", "Soulful. Devotion. Pain. Joy.", "@pushit Give me some credit, man. I know the song is named 'Blind Willie McTell'. I felt Dylan's lyrics conveys the same sentiments as this song does.", "this song is floating through space on the Voyager Golden Record - what a trip [2]\n\nNow i'm able to understand why the song has been chosen. \n\nStaggering recording !", "Wrong Blind Willie, man.", "See them big plantations burning; Hear the cracking of the whips; Smell that sweet magnolia blooming; See the ghosts of slavery ships", "what a voice.  Feel weird after listening to this song; like I need a drink or something.  Might just need a little sit down. woah.", "today I shed a tear ....I heard the sound of an angel playing the guitar, every chord he hits penetrates deep into my soul ......", "I hardly ever listen to this and yet it constantly lives inside me. Possibly the most haunting and perfect piece of music I've ever heard.", "Such a good, chilling song", "Maybe the greatest song of all time, certainly the most haunting...."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/delta%20blues", "name": "delta blues"}, {"url": "http://www.last.fm/tag/slide%20guitar", "name": "slide guitar"}, {"url": "http://www.last.fm/tag/melancholic", "name": "melancholic"}, {"url": "http://www.last.fm/tag/gospel", "name": "gospel"}]}, "mbid": "27a746fb-a5ad-4475-adbe-0a98506a5c1a", "duration": "199000", "playcount": "66834", "id": "2818682"}}