{"track": {"album": {"@attr": {"position": "8"}, "title": "Blue Valentine", "url": "http://www.last.fm/music/Tom+Waits/Blue+Valentine", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87363717.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87363717.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87363717.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87363717.png", "size": "extralarge"}], "artist": "Tom Waits", "mbid": "1942e2f3-71af-4344-80fb-313d391f7588"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Kentucky Avenue", "artist": {"url": "http://www.last.fm/music/Tom+Waits", "mbid": "c3aeb863-7b26-4388-94e8-5a240f2be21b", "name": "Tom Waits"}, "url": "http://www.last.fm/music/Tom+Waits/_/Kentucky+Avenue", "listeners": "52100", "comments": ["Fucking hell this is almost too wonderful.", "Jesus.... wow.", "he doesn't play this live, but why ? so great", "This song reminds me of my childhood, when my best friend was always there, and we took the world by tail, wrapped it around, and put it in our pockets, as Tom said. :)", "That's the Tom I love.", "what a nightmare", "One of the best songs I've ever heard. It's clearly representing Tom's actual childhood, and needless to say, it was a much different time back then. I can't really relate to the lyrics, as most of my generation probably cannot, but I most definitely understand the sentiment of them. And the nostalgia is heartbreaking.", "Warning this song will break your heart!\nFirst heard this some 30 years ago.  The raw emotion still gets me every time. Everything about this track is just right. Tom’s voice the musical arrangement and the beautiful lyrics. \nWonderful.", "Dieses Lied lässt meinen Körper angenehm erschauern...", "one of these songs that will prevent you from killing yourself", "The most beautiful and incredible song about childhood memories, games and make-believe ever written.  My favourite Waits song by a long, long way.", "oh my god. i'm getting misty-eyed. those strings. the way he sings. that beautiful piano playing. surely one of the greatest songs ever. i've sometimes been derided because i never cry at films, but this is the closest i've ever come to crying at music. i don't even know what he's singing about. i just know it's sad. so, so sad. incredible.", "this is it. this is why i listen to music.", "<3", "For me, the most beautiful song ever sung.", "Heart-stopping; magnificent. First encountered this nearly thirty years ago; still moves me every time I hear it.", "stops you for a while this one", "Love this song.", "Lovely track. Full of emotion.", "he's fantastic"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/piano", "name": "piano"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/tom%20waits", "name": "tom waits"}]}, "mbid": "53e36595-1222-4c71-977a-6cb9fb16d260", "duration": "287000", "playcount": "192279", "id": "1016277"}}