{"track": {"album": {"@attr": {"position": "2"}, "title": "Magic Potion", "url": "http://www.last.fm/music/The+Black+Keys/Magic+Potion", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/72461472.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/72461472.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/72461472.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/72461472.png", "size": "extralarge"}], "artist": "The Black Keys", "mbid": "af0cebf0-2696-4bc4-a99e-3c47ef4308e0"}, "wiki": {"content": "&quot;Your Touch&quot; is a single off the The Black Keys fourth album, Magic Potion.\n \n The song was featured in the 2009 film Zombieland.\n \n The music video features the band playing on top of the former Goodrich rubber factory in Akron, Ohio, where they are shot dead while playing. A boy comes over, and a hand from the bass drum hands him a fabergé egg similar to the one on the cover of the album the song was taken from. When the boy leaves, the ghosts of Dan and Patrick get up and walk away to a diner, where small bits of diegetic dialogue between members of the band's ghosts interrupts the music (&quot;So what do you think about being dead?&quot; &quot;...I don't know, my neck hurts.&quot; &quot;At least I died doing what I love. Lip-synching. I love that shit&quot;) . Then the boy is shown going around showing people the egg. When the people he meets see the egg, they throw up a chicken egg and die. The boy consults a welder to destroy the egg, but it cannot be destroyed. Later, the members of the band's ghosts comes back to inhabit their dead bodies, which then get up and explode, dying once again. Carney is seen catching Auerbach as they die, screaming, &quot;NOOOOO!&quot;\n \n The song was covered by Donnie Iris, and it was the only studio recording on his 2009 album Ah! Live!\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Your Touch&quot; is a single off the The Black Keys fourth album, Magic Potion.  The song was featured in the 2009 film Zombieland.  The music video features the band playing on top of the former Goodrich rubber factory in Akron, Ohio, where they are shot dead while playing. A boy comes over, and a hand from the bass drum hands him a fabergé egg similar to the one on the cover of the album the song was taken from.", "published": "Tue, 12 Jan 2010 21:45:15 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Your Touch", "artist": {"url": "http://www.last.fm/music/The+Black+Keys", "mbid": "d15721d8-56b4-453d-b506-fc915b14cba2", "name": "The Black Keys"}, "url": "http://www.last.fm/music/The+Black+Keys/_/Your+Touch", "listeners": "198323", "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/garage%20rock", "name": "garage rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "7284faa4-badc-46fe-8167-25eaaf10ff77", "duration": "163000", "playcount": "1114719", "id": "55883879"}}