{"track": {"album": {"@attr": {"position": "4"}, "title": "Bob Dylan: The Collection", "url": "http://www.last.fm/music/Bob+Dylan/Bob+Dylan:+The+Collection", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/52893345.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/52893345.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/52893345.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/52893345.jpg", "size": "extralarge"}], "artist": "Bob Dylan", "mbid": ""}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Slow Train", "artist": {"url": "http://www.last.fm/music/Bob+Dylan", "mbid": "25144665-e9ac-416f-aba3-0c8b4ee547d5", "name": "Bob Dylan"}, "url": "http://www.last.fm/music/Bob+Dylan/_/Slow+Train", "listeners": "29846", "comments": ["I must admit, I was wrong about this being New Pony x19; that earlier track is far more deranged. Slow Train is pretty wild too, but the difference (a big one!) is that this time around he's got something directing his quicksilver thoughts, a solid rock to hang it all on, if you will.", "No, not '' the great prophet'' but still an old master ;-)", "I'm with ya, sl: the live version loses something by picking up speed. It does have that wonderful coda, though, with the girl singers: \"and there's a slow... train... there's a slow train coming!\" four or five times to wrap it up. In any case, the song is so good ya can't really go wrong with it.", "sing and preach it Dylan of the early 80's.", "Mark Knopfler's guitar and BD's voice and lyrics--  and that slow, sideways stumbling beat . . . man, it's perfect! (Like the original over the live version, myself.)", "This is like New Pony x19. Feels deranged somehow, or off-hinged, yet it's completely commanding & convincing in its own strange way. And behind it all is that slow train coming... and such fantastic lyrics. \"She was a backwoods girl, but she sure was realistic.\"", "There are a lot of conflicting messages out there- some of them malicious and false- some of them with good intentions, but still false.  Be very careful which ones you choose to believe and who you choose to follow.  It is your choice and they are your consequences.  We each are alone in our beliefs- ultimately.", "Dylan the great prophet ??? Dylan the great opportunist you mean.... But he did write some brilliant lyrics", "Talk about a life of brotherly love, show me someone who knows how to live it", "This song made me love bob", "I give you the 4th shout", "I don't care about economy, I don't care about astronomy, but it sure do bother me to see my loved ones turning into puppets", "Am I the only one madly in love with this song? Dylan condemning everything and everyone, Dylan as the great prophet. Imo the best song of Dylans christian period.", "so good"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/dylan", "name": "dylan"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/folk", "name": "folk"}, {"url": "http://www.last.fm/tag/bob%20dylan", "name": "bob dylan"}]}, "mbid": "9902b8d1-19d6-45e7-b65f-b30ec7fd90c4", "duration": "358000", "playcount": "89319", "id": "1578224"}}