{"track": {"album": {"@attr": {"position": "7"}, "title": "Blonde on Blonde", "url": "http://www.last.fm/music/Bob+Dylan/Blonde+on+Blonde", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/84308083.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/84308083.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/84308083.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/84308083.png", "size": "extralarge"}], "artist": "Bob Dylan", "mbid": ""}, "wiki": {"content": "&quot;Leopard-Skin Pill-Box Hat&quot; is a song by Bob Dylan, from his 1966 album Blonde on Blonde. Like many other Dylan songs of the 1965-1966 period, the song features a surreal, playful lyric set to an electric blues accompaniment.\n \n Dylan's lyrics affectionately ridicule a female &quot;fashion victim&quot; who wears a leopard skin pillbox hat. The pillbox hat was a popular, highly fashionable ladies' hat in the United States in the early-to-mid 1960s, and was most famously worn by Jacqueline Kennedy Onassis. Dylan satirically crosses this accessory's high-fashion image with leopard-skin material, perceived as considerably more downmarket and vulgar. (Of course, genuine leopard skin was very upmarket, since it came from an endangered species. It was not yet illegal to trade in leopard-skin, but it was rare and valuable.) The song was also written and released long after pillbox hats had been at the height of fashion, something that was very apparent to listeners at the time.\n The song has been widely speculated to be inspired by Edie Sedgwick, an actress/model known for her association with Andy Warhol. Sedgwick is also often suspected as being an inspiration for other Dylan songs of the time, particularly some from Blonde on Blonde.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Leopard-Skin Pill-Box Hat&quot; is a song by Bob Dylan, from his 1966 album Blonde on Blonde. Like many other Dylan songs of the 1965-1966 period, the song features a surreal, playful lyric set to an electric blues accompaniment.  Dylan's lyrics affectionately ridicule a female &quot;fashion victim&quot; who wears a leopard skin pillbox hat. The pillbox hat was a popular, highly fashionable ladies' hat in the United States in the early-to-mid 1960s, and was most famously worn by Jacqueline Kennedy Onassis.", "published": "Thu, 28 Jan 2010 08:44:00 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Leopard-Skin Pill-Box Hat", "artist": {"url": "http://www.last.fm/music/Bob+Dylan", "mbid": "25144665-e9ac-416f-aba3-0c8b4ee547d5", "name": "Bob Dylan"}, "url": "http://www.last.fm/music/Bob+Dylan/_/Leopard-Skin+Pill-Box+Hat", "listeners": "164650", "toptags": {"tag": [{"url": "http://www.last.fm/tag/folk", "name": "folk"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}]}, "mbid": "9fa3e751-c306-4cac-8b7f-99a0a31ea629", "duration": "201000", "playcount": "655036", "id": "1000057"}}