{"track": {"album": {"@attr": {"position": "9"}, "title": "The Very Best Of Fleetwood Mac", "url": "http://www.last.fm/music/Fleetwood+Mac/The+Very+Best+Of+Fleetwood+Mac", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/74479896.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/74479896.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/74479896.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/74479896.png", "size": "extralarge"}], "artist": "Fleetwood Mac", "mbid": "a5ddd140-3e9a-4be7-828c-a9cf961fbec5"}, "wiki": {"content": "&quot;Black Magic Woman&quot; is a song written by Peter Green that first appeared as a Fleetwood Mac single in various countries in 1968, subsequently appearing on the 1969 Fleetwood Mac compilation albums English Rose (US) and The Pious Bird of Good Omen (UK). It became a classic hit by Santana and sung by Gregg Rolie in 1970, reaching #4 in the U.S. and Canadian charts, after appearing on their Abraxas album, becoming more closely associated with Santana than Fleetwood Mac. In 2005 the song was covered by ex-Thin Lizzy guitarist Snowy White on his album The Way It Is. In 1996 the song was also covered by Gary Hoey on his album Bug Alley .\n \n Although not nearly as popular as Santana's arrangement two years later, &quot;Black Magic Woman&quot; nevertheless became a fairly popular blues-rock hit peaking at #37 in the UK Singles Chart. It was featured in Fleetwood Mac live set-lists even after Green had left the band, when it was often sung by Danny Kirwan, and during concerts in the early 1970s it would form the basis for long mid-concert jams. The song would often be preceded by a band member reminding the audience that it was a Fleetwood Mac song before it became such a big hit for Santana.\n \n Set in the key of D minor, the verse follows a twelve bar chord progression alternating between D minor7, A minor7, and G minor7, and the instrumentation consists of vocals, two guitars, bass guitar and drums. It is homophonic, the voice and lead guitar taking the lead roles, and set in common time (4/4), with the rhythm &quot;pushing&quot; on the upbeat, then breaking into a shuffle beat root - chord jam after the final verse.\n \n D minor 7 | D minor 7 | A minor 7 | A minor 7 | D minor 7 | D minor 7 | G minor 7 | G minor 7 | Dm 7 - C 7 | Bb 7 - A 7 | D minor 7 | D minor 7\n \n It can also be noted that the origional recording by Peter Green's Fleetwood Mac featured guitars that were slightly below standard pitch, probably due to them being tuned to a piano or another guitar in the recording studio (very much reminiscent of The Rolling Stones). For most performances, it is played in standard, although to create a performance faithful to the origional recording, the low E string is advised to be tuned down to D.\n \n It also believed that the haunting D triad from the 17 fret is played out on one guitar, and a slide guitar playing the same chord is faded in over the top.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Black Magic Woman&quot; is a song written by Peter Green that first appeared as a Fleetwood Mac single in various countries in 1968, subsequently appearing on the 1969 Fleetwood Mac compilation albums English Rose (US) and The Pious Bird of Good Omen (UK). It became a classic hit by Santana and sung by Gregg Rolie in 1970, reaching #4 in the U.S. and Canadian charts, after appearing on their Abraxas album, becoming more closely associated with Santana than Fleetwood Mac. In 2005 the song was covered by ex-Thin Lizzy guitarist Snowy White on his album The Way It Is.", "published": "Mon, 11 Jan 2010 23:36:37 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Black Magic Woman", "artist": {"url": "http://www.last.fm/music/Fleetwood+Mac", "mbid": "bd13909f-1c29-4c27-a874-d4aaf27c5b1a", "name": "Fleetwood Mac"}, "url": "http://www.last.fm/music/Fleetwood+Mac/_/Black+Magic+Woman", "listeners": "111998", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/fleetwood%20mac", "name": "fleetwood mac"}]}, "mbid": "cf834232-b65a-449e-bbba-0cda000464ec", "duration": "171000", "playcount": "355107", "id": "32564"}}