{"track": {"album": {"@attr": {"position": "9"}, "title": "Asylum Years", "url": "http://www.last.fm/music/Tom+Waits/Asylum+Years", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87970207.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87970207.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87970207.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87970207.jpg", "size": "extralarge"}], "artist": "Tom Waits", "mbid": "8839f96a-5daf-4db6-9dde-a326b259cfb8"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Tom Traubert's Blues", "artist": {"url": "http://www.last.fm/music/Tom+Waits", "mbid": "c3aeb863-7b26-4388-94e8-5a240f2be21b", "name": "Tom Waits"}, "url": "http://www.last.fm/music/Tom+Waits/_/Tom+Traubert%27s+Blues", "listeners": "53222", "comments": ["this is so good", "Just beautiful.", "This song is a proof that men can weep.", "This is one of the most beautiful songs I´ve ever heard. I heard it on a DVD from The Old Grey Whistle Test and I loved it. That version is even more beautiful than the album version.", "Best version is from his sozzled Sydney Concert (\"Cold Beer on a Hot Night\").", "let's go", "makes me cry ever time I listened to it. don't know why.", "Sometimes, you know, Rod Stewart can really piss me off. His version of this masterpiece came on the radio today and I just had to get back to the source. Wonderful in every way", "beautiful", "Apparently, this song is about a Danish violinist called Mathilde Bondo, a married woman with whom young Mr. Waits was fairly smitten.", "slaps whoever said this is alternative PUNK with a large trout across the face repeatedly forever.", "This song has an otherworldly quality to it. Like, I wonder if knew that he was writing a song this good when he set out to write it. I wonder whether he intended to write a song this good. Either way, I've been listening to music all day and when this song just finished I felt like there was no point carrying on because that was it, I'd reached the top, I'd listened to the best song in the world. That thought always runs through my head when I finish listening to this song, and I always realise it isn't true a while afterwards, but I think it says something that the song has that much power that even ever so briefly you can stop and just wonder if you're listening to absolute perfection. No hyperbole, literal perfection.", "Rain like tears or tears like rain. I never knew.", "I am in love with this song.", "The lyrics are his own apart from the chorus. fantastic song by the way", "wow at the voice, wow at the lyrics. pure genius.", "I was lucky to see him live this year, when he played this song, people were weeping. fantastic song", "I love this song.  Tom Waits' voice works really well on these sad songs.  I don't think these are the original lyrics to Waltzing Matilda - Australia's unofficial national anthem, according to Wikipedia - where did these lyrics come from, I wonder.", "This is the saddest Tom Waits song I know... and one of the most melancholy I've ever heard. I cry on the bus when my mp3 player skips to this. It's beautiful.", "god dam beautiful!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}, {"url": "http://www.last.fm/tag/tom%20waits", "name": "tom waits"}, {"url": "http://www.last.fm/tag/sad", "name": "sad"}, {"url": "http://www.last.fm/tag/jazzblues", "name": "jazzblues"}]}, "mbid": "d3417a6e-1fbe-4c63-b2f9-ab8f70f3021f", "duration": "398000", "playcount": "209988", "id": "1159560"}}