{"track": {"album": {"@attr": {"position": "2"}, "title": "Box_Disc 2 (1955 - 1962)", "url": "http://www.last.fm/music/Howlin%27+Wolf/Box_Disc+2+(1955+-+1962)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82672133.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82672133.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82672133.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82672133.jpg", "size": "extralarge"}], "artist": "Howlin' Wolf", "mbid": ""}, "wiki": {"content": "Based on one riff and no chord changes, Smokestack Lightning has been called &quot;a distillation of the essence of the blues&quot;. It was loosely was based on &quot;Crying at Daybreak&quot;, another earlier recorded song by Wolf which was based on &quot;Moon Going Down&quot; by Charley Patton. Wolf said the song was inspired by watching trains in the night: &quot;We used to sit out in the country and see the trains go by, watch the sparks come out of the smokestack. That was smokestack lightning.&quot;\n \n In Britain in 1964, Pye International Records issued &quot;Smokestack Lightning&quot; as a single and it reached the Top 50. In 1999, the record was given a Grammy Hall of Fame Award honoring its lasting historical significance. The song is ranked #285 on the Rolling Stone magazine's list of The 500 Greatest Songs of All Time.\n \n In 1998, Hubert Sumlin, who played guitar on Wolf's original version of the song, released the album I Know You which featured a song called &quot;Smokestack&quot;. It features the same riff as &quot;Smokestack Lightning&quot;, but with different lyrics. The lyrics on &quot;Smokestack&quot; were done in the style of John Lee Hooker, which is more of a spoken word than singing with a rhyme scheme.\n \n The song has been covered numerous times by various artists including Muddy Waters, Jimmy Rogers, The Rolling Stones, The Yardbirds, John Mayer, The Animals, Mike Harrison, The Grateful Dead, Bob Dylan, The Who, The Electric Prunes, Lynyrd Skynyrd, Soundgarden, Lester Butler, Quicksilver Messenger Service and George Thorogood. Soul Coughing's song &quot;Down to This&quot; features a sample of the original version. Creedence Clearwater Revival's &quot;Susie Q&quot; uses the riff from this song. The Kaleidoscope (US band) used the riff and distinctive howl on the tune 'A Beacon From Mars' on their 1967 album of the same name.\n \n Because the original lyrics did not feature much of a rhyme scheme and included a howl by the Wolf, it was often reworked.The Yardbirds first covered it on their debut, Five Live Yardbirds with slightly rewritten lyrics, not including the howl. On The Yardbirds' BBC Sessions, the lyrics were rewritten completely.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Based on one riff and no chord changes, Smokestack Lightning has been called &quot;a distillation of the essence of the blues&quot;. It was loosely was based on &quot;Crying at Daybreak&quot;, another earlier recorded song by Wolf which was based on &quot;Moon Going Down&quot; by Charley Patton. Wolf said the song was inspired by watching trains in the night: &quot;We used to sit out in the country and see the trains go by, watch the sparks come out of the smokestack. That was smokestack lightning.&quot;  ", "published": "Tue, 16 Nov 2010 18:53:34 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Smokestack Lightnin'", "artist": {"url": "http://www.last.fm/music/Howlin%27+Wolf", "mbid": "", "name": "Howlin' Wolf"}, "url": "http://www.last.fm/music/Howlin%27+Wolf/_/Smokestack+Lightnin%27", "listeners": "145659", "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/chicago%20blues", "name": "chicago blues"}, {"url": "http://www.last.fm/tag/classic%20blues", "name": "classic blues"}, {"url": "http://www.last.fm/tag/howlin%20wolf", "name": "howlin wolf"}, {"url": "http://www.last.fm/tag/50s", "name": "50s"}]}, "mbid": "", "duration": "185000", "playcount": "410659", "id": "1198373"}}