{"track": {"album": {"@attr": {"position": "19"}, "title": "The Beatles (The White Album)", "url": "http://www.last.fm/music/The+Beatles/The+Beatles+(The+White+Album)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88060115.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88060115.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88060115.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88060115.png", "size": "extralarge"}], "artist": "The Beatles", "mbid": ""}, "wiki": {"content": "&quot;Yer Blues&quot; is a song by The Beatles, the second song on the third side (or second disc) of The Beatles, also known as the White Album. It is credited to Lennon/McCartney, but was written by John Lennon while in Rishikesh, India. Lennon said in a Rolling Stone interview that he used the humorous title as something of a defence mechanism, so that if anyone criticised the song, he could write it off as a parody. The lyrics are extremely suicidal, and include references to Bob Dylan's &quot;Ballad of a Thin Man&quot; as well as cosmology, and were possibly reflective of Lennon's well-documented battles with his psychological demons. In the original demo of the song, Lennon sings I feel so insecure now, just like Dylan's Mr. Jones, as opposed to suicidal. &quot;Yer Blues&quot; was recorded in EMI Studio Two's &quot;annexe&quot;, which was actually a large closet in the control room. In interviews for the Beatles Anthology series, Ringo Starr affectionately recalls recording this song in the stripped-down conditions, saying it was like the old days of Beatles live performances. The stripped-down, bluesy nature of the song bears similarity to much of Lennon's early solo output, including &quot;Cold Turkey&quot; and his 1970 John Lennon/Plastic Ono Band album and marks a retreat from Lennon's concern with studio experimentation that marked such songs as &quot;Tomorrow Never Knows&quot; and &quot;Strawberry Fields Forever&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Yer Blues&quot; is a song by The Beatles, the second song on the third side (or second disc) of The Beatles, also known as the White Album. It is credited to Lennon/McCartney, but was written by John Lennon while in Rishikesh, India. Lennon said in a Rolling Stone interview that he used the humorous title as something of a defence mechanism, so that if anyone criticised the song, he could write it off as a parody.", "published": "Wed, 13 Oct 2010 18:48:51 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Yer Blues", "artist": {"url": "http://www.last.fm/music/The+Beatles", "mbid": "b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d", "name": "The Beatles"}, "url": "http://www.last.fm/music/The+Beatles/_/Yer+Blues", "listeners": "312645", "comments": ["DAT BASS [3]. This song is amazing", "Feel so suicidal just like Dylan's Mr. Jones!", "Better than Cream", "Is it awful that the Dirty Mac version killed this version for me ? Apart from that extreme bass tone, this song sounds lacking compare to the other one. D:", "Such a good bassline.", "great solo", "Inmensa, sin fonteras. ROCK!", "killer bass line,caustic yer Lennon!", "SORRY 'BOUT yer eye n' bone.", "DAT BASS [2].", "I don't care if John Lennon weighed 120 pounds and didn't have the slightest trace of a muscle in his arm...I still wouldn't f*ck with him.", "pretty good pretty good", "In the morning, wanna die. In the evening, wanna die. If I ain't dead already, girl you know the reason why! [3]", "In the morning, wanna die. In the evening, wanna die. If I ain't dead already, girl you know the reason why! [2]", "♥♥♥♥♥The BEST!!!!♥♥♥♥♥♥♥♥", "In the morning, wanna die.  In the evening, wanna die. If I ain't dead already, girl you know the reason why!", "Proto-Emo [2]", "' Black cloud crossed my mind, blue mist round my soul. .. Feel so suicidal, even hate my rock and roll...'", "Thumping blues. Enthralling.", "Lennon, genio."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/the%20beatles", "name": "the beatles"}]}, "mbid": "e458b647-9a1c-4936-9d64-2f82949e51b8", "duration": "240000", "playcount": "1239857", "id": "1000139"}}