{"track": {"album": {"@attr": {"position": "4"}, "title": "Still Got the Blues", "url": "http://www.last.fm/music/Gary+Moore/Still+Got+the+Blues", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/60758493.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/60758493.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/60758493.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/60758493.png", "size": "extralarge"}], "artist": "Gary Moore", "mbid": "97b61507-4c9b-4d08-9fec-fc90d9354c85"}, "wiki": {"content": "Still Got the Blues is a 1990 album by guitarist Gary Moore. Prior to this album Moore's work had consisted of predominantly jazz-fusion with Colosseum II and rock and hard rock styles including his work with Skid Row, Thin Lizzy, G-Force as well as a large repertoire of solo work. This album, as evidenced by its title, is a departure from hard rock to an electric blues style.\n \n On December 3, 2008, a Munich, Germany court ruled that the guitar solo in Moore's hit, &quot;Still Got the Blues,&quot; was plagiarized from a little known (at least outside of Germany) song published in 1974 called &quot;Nordrach&quot; by the German band Jud's Gallery.  Moore has denied knowing of the song, due to its unavailability on record or CD at the time of studio work on his album; the court stated that the song could have been heard on the radio or in a live performance during that time. The court also stated that there was no evidence that the guitar solo was lifted from &quot;Nordrach,&quot; but copyright infringement does not depend on outright theft. It is unknown at this time if Moore will appeal the decision. Moore was ordered to pay Juergen Winter, leader of Jud's Gallery, an undisclosed amount in damages. \n \n Still Got the Blues has been arguably the most successful of Moore's solo album as it was well received by old fans and also converted many who had never heard of the Irish guitarist before. The album's visibility and success was assisted by contributions from well known veterans Albert King, Albert Collins and George Harrison. Interestingly Moore chose to record his lead vocal in the control room with the then just released Shure Beta 58 supercardiod microphone rather than the studio typical big phantom powered condensor microphone in a sound booth. It is argued that this assisted him to achieve as greater passion and live feel whilst still maintaining studio polish.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Still Got the Blues is a 1990 album by guitarist Gary Moore. Prior to this album Moore's work had consisted of predominantly jazz-fusion with Colosseum II and rock and hard rock styles including his work with Skid Row, Thin Lizzy, G-Force as well as a large repertoire of solo work. This album, as evidenced by its title, is a departure from hard rock to an electric blues style.  On December 3, 2008, a Munich, Germany court ruled that the guitar solo in Moore's hit, &quot;Still Got the Blues...", "published": "Thu, 24 Jun 2010 22:25:22 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Still Got the Blues", "artist": {"url": "http://www.last.fm/music/Gary+Moore", "mbid": "a8806b5c-3ee0-4277-94d3-1a5427a7707c", "name": "Gary Moore"}, "url": "http://www.last.fm/music/Gary+Moore/_/Still+Got+the+Blues", "listeners": "205858", "comments": ["Gary tops the charts' in so many ways.  The best there ever was.", "The most saddest song in thw world ever.", "I do too love this and all of Gary's.", "Love this song", "A timeless classic from Gary.", "Love every thing Gary does and this song brings back sad memories. Still love it though.", "It did use to be so easy to give my heart away................those were the days. I still got the blues for you. Don't think I'll ever fall in love again, my heart has that empty space. How does this song know me so well? Still got the blues !!!!!!!!!!!!", "Not much to say that hasn't been said below already - amazing guitar", "My, such a good singer. just love it.", "amazing song!", "LEGEND!", "One off his best but all were good. RIP Gary.", "reminds me of the 80s...great song...R.I.P.", "Glad you like it Betty.", "Thanks TWHsr.!!!   Good track !!!!Love it!!!", "Oh yes....... nice.", "god beeles he", "My absolutely favorite tune of his.", "What a feeling! What a voice! What a guitar!\nwww.jackybullfrog.com", "The best track that I can think of, oh that guitar, He died to young. RIP"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/blues", "name": "blues"}, {"url": "http://www.last.fm/tag/blues%20rock", "name": "blues rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "mbid": "f9cfdd36-1ced-4d89-b21c-c4e63df571b6", "duration": "373000", "playcount": "881308", "id": "1104440"}}