{"track": {"album": {"@attr": {"position": "3"}, "title": "Greatest Hits II", "url": "http://www.last.fm/music/Queen/Greatest+Hits+II", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92633831.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92633831.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92633831.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92633831.png", "size": "extralarge"}], "artist": "Queen", "mbid": "92faa683-a1a5-4198-a55d-af3471f14c94"}, "wiki": {"content": "&quot;Radio Ga Ga&quot; is a song performed and recorded by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a>, and was written by their drummer <a href=\"http://www.last.fm/music/Roger+Taylor\" class=\"bbcode_artist\">Roger Taylor</a> for the band's 1984 album <a title=\"Queen - The Works\" href=\"http://www.last.fm/music/Queen/The+Works\" class=\"bbcode_album\">The Works</a>. It was released as a single with <a title=\"Queen &ndash; I Go Crazy\" href=\"http://www.last.fm/music/Queen/_/I+Go+Crazy\" class=\"bbcode_track\">I Go Crazy</a>, a <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a>-written track, as its original B-side (3:42).\n \n The single was an enormous worldwide success for the band. It reached number two in the UK (kept from the number one spot only by Frankie Goes To Hollywood's smash hit &quot;Relax&quot;). In the USA it reached the number 16 spot. This was also their last Top 20 hit single in the US until 1992.\n \n &quot;Rado Ga Ga&quot; is said to be a commentary on the invention of television's overtaking radio's popularity and how one would listen to radio for a favorite comedy, drama, or sci-fi program and so on. It also pertained to the advent of the music video and MTV. (Ironically, the video would become a regular staple on MTV in 1984.)\n \n Taylor originally conceived it as &quot;Radio Ca-Ca&quot; (apparently from something his toddler son once said), a slam against radio for the decrease in variety of programming and the type of music being played. It was eventually changed to &quot;Radio Ga Ga&quot;, because that sounded better, clearer, and rolled off the tongue more easily. There are rumors that the publishers objected to the original title because of the close resemblance of &quot;Ca-Ca&quot; to a common word for feces in many languages.\n \n <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a> spoke about the song in a 1984 interview.\n \n &quot;&quot;Roger had an idea of very good melodic content, and to be honest, it was called 'Radio Ca Ca' before, and initially it was to deal with the radio being too old or whatever, and I just said, 'I think you should change the lyrical content', and in fact, we went totally the other way, so, I mean, 'Radio Ga Ga' – I mean, it's good, and so, 'Radio Ca Ca'... we were actually trying to say that video is trying to take over, what's the radio going to be?&quot;&quot;\n \n The song makes a reference to the broadcast of Orson Welles' The War of the Worlds, in the verse &quot;through wars of worlds/invaded by Mars&quot;.\n \n Taylor began writing the song in Los Angeles when he locked himself in a room with a Roland Jupiter 8 and a drum machine. He thought it would fit his solo album, but when the band heard it, John Deacon wrote a bass-line and Freddie Mercury reconstructed the track, thinking it could be a big hit. Taylor then took a skiing holiday and let Mercury polish the lyrics, harmony, and arrangements of the song. Recording sessions began at Record Plant Studios and included session keyboardist Fred Mandel, who later on would work with Supertramp and Elton John. Mandel programmed the Jupiter's appeggiated synth-bass parts. The recording features prominent use of the Roland VP330+ vocoder. The bassline was produced by a Roland Jupiter 8, using the built-in arpeggiator.\n \n David Mallet's music video for the song features scenes from Fritz Lang's 1927 sci-fi movie Metropolis—Freddie Mercury's solo song &quot;Love Kills&quot; was used in Giorgio Moroder's restored version of the film, and in exchange Queen were granted the rights to use footage from it in their &quot;Radio Ga Ga&quot; video. However, Queen had to buy performance rights to the film from the communist East German government, which was the copyright holder at the time. Critics said that the video looked like a &quot;Nuremberg Rally&quot; much to Roger Taylor's dislike. In the video there is a part where they list some of their earlier videos (such as &quot;Bohemian Rhapsody&quot;, &quot;Flash&quot;, and so forth) in a photo album, illustrating the changes and the influence videos received through the years. In the video Taylor tries to turn right in the vehicle but the vehicle moves to his left, he quickly tries to correct this but the video still shows the error.\n \n In the video, a different version of Bohemian Rhapsody was shown. It can clearly be seen that there are flames around the four members of Queen in the clip.\n \n Queen played a shorter, uptempo version of &quot;Radio Ga Ga&quot; at the Live Aid charity event in 1985 at the Old Wembley Stadium. It became a live favorite thanks largely to the audience participation potential of the clapping sequence prompted by the rhythm of the chorus (copied from the video).\n \n The song was played for the Magic Tour a year later, including twice more at Wembley Stadium; it was recorded for the live album Live at Wembley '86 on 12 July 1986, the second night in the venue.\n \n Paul Young performed the song with Queen at the Freddie Mercury Tribute Concert again at Wembley Stadium on 20 April 1992.\n \n At the &quot;Party at the Palace&quot; concert, celebrating Queen Elizabeth II's Golden Jubilee in 2002, &quot;Radio Ga Ga&quot; opened up Queen's set with Roger Taylor on vocals and Phil Collins on the drums.\n \n This song was played on the Queen + Paul Rodgers Tour in 2005/2006 and sung by Roger Taylor and Paul Rodgers. It was recorded officially at the Hallam FM Arena in Sheffield, England, on 5 May 2005. The result, Return of the Champions, was released on CD and DVD on 19 September 2005 and 17 October 2005, respectively.\n \n It was also played on the Rock The Cosmos Tour during the fall of 2008, this time with just Rodgers on lead vocals. The concert Live in Ukraine came as a result of this tour, yet the song is not available on the CD or DVD versions released 15 June 2009. This performance of &quot;Radio Ga Ga&quot; is only available as a digital download from iTunes.\n \n <a href=\"http://www.last.fm/music/Lady+Gaga\" class=\"bbcode_artist\">Lady Gaga</a> gets her name from this song.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Radio Ga Ga&quot; is a song performed and recorded by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a>, and was written by their drummer <a href=\"http://www.last.fm/music/Roger+Taylor\" class=\"bbcode_artist\">Roger Taylor</a> for the band's 1984 album <a title=\"Queen - The Works\" href=\"http://www.last.fm/music/Queen/The+Works\" class=\"bbcode_album\">The Works</a>. It was released as a single with <a title=\"Queen &ndash; I Go Crazy\" href=\"http://www.last.fm/music/Queen/_/I+Go+Crazy\" class=\"bbcode_track\">I Go Crazy</a>, a <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a>-written track, as its original B-side (3:42).  The single was an enormous worldwide success for the band. It reached number two in the UK (kept from the number one spot only by Frankie Goes To Hollywood's smash hit &quot;Relax&quot;). In the USA it reached the number 16 spot. This was also their last Top 20 hit single in the US until 1992. ", "published": "Tue, 13 Apr 2010 14:31:37 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Radio Ga Ga", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Radio+Ga+Ga", "listeners": "453445", "comments": ["I always love Queen's music, but not this song until I listening playing GTA V.", "How music changes through the years... sad.", "Yep, coming to a Grand Theft Auto game near you.", "Lady gaga named herself after this song...True Fact... [2]", "Timeless!", "So sad song, \"So stick around because we might miss you. When we grow tired of all this visual\"", "GTA V\r\nhttp://www.youtube.com/watch?v=4E0iD9twjDc", "THIS IS MY FAVOURITE SONG EVER.", "You gave them all, those old time stars, through wars of worlds - invaded by Mars! / GAGA <3", "new wave Queen?", "\"Don't kill him !\"", "Yep", "lol, you dudes really needed something to get here to this song?", "v except this song sucks. Queen's 80s material is shit but their 70s stuff is THE shit", "Love it when game trailers (or film for that matter) use great songs. [2]", "GTA V!", "GTA V *-*", "Grand Theft Auto V, brought me here [part II]", "Love it when game trailers (or film for that matter) use great songs.", "Grand Theft Auto V, brought me here (again) [2] What a surprise, they chose this song. My favorite one from \"The Works\", along with \"Keep Passing the Open Window\"."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "00194df0-2294-405e-b2e7-ae35f3d5b543", "duration": "350000", "playcount": "2160458", "id": "1005653"}}