{"track": {"album": {"@attr": {"position": "4"}, "title": "Satellite", "url": "http://www.last.fm/music/P.O.D./Satellite", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/89185273.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/89185273.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/89185273.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/89185273.png", "size": "extralarge"}], "artist": "P.O.D.", "mbid": "3e49dbae-940b-4822-8fed-14ce49ef5f40"}, "wiki": {"content": "&quot;Youth of the Nation&quot; was a hit single from P.O.D. in 2002. It was the second single to come from their album, Satellite. It was inspired in part by the school shootings at Santana High School and Columbine High School. Speaking with <a href=\"http://www.songfacts.com/detail.php?id=1495\" rel=\"nofollow\">Songfacts.com</a> about this song in a 2012 interview, lead singer Sonny Sandoval said: &quot;When we were actually writing the record for Satellite, we were two blocks away from the Santee high school shootings. We had taken a break and went out for some coffee, and we see all the fire trucks and the police department and the helicopters and news. And we're like, something's going on. We turn on the TV and all of a sudden there's a young kid who has trapped everybody inside the school and he's shooting. Here we are, glued to the TV and we're literally two blocks away. All this is going down, and here we were supposed to write music. It kind of just set the tone for how we felt that day.&quot;\n \n While Satellite contained numerous hit songs, &quot;Youth of the Nation&quot; was the band's only #1 hit on the Modern Rock chart and reached #28 on the Billboard Hot 100. The song's inspiration stems from a trip when the band was on their way to record for Satellite. They were held up in traffic and discovered that the reason was a school shooting. The album was consequently delayed and they were inspired to write &quot;Youth of the Nation.&quot; The song follows three distinct characters in assorted problems they face common to American youth.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Youth of the Nation&quot; was a hit single from P.O.D. in 2002. It was the second single to come from their album, Satellite. It was inspired in part by the school shootings at Santana High School and Columbine High School. Speaking with <a href=\"http://www.songfacts.com/detail.php?id=1495\" rel=\"nofollow\">Songfacts.com</a> about this song in a 2012 interview, lead singer Sonny Sandoval said: &quot;When we were actually writing the record for Satellite, we were two blocks away from the Santee high school shootings. We had taken a break and went out for some coffee, and we see all the fire trucks and the police department and the helicopters and news.", "published": "Wed, 25 Jul 2012 17:06:49 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Youth of the Nation", "artist": {"url": "http://www.last.fm/music/P.O.D.", "mbid": "57e79d57-b795-475e-9fa2-5dd9d5513b8c", "name": "P.O.D."}, "url": "http://www.last.fm/music/P.O.D./_/Youth+of+the+Nation", "listeners": "463359", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nu%20metal", "name": "nu metal"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/rapcore", "name": "rapcore"}, {"url": "http://www.last.fm/tag/metal", "name": "metal"}]}, "mbid": "00f1958c-4190-4961-986d-4e46cf5def86", "duration": "259000", "playcount": "2371021", "id": "1006774"}}