{"track": {"album": {"@attr": {"position": "1"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Queen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92260671.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92260671.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92260671.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92260671.png", "size": "extralarge"}], "artist": "Queen", "mbid": "0668d85b-9d8f-4d8e-9b74-3b1420b605be"}, "wiki": {"content": "&quot;We Will Rock You&quot; is a song written by <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a> and recorded and performed by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a> as the opening track on their 1977 album <a title=\"Queen - News Of The World\" href=\"http://www.last.fm/music/Queen/News+Of+The+World\" class=\"bbcode_album\">News Of The World</a>. The album version consists of a stamping-clapping beat, and a power chorus, being somewhat of an anthem. The stamping effects were created by the band overdubbing the sounds of themselves stomping and clapping many times and adding delay effects to create a sound like many people were participating. According to the <a href=\"http://www.songfacts.com/detail.php?id=1377\" rel=\"nofollow\">We Will Rock You Songfacts</a>, Brian May said that his degree in astrophysics helped in the recording of the crucial 'stomp-stomp-clap!&quot; rhythm of the song. Other than the last 30 seconds containing a guitar solo, the song is generally set in acapella form, using  clapping as a rhythmic beat.\n \n As the double A-side with &quot;<a title=\"Queen &ndash; We Are the Champions\" href=\"http://www.last.fm/music/Queen/_/We+Are+the+Champions\" class=\"bbcode_track\">We Are the Champions</a>&quot;, &quot;We Will Rock You&quot; reached number 4 on the U.S. Billboard singles chart, becoming their second hit in the U.S. On the 45 of the song's original vinyl record release, the song was actually the flip side of &quot;We Are the Champions&quot; in Britain, however the American record company requested to put the two songs together as a &quot;double A-side&quot; because American radio stations were playing them back to back. This is a reason why the songs are often paired on the radio and at sporting events, where they are frequently played. The songs are also paired back to back on the album, and they are still played together to this day on American classic rock radio stations.\n \n Queen also performed the song in another arrangement (known as the &quot;fast version&quot;), which featured a faster tempo and a full guitar, bass and drums backing track throughout. The band would often open their live sets in the late 1970s and early 1980s with this version, as captured on their 1979 <a title=\"Queen - Live Killers\" href=\"http://www.last.fm/music/Queen/Live+Killers\" class=\"bbcode_album\">Live Killers</a> double album, on <a title=\"Queen - Queen Rock Montreal\" href=\"http://www.last.fm/music/Queen/Queen+Rock+Montreal\" class=\"bbcode_album\">Queen Rock Montreal</a> (2007), and on the Queen on Fire - Live at the Bowl album released in 2004.\n The &quot;stomp, stomp, clap&quot; sounds were later reused in the <a href=\"http://www.last.fm/music/Queen+%252B+Paul+Rodgers\" class=\"bbcode_artist\">Queen + Paul Rodgers</a> song &quot;<a title=\"Queen+ Paul Rodgers &ndash; Still Burnin'\" href=\"http://www.last.fm/music/+noredirect/Queen%252B+Paul+Rodgers/_/Still+Burnin%27\" class=\"bbcode_track\">Still Burnin'</a>&quot;, a composition which was also written by May.\n \n &quot;We Will Rock You,&quot; as recalled by May in a 2002 interview with Guitar World magazine, &quot;was a response to a particular phase in Queen's career, when the audience was becoming a bigger part of the show than we were. They would sing all the songs. And in a place like Birmingham, they'd be so vociferous that we'd have to stop the show and let them sing to us. So, both Freddie and I thought it would be an interesting experiment to write a song with audience participation specifically in mind. My feeling was that everyone can stamp and clap and sing a simple motif, so We Will Rock You was based on that. \n \n &quot;We recorded it at [Basing Street] Wessex, which is an old converted church that has a natural good sound to it. There are no drums on the track. It's just us clapping and stamping on boards, overdubbed many times over with many primitive delay machines. A bit of singing, a bit of guitar playing, and that's it. The amazing thing is to go to football [soccer] matches or sports events in general and hear people do it. It's very gratifying to find that it has become part of folklore, sort of. I'll die happy because of that.&quot; \n \n In a recent interview with Terry Gross (host of &quot;Fresh Air&quot;), conducted on August 3rd 2010, May was asked to elaborate on writing the song.\n \n <strong>Terry Gross</strong>: &quot; So what inspired that song? I mean, it's been played at so many sports stadiums over the decades. What were you thinking about when you wrote it? Were you thinking of it as a sports anthem?&quot;\n \n <strong>Brian May</strong>: No, not really. I was thinking of it more as a rock anthem, I suppose, and a means of uniting an audience or taking advantage, you know, enjoying the fact that an audience is united. And I didn't realize that it would transfer to sports games and this is quite an amazing thing. It's wonderful for me to see what &quot;We Will Rock You&quot; has done. You know, &quot;We Will Rock You&quot; and &quot;We Are the Champions,&quot; of course, have kind of transcended the normal framework of where music is listened to and appreciated. They've become part of public life, which I feel wonderful about. It's fantastic to me if I go to a, you know, a football game or a soccer game or basketball or whatever or any place all around the world, and there it is. And I think, &quot;My God. Most people don't even realize that I wrote it. Most people don't realize that it was written&quot;. &quot;\n \n <strong>Gross</strong>: That's right.\n \n <strong>May:</strong>: It's sort of become …\n \n <strong>Gross:</strong>: (laughs)  That’s right.\n \n <strong>May:</strong> …one of those things that people think was always there. You know, it sort of goes back into pre-history. So in a way, that's the best compliment you could have for a song.\n \n <strong>Gross:</strong>: Well, I think, you know, that's if people don't even realize it was written, it's in part because it almost sounds like an old-school cheerleader cheer, you know, because...\n \n <strong>May</strong>: Yeah. It's become part of the fabric of life.\n \n <strong>Gross:</strong>: ... of that stomp-stomp-clap thing and because it's a chant.\n \n <strong>May</strong>: Yeah, that's right. Well, the stomp-stomp-clap thing, yeah, people think it was always there, but actually it wasn't. And I don't know how it got into my head. All I can tell you is we played a gig sort of the middle of our career in a place called Bingley Hall near Birmingham. Now, Birmingham is the sort of home of heavy metal, as you probably know. You know, Sabbath and Slade and people come from there. And it was a great night. People were just, the audience were just responding hugely, and they were singing along with everything we did. Now, in the beginning, we didn't relate to that. We were the kind of band who liked to be listened to and taken seriously and all that stuff, you know. So people singing along wasn't part of our agenda. Having said that and then having experienced this wave of participation of the audience, particularly in that gig in Birmingham, we almost to a man sort of reassessed our situation.\n \n I remember talking to Freddie about it and saying, “Look, you know, obviously, we can no longer fight this. This has to become something which is part of our show, and we have to embrace it, the fact that people want to participate. And really, everything becomes a two-way process now.” And we sort of looked at each other and went, “Hmm, how interesting”. And he went away that night and to the best of my knowledge wrote &quot;We Are the Champions&quot; with that in mind. I went away and woke up the next morning with this... (Vocalises 'stomp-stomp-clap') ... in my mind somehow because I was thinking to myself, &quot;What could you give an audience that they could do while they're standing there and they're all crushed together? They can stamp, and they can clap, and they can sing some kind of chant.&quot; So for some reason, it just came straight into my head, the &quot;We Will Rock You.&quot;\n \n And to me, it was kind of a uniting thing. It was an expression of strength. And the words came out very quickly. In fact, everything came out very quickly, and I think that's a good sign when you're writing a song. It should happen quickly, very often, and that means the flow is a good one. And the words are something completely different. If you ask me what I was thinking of in the words of the verses, it's something different. It's although it's related.\n \n <strong>Gross:</strong>: About the boy who's told he's no good?\n \n <strong>May</strong>: Yeah, it's about the development of a boy into a man and his dreams and how he sees himself and how he views his power in the world. It's a kind, it's sort of a contemplative song, really, although it's a big chant with fist in the air. It's about balancing your power with acceptance, I think.\n \n <strong>Gross</strong>: So how did you record the stomp-stomp-clap so it would sound grand and reverberating, as opposed to three people, four people stomping their feet and clapping?\n \n <strong>May</strong>: Well, I'm a physicist, you see. (LAUGHING) So I had this idea, if we did it enough times, and we didn't use any reverb or anything, that I could build a sound which would work.\n \n We were very lucky. We were working in an old, disused church in North London, and it already had a nice sound, not an echoey sound but a nice, big, crisp sound to it. And there were some old boards lying around. I don't know what they were, but they just seemed ideal to stamp on. So we kind of piled them up and started stamping. And they sounded great anyway.\n \n But being a physicist, I thought,&quot;Well, supposing there were a thousand people doing this, what would be happening?&quot; And I thought, &quot;Well, you would be hearing them stamping. You would also be hearing a little bit of an effect, which is due to the distance that they are from you.&quot; So I put lots of individual repeats on them, not an echo but a single repeat and at varying distances. And the distances were all prime numbers.\n \n Now, much later on, people designed a machine to do this, and I think it was called Prime Time or something, but that's what we did. As we recorded each track, we put a delay of a certain length on it, and none of the delays were sort of harmonically related. So what you get is there's no echo on it whatsoever, but the claps sound as though they're spread around the stereo, but they're also kind of spread as regards distance from you. So you just feel like you're in the middle of a large number of people stamping on boards and clapping …\n \n <strong>Gross</strong>: That's amazing.\n \n <strong>May</strong>: … and also singing.\n \n TS: Now, here's another really interesting thing to me about &quot;We Will Rock You.&quot; It's the most famous song that you've written. It's a largely a cappella song. You come in for your guitar solo at the very end. So until, like, the very, very end, like you're not even playing on it, and it's just kind of amazing that you as the guitarist would write a song that you're barely featured on.\n \n <strong>May</strong>: Well, I'm featured stamping and clapping.\n \n <strong>Gross</strong>:  Well, yes.\n \n <strong>May</strong>: And I'm featured singing, so...\n \n <strong>Gross</strong>: And you're very good at that.\n \n (LAUGHING)\n \n <strong>May</strong>:: Thank you, yeah. Well, we're all featured, yeah. Yeah, well, you see, songs aren't about guitars to me. Songs are about, truthfully, a song is about a singer in my opinion, and if the singer gets the idea across, then you're almost home and dry.\n \n You know, you can make the most beautiful piece of production, and I love production. You know, production is a big part of my life. But I'm always aware that if you don't have the right singer, and he doesn't have the right feeling, that you're wasting your time. So a song is a song to me, and it doesn't matter what song. It could be a piano accordion on it. You know, if it's the right song and the right singer, and you feel passion, that's what it's about.\n \n The guitars, yeah, I didn't want us to be standard. I didn't want it to be like oh, here's a guitar solo, and then we sing another verse. I wanted it to be something stark and different. So it was very deliberate that I left the guitar solo to the end just because that was a final statement and a different statement, taking it off in a completely different direction. It changes key into that piece, too, you know, so it's a whole different kind of ship? (unintelligible) It was not a standard pop song. \n \n (From here, the host played the remainder of the song)\n \n <strong>Gross</strong>: So that's the end of &quot;We Will Rock You,&quot; written by my guest, guitarist and singer and songwriter, Brian May, who was one of the founding members of Queen. So ...\n \n <strong>May:</strong> I should, can I comment on the end of that?\n \n <strong>Gross:</strong> Yeah, please.\n \n (LAUGHING)\n \n <strong>May</strong>: Interesting that you play the end of the song. You can hear the guitar waiting in the wings. That was, you can hear this little feedback note. And so the guitar is present, although it's not taking center stage, all through the last choruses, and then finally, it bursts upon the scene. And you notice, Freddie goes “All right”, which means he's kind of handing over to the guitar, and we're in a different universe once the guitar starts, and that was the intention. And it's very sort of informal.\n \n And you may notice - there's a lot of things to notice. You may notice that the last piece, the very last little riffs, are repeated, and they're not just repeated by me playing them again. They're repeated by cutting the tape and splicing it on again and again. So, and that's deliberate, too. It's a way of getting a sort of a thing that makes you sit up towards the end. And then it stops. There is nothing after it, which I really enjoy. (laughs)\n \n There's no big ending. It just stops and leaves you in mid-air, thinking, “Well, what happened there?” \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;We Will Rock You&quot; is a song written by <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a> and recorded and performed by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a> as the opening track on their 1977 album <a title=\"Queen - News Of The World\" href=\"http://www.last.fm/music/Queen/News+Of+The+World\" class=\"bbcode_album\">News Of The World</a>. The album version consists of a stamping-clapping beat, and a power chorus, being somewhat of an anthem. The stamping effects were created by the band overdubbing the sounds of themselves stomping and clapping many times and adding delay effects to create a sound like many people were participating.", "published": "Sat, 5 Mar 2011 19:56:47 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "We Will Rock You", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/We+Will+Rock+You", "listeners": "883199", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}]}, "mbid": "01b9312b-8602-4288-bbc2-0a5e46e91f1c", "duration": "120000", "playcount": "4339843", "id": "12211"}}