{"track": {"album": {"@attr": {"position": "6"}, "title": "Greatest Hits II", "url": "http://www.last.fm/music/Queen/Greatest+Hits+II", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92633831.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92633831.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92633831.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92633831.png", "size": "extralarge"}], "artist": "Queen", "mbid": "92faa683-a1a5-4198-a55d-af3471f14c94"}, "wiki": {"content": "\n &quot;Innuendo&quot; was pieced together &quot;like a jigsaw puzzle.&quot; The recurring theme (with the Boléro-esque beat) started off as a jam session between May, Deacon and Taylor. Mercury then added the melody and some of the lyrics, which were then completed by Taylor.\n \n The middle section was primarily Mercury's work, according to an interview with May in October 1994's Guitar Magazine. It features a flamenco guitar solo, followed by a classically influenced bridge, and then the solo again but performed with electric guitars. This section is especially complex, featuring a pattern of three bars in 5/4 time (reasonably uncommon in popular music) followed by four bars in the more often used 3/4 time.\n \n The &quot;You can be anything you want to be&quot; section features a very sophisticated orchestration, created by Mercury and producer David Richards using the popular Korg M1 keyboard/synth/workstation. Mercury had arranged and co-arranged orchestras in his solo career, and closed the previous Queen album with &quot;Was It All Worth It&quot;, which included a Gershwin-esque interlude also coming from an M1 synth. The bridge section in &quot;Innuendo&quot; is in 3/4, showing once again Mercury's affection for trinary metres: &quot;Bicycle Race&quot; is another one with main sections in 4/4 and middle-eight in 3/4, and some of his best-known pieces (namely &quot;We Are the Champions&quot; and &quot;Somebody to Love&quot;) were in 6/8, as would be his last ever composition, &quot;A Winter's Tale&quot;.\n \n Steve Howe and Mercury had been friends for several years, since they ran into each other quite often at the Townhouse Studios in London. Yes had been recording at Mountain Studios in 1978 shortly before Queen bought the Swiss studio, and Asia's  debut album was produced by Queen's engineer, Mike Stone.\n \n Paul Sutin had released his debut album in 1988 and began recording the second. Steve Howe had played on the first as guitarist and bassist, and Sutin asked him to produce the follow-up, which Howe agreed. This time Howe didn't play bass, only guitar and keyboard, but all of the drum parts in 'Voyager' were recorded by his son. Howe travelled to Geneva to lay his parts down in early 1989. On a break he drove to Montreux and stopped to have lunch. There he ran into Martin Gloves (who had worked for Yes before and then was Queen's equipment supervisor), who told him that Queen were in the studio at the moment.\n \n As soon as Steve Howe went into the studios, Freddie Mercury asked him to play some guitar (according to producer David Richards, who had worked with Yes in the past as well). Another version is that Brian May was the one who asked him to play the flamenco bit. May admitted in a 1991 interview that he couldn't play the bits Howe recorded.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "\n &quot;Innuendo&quot; was pieced together &quot;like a jigsaw puzzle.&quot; The recurring theme (with the Boléro-esque beat) started off as a jam session between May, Deacon and Taylor. Mercury then added the melody and some of the lyrics, which were then completed by Taylor.  The middle section was primarily Mercury's work, according to an interview with May in October 1994's Guitar Magazine. It features a flamenco guitar solo, followed by a classically influenced bridge, and then the solo again but performed with electric guitars.", "published": "Fri, 26 Mar 2010 20:21:17 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Innuendo", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Innuendo", "listeners": "285341", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}]}, "mbid": "020303af-17b9-42b6-9447-7c41debb851f", "duration": "388000", "playcount": "1333691", "id": "1008469"}}