{"track": {"album": {"@attr": {"position": "13"}, "title": "Absolution", "url": "http://www.last.fm/music/Muse/Absolution", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/61418461.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/61418461.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/61418461.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/61418461.png", "size": "extralarge"}], "artist": "Muse", "mbid": "6ff10d60-8e80-4f51-9037-2932b5f49f5a"}, "wiki": {"content": "Another song where Bellamy is in character, dealing with his atheism. As the title suggests, it concerns the thoughts of a dying atheist, scared by his non-belief in an afterlife. Now, at the moment of his death, he must face the disheartening non-existence he will soon inhabit. \n \n Just before the bridge, at 2:04, Wolstenholme can be heard jumping into the pool at Grouse Lodge recording studio as Howard hits his cymbals.\n \n Written by: Matthew Bellamy\n Produced by: Rich Costley\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Another song where Bellamy is in character, dealing with his atheism. As the title suggests, it concerns the thoughts of a dying atheist, scared by his non-belief in an afterlife. Now, at the moment of his death, he must face the disheartening non-existence he will soon inhabit.   Just before the bridge, at 2:04, Wolstenholme can be heard jumping into the pool at Grouse Lodge recording studio as Howard hits his cymbals.  Written by: Matthew Bellamy\n Produced by: Rich Costley", "published": "Sat, 24 Sep 2011 00:46:35 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Thoughts of a Dying Atheist", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Thoughts+of+a+Dying+Atheist", "listeners": "513717", "comments": ["Great song, and a bit underrated.", "Prior to listening to the album, I was expecting to really like this for some reason, but it's actually probably the weakest song on the whole album. Still not bad though.", "As an Agnostic, this song is kind of awkward for me....", "ye ye, just like serginho mallandro", "Great song!", "The intro is something gorgeous.", "♥", "what sixfootginger said", "One of the first Muse tracks I ever heard, love this track so much", "Great song! <3", "The most underated muse track ever!", "♥", "Lol, as a Christian this song is pretty true, its one of those songs that makes you feel like \"oh shit\" what if my perception of what is real is not actually true, then what happens?", "<3", "Just wow ._.", "GENIUS", "you can't sing along to the chorus without sounding like a dumbass, haha :) <3 this song!", "this band got me through highschool in general, but this song stands out\nit was around the time where i went from a christian to completely abandoning my faith\n\nit is interesting going from leaning on faith to get you through and coming to the realization that you no longer can lean on it because you no longer believe in it, and only have yourself in the end", "ba ha ha ha ha! (was reading theVicker's thesis below me) pobrecita ni*a.!!!\r\nentertaining, indeed!!!  =)", "Love this song. I'm an atheist. The line \"it scares the hell out of me\" it purposely ironic, I think. Most of the time I'm not really scared of death... fact is, whether or not you believe the world was around for 4.6 billion years old or only 6000 years old, that's still way more than most people can really conceptualize, and that's also how much time (or more) you DIDN'T exist at one point. So, what's the big deal if you don't exist again? lol. Still, the idea of \"nothingness\" scares me sometimes. Matt has that being an atheist means accepting this is your only life to live, and so you should live it to the fullest, appreciating it, and the only way to live on forever is through influencing the world around you. I agree with his feelings."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "026600ae-9fc0-40b1-a744-18148e59fcce", "duration": "187000", "playcount": "3371267", "id": "2567155"}}