{"track": {"album": {"@attr": {"position": "1"}, "title": "American Idiot", "url": "http://www.last.fm/music/Green+Day/American+Idiot", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/77701986.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/77701986.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/77701986.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/77701986.png", "size": "extralarge"}], "artist": "Green Day", "mbid": "feb25a2b-0c97-4b45-9461-0fac8c00f477"}, "wiki": {"content": "&quot;American Idiot&quot; is a song by American rock band Green Day, and is the first single from their seventh album, American Idiot.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=3937\" rel=\"nofollow\"> American Idiot Songfacts</a>, Billie Joe Armstrong was inspired to write this song after hearing a jingoistic <a href=\"http://www.last.fm/music/Lynyrd+Skynyrd\" class=\"bbcode_artist\">Lynyrd Skynyrd</a> song being played on his car radio, whilst driving to the studio. \n \n Released in 2004, the single peaked at #61 on the Billboard Hot 100, becoming Green Day's first Billboard Hot 100 chart entry (excluding singles that charted on the Bubbling Under Hot 100 Singles chart), helping revive the band's career. However, the appearance of &quot;American Idiot&quot; on the US singles charts occurred just prior to Billboard Magazine's inclusion of internet download purchases into their Billboard Hot 100 chart data, which would have made a significant difference in the song's peak had it benefited from the new chart tabulation system. This most recent form of sales assessment has resulted in the far greater successes of &quot;Boulevard of Broken Dreams&quot;, &quot;Holiday&quot; and &quot;Wake Me Up When September Ends&quot;.\n \n &quot;American Idiot&quot; became Green Day's first Top 5 single in the United Kingdom, reaching #3, and peaked at #7 in Australia. It debuted at #1 in Canada, holding onto the zenith position for five weeks.\n \n In Australia, the song was ranked #22 on Triple J's Hottest 100 of 2004.\n \n Green Day performed this at the 2005 Grammy Awards. The album won for Best Rock Album.\n \n The song was featured in the trailer for the 2005 film Wedding Crashers. The song features on the soundtrack of the American football video game Madden NFL 2005. It was featured as the closing theme song for the first season of the &quot;Andy Milonakis&quot; show. &quot;Weird Al&quot; Yankovic parodied the song on his album Straight Outta Lynwood as &quot;Canadian Idiot&quot; - a satirical commentary on American nationalism and the stereotypical American view of Canadians. In The Simpsons Movie,the song was played by an organist at the band's funeral. Richard Cheese and Lounge Against the Machine covered this song into a lounge style on their 2005 album Aperitif for Destruction, and Avril Lavigne did as well in 2006. The guitar riffs of the song were sampled for the theme for Johnny Test and multiple episodes of the show.\n \n Song information\n \n The song was written by all three members of Green Day, and was co-produced by Green Day and Rob Cavallo. It is in the key of A-flat major, and is widely known for the guitar riff that plays through the whole song, excluding the chorus.\n \n The whole song is similar to the intro riff from Dillinger Four's &quot;Doublewhiskeycokenoice&quot;, written in 1997. Dillinger Four opened for Green Day on Green Day's Japan tour, and released a split 7&quot; with Billie Joe Armstrong's side project, Pinhead Gunpowder\n \n &quot;American Idiot&quot; criticizes the post 9/11 U.S., referring to such issues as paranoia, propaganda and media. &quot;American Idiot&quot; has also been certified as an RIAA Gold (500,000 downloads) along with &quot;Boulevard of Broken Dreams&quot;, American Idiot's second single.\n \n The song helped pave the road for the future American Idiot singles, &quot;Boulevard of Broken Dreams&quot; (which, in a great turnaround, would reach #2 in the U.S.), &quot;Holiday&quot; (a Top 30 hit worldwide), &quot;Wake Me Up When September Ends&quot; (which would reach #6 in the U.S. and the Top 20 worldwide), and &quot;Jesus of Suburbia&quot;. It was their first #1 on the Modern Rock Tracks from the American Idiot album and their sixth overall.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;American Idiot&quot; is a song by American rock band Green Day, and is the first single from their seventh album, American Idiot.  According to the <a href=\"http://www.songfacts.com/detail.php?id=3937\" rel=\"nofollow\"> American Idiot Songfacts</a>, Billie Joe Armstrong was inspired to write this song after hearing a jingoistic <a href=\"http://www.last.fm/music/Lynyrd+Skynyrd\" class=\"bbcode_artist\">Lynyrd Skynyrd</a> song being played on his car radio, whilst driving to the studio.   Released in 2004, the single peaked at #61 on the Billboard Hot 100, becoming Green Day's first Billboard Hot 100 chart entry (excluding singles that charted on the Bubbling Under Hot 100 Singles chart), helping revive the band's career.", "published": "Sat, 13 Mar 2010 08:42:55 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "American Idiot", "artist": {"url": "http://www.last.fm/music/Green+Day", "mbid": "084308bd-1654-436f-ba03-df6697104e19", "name": "Green Day"}, "url": "http://www.last.fm/music/Green+Day/_/American+Idiot", "listeners": "782803", "toptags": {"tag": [{"url": "http://www.last.fm/tag/punk%20rock", "name": "punk rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/punk", "name": "punk"}, {"url": "http://www.last.fm/tag/green%20day", "name": "green day"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "0288196d-131d-4f95-a9b0-102ac30118a9", "duration": "174000", "playcount": "5290611", "id": "14184014"}}