{"track": {"album": {"@attr": {"position": "2"}, "title": "Version 2.0", "url": "http://www.last.fm/music/Garbage/Version+2.0", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/57232735.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/57232735.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/57232735.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/57232735.png", "size": "extralarge"}], "artist": "Garbage", "mbid": "edbdbbf6-8022-4f98-a93f-9d58a7b32692"}, "wiki": {"content": "&quot;I Think I'm Paranoid&quot; is a song by Garbage, the second single released from their second album Version 2.0. It was released in the summer of 1998 and became a hit in many parts of the world following up on the success of previous single releases &quot;Stupid Girl&quot; and &quot;Push It&quot;.\n \n &quot;I Think I'm Paranoid&quot; was written and recorded at Smart Studios during the 1997 sessions for Version 2.0. It was originally titled 'Bend Me'.\n \n Bass on &quot;I Think I'm Paranoid&quot; is by Daniel Shulman, Todd Malcolm Michelles provides the scratching, and the song also contains samples from 'Underfire' by electronic duo Terminalhead.\n \n In keeping with Version 2.0's sonically dense production, &quot;I Think I'm Paranoid&quot; contains over 120 audio tracks.\n \n &quot;I Think I'm Paranoid&quot; was issued as a single worldwide in July 1998. A hit in the US, the song was also popular in the UK, reaching #9, making it the band's fourth consecutive Top 10 hit.\n \n Worldwide, &quot;I Think I'm Paranoid&quot; was backed by B-sides &quot;Deadwood&quot;, purged from &quot;Version 2.0&quot; at the last minute, and &quot;Afterglow&quot;. &quot;Deadwood&quot; was written and recorded at Smart Studios in Madison, Wisconsin during the 1997 sessions for the band's second album Version 2.0. Driven by an acoustic guitar and moody bass, &quot;Deadwood&quot; is a tale of a relationship gone too far to the point of no return. &quot;Deadwood&quot; appeared on early tracklistings for Version 2.0, however it failed to make the cut for the album and eventually saw the light of day as a b-side on the second Version 2.0 single release. Bass guitar on &quot;Deadwood&quot; was played by Daniel Shulman. &quot;Deadwood&quot; is published by Deadarm Music/Almo Music Corp (ASCAP) and Vibecrusher Music/Irving Music, Inc (BMI). Garbage have never performed &quot;Deadwood&quot; live, although at many shows the song has been requested by attending fans.\n \n &quot;I Think I'm Paranoid&quot; is also featured in the 1998 Playstation game Gran Turismo 2 and as a playable track on the main setlist of the 2007 video game Rock Band.\n \n The video clip for &quot;I Think I'm Paranoid&quot; was filmed on May 22, 1998, and directed by Matthew Rolston in Los Angeles' Occidental Studios. The video premiered in the US on July 12.\n \n The concept behind the video was to make something simple, to contrast with the band's previous effects-heavy video for &quot;Push It&quot;, in black and white and for it to be &quot;almost photographic&quot;. Rolston used mylar to create effects on-screen, and shot the band in close up, inspired by the cover of The Beatles' album With The Beatles.\n \n The video was modified shortly after its release to soften some of the strobing within the video. The video for &quot;I Think I'm Paranoid&quot; was included on the 2007 Absolute Garbage DVD.\n \n &quot;I Think I'm Paranoid&quot; was first performed live on 15 May 1998 in Combined Locks, Wisconsin on the first date of the 'Version 2.0' tour. It has continued to be a live favourite throughout that tour and also on the 'beautifulgarbage' and 'Bleed Like Me' world tours.\n \n An acoustic version of &quot;I Think I'm Paranoid&quot; has also been performed live. A live acoustic version of the track was also released on the US compilation CD 'The End Sessions Vol 2' in November 1999.\n \n I Think I'm Paranoid was performed live on TV shows TFI Friday, Top Of The Pops, Later with Jools Holland (UK), Fuse Comp'd (US) and Nulle Part Ailleurs (France).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;I Think I'm Paranoid&quot; is a song by Garbage, the second single released from their second album Version 2.0. It was released in the summer of 1998 and became a hit in many parts of the world following up on the success of previous single releases &quot;Stupid Girl&quot; and &quot;Push It&quot;.  &quot;I Think I'm Paranoid&quot; was written and recorded at Smart Studios during the 1997 sessions for Version 2.0. It was originally titled 'Bend Me'.  ", "published": "Fri, 31 Jul 2009 08:42:33 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "I Think I'm Paranoid", "artist": {"url": "http://www.last.fm/music/Garbage", "mbid": "ccc700c7-a178-4692-a912-dd581bf54d11", "name": "Garbage"}, "url": "http://www.last.fm/music/Garbage/_/I+Think+I%27m+Paranoid", "listeners": "316063", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}]}, "mbid": "031b3b67-4043-44a7-9188-564add4ef622", "duration": "218000", "playcount": "1637135", "id": "1001665"}}