{"track": {"album": {"@attr": {"position": "8"}, "title": "The Rolling Stones Singles Box Set (1971-2006)", "url": "http://www.last.fm/music/The+Rolling+Stones/The+Rolling+Stones+Singles+Box+Set+(1971-2006)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/62159257.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/62159257.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/62159257.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/62159257.jpg", "size": "extralarge"}], "artist": "The Rolling Stones", "mbid": ""}, "wiki": {"content": "&quot;Miss You&quot; is a 1978 hit song by The Rolling Stones, from their album Some Girls.\n \n &quot;Miss You&quot; was written by singer Mick Jagger while jamming with keyboardist Billy Preston during rehearsals for the March 1977 El Mocambo club gigs (yielding Side Three of the Love You Live album). Although guitarist Keith Richards is credited for co-writing, Jagger is generally regarded as the principal composer.\n \n Several of the songs on 1976's Black and Blue had been influenced by dance music. &quot;Miss You&quot; was the first Rolling Stones single with prominent disco influences, most noticeably in Charlie Watts' thumping, four-on-the-floor drum beat, and in Bill Wyman's funky, grooving bass-lines, which provide another riff in addition to the main melody. That melody, sung in playful falsetto by Jagger, or else intoned by a chorus of dreamy, borderline-campy backup singers, forms the principal hook used throughout the track, often underlined by Sugar Blue's harmonica lines and incisive solos. The funky beat and the rapping during the verses are reminiscent of hip-hop, although it would be a couple of years before hip-hop was commonly recognized as a distinct genre in its own right.\n \n Unlike most of the Stones songs on Some Girls, &quot;Miss You&quot; features several studio musicians. In addition to Sugar Blue, Ian McLagan supplies electric piano, which fits into the overall groove of the song to the point that it is barely audible, and Mel Collins provides the glitzy saxophone solos heard during the instrumental break.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Miss You&quot; is a 1978 hit song by The Rolling Stones, from their album Some Girls.  &quot;Miss You&quot; was written by singer Mick Jagger while jamming with keyboardist Billy Preston during rehearsals for the March 1977 El Mocambo club gigs (yielding Side Three of the Love You Live album). Although guitarist Keith Richards is credited for co-writing, Jagger is generally regarded as the principal composer.  ", "published": "Sun, 12 Apr 2009 20:26:07 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Miss You", "artist": {"url": "http://www.last.fm/music/The+Rolling+Stones", "mbid": "b071f9fa-14b0-4217-8e97-eb41da73f598", "name": "The Rolling Stones"}, "url": "http://www.last.fm/music/The+Rolling+Stones/_/Miss+You", "listeners": "356657", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/the%20rolling%20stones", "name": "the rolling stones"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0431d2b6-e24b-4dce-8eed-70058c5c2a1b", "duration": "215000", "playcount": "1531214", "id": "2716205"}}