{"track": {"album": {"@attr": {"position": "11"}, "title": "A Night at the Opera", "url": "http://www.last.fm/music/Queen/A+Night+at+the+Opera", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88044381.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88044381.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88044381.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88044381.png", "size": "extralarge"}], "artist": "Queen", "mbid": "883a226f-eb77-423f-85c9-7b90c61db6bb"}, "wiki": {"content": "&quot;Bohemian Rhapsody&quot; is a song written by <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a> and originally recorded by the band Queen for their 1975 album <a title=\"Queen - A Night at the Opera\" href=\"http://www.last.fm/music/Queen/A+Night+at+the+Opera\" class=\"bbcode_album\">A Night at the Opera</a>.\n \n The song is in the style of a stream-of-consciousness nightmare, and has unusual musical structure for popular music (it has no chorus, instead consisting of seemingly disjointed sections including operatic segments, an <a href=\"http://www.last.fm/tag/a%20cappella\" class=\"bbcode_tag\" rel=\"tag\">a cappella</a> and a hard rock part) which works beyond the range of this reviewer. Despite this, it was released as a single and became a huge commercial success. \n \n Bohemian Rhapsody is widely hailed as Queen's &quot;magnum opus&quot;, and it marked a decisive point in the band's career and set them on the way to become one of the world's most popular music groups.  The single was accompanied by a groundbreaking music video (then termed a &quot;promotional video&quot;) which helped establish the visual language of the modern music video. \n \n A truncated version of the song was included in all Queen's subsequent live concert performances (as the band could not recreate the middle section live, because of the many overdubbed voices) and still enjoys great popularity around the world.\n \n In January 1976,  Freddie Mercury was interviewed by Sounds regarding the writing process of the song.:\n \n &quot;I'm going to shatter some illusions, it was just one of those pieces I wrote for the album: just writing my batch of songs. In its early stages I almost rejected it, but then it grew. We started deciding on a single about halfway through. There were a few contenders - we were thinking of '<a title=\"Queen &ndash; The Prophet's Song\" href=\"http://www.last.fm/music/Queen/_/The+Prophet%27s+Song\" class=\"bbcode_track\">The Prophet's Song</a>' at one point - but then 'Bohemian Rhapsody' seemed the one. There was a time when the others wanted to chop it around a bit, but I refused. If it was going to be released, it would be in its entirety. We knew it was very risky, but we had so much confidence in that song - I did anyway. I felt, underneath it all, that if it was successful it would earn a lot of respect. People were all going, You're joking, they'll never play it, you'll only hear the first few bars and then they'll fade it out. We had numerous rows. EMI were shocked - A six-minute single? You must be joking! The same in America - Oh, you just got away with it in Britain.&quot;\n \n In a 1982 interview with  On The Record, Queen guitarist <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a> discussed the song's vocal harmonies, and creating the now famous solo.\n \n <em>Interviewer</em>: Who came up with the idea for the vocal harmonies used in &quot;Bohemian Rhapsody&quot;?\n \n <em>Brian May</em>:  We always were keen on that kind of thing. That was something which we wanted to do from the beginning. We wanted to be a group that could do the heaviness of hard rock, but also have harmonies swooping around all over the place. We thought there was some real power and emotion in that combination.\n \n <em>Interviewer</em>: Was the first solo in that song very difficult for you?\n \n <em>Brian May</em>: No, that was pretty much off the cuff, except I think I had plenty of time to think about that one. I remember playing along with it in the studio for a while when other things were being done. I knew what kind of melody I wanted to play. \n \n John Deacon spoke about the song in a 1977 interview: &quot;When we finished the album, the Night at the Opera album, that was the track on it that we thought we were gonna release as a single in England first. And when we released it in England we didn't necessarily think it'd be released in America, cause we know even over here, you know, the AM tastes are even more (hesitates) stricter. Anyway we did have thoughts about even in England, perhaps editing it down at all, but we listened to it over and over again and there was no way we could edit it. We tried a few ideas, but if you edited it, you always lost some part of the song, so we had to leave it all in. And luckily it took off anyway.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Bohemian Rhapsody&quot; is a song written by <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a> and originally recorded by the band Queen for their 1975 album <a title=\"Queen - A Night at the Opera\" href=\"http://www.last.fm/music/Queen/A+Night+at+the+Opera\" class=\"bbcode_album\">A Night at the Opera</a>.  The song is in the style of a stream-of-consciousness nightmare, and has unusual musical structure for popular music (it has no chorus, instead consisting of seemingly disjointed sections including operatic segments, an <a href=\"http://www.last.fm/tag/a%20cappella\" class=\"bbcode_tag\" rel=\"tag\">a cappella</a> and a hard rock part) which works beyond the range of this reviewer. Despite this, it was released as a single and became a huge commercial success.  ", "published": "Thu, 7 Feb 2013 13:37:44 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Bohemian Rhapsody", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Bohemian+Rhapsody", "listeners": "1109303", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}]}, "mbid": "050349b6-7879-4eb3-81db-5345f51a6c1f", "duration": "356000", "playcount": "7082894", "id": "12198"}}