{"track": {"album": {"@attr": {"position": "1"}, "title": "The Essential Santana (disc 1)", "url": "http://www.last.fm/music/Santana/The+Essential+Santana+(disc+1)", "image": [{"#text": "http://images.amazon.com/images/P/B00006FI96.01.MZZZZZZZ.jpg", "size": "small"}, {"#text": "http://images.amazon.com/images/P/B00006FI96.01.MZZZZZZZ.jpg", "size": "medium"}, {"#text": "http://images.amazon.com/images/P/B00006FI96.01.MZZZZZZZ.jpg", "size": "large"}, {"#text": "http://images.amazon.com/images/P/B00006FI96.01.MZZZZZZZ.jpg", "size": "extralarge"}], "artist": "Santana", "mbid": "23111c54-5553-4b49-a1f6-2810dc6e4641"}, "wiki": {"content": "Smooth is a collaboration between Santana and Rob Thomas, the latter of the rock group Matchbox Twenty. The song was written by Rob Thomas and Itaal Shur and sung by Rob Thomas. Originally conceived by Shur as a song called &quot;Room 17&quot;, the lyrics were stripped off and the track was given to Thomas. Thomas re-wrote the lyrics and melody and re-titled it &quot;Smooth&quot;. Thomas's original thought was to have George Michael sing the song. Thomas recorded the song as a demo to play for Santana. After hearing the song being sung by Thomas, Santana decided to have Thomas record the final version. Matt Serletic produced the record and it was released from Carlos Santana's album Supernatural and became a massive hit in 1999, entering the Top 40 of the Billboard Hot 100 on August 10, 1999, and spending twelve weeks at number one on the Billboard Hot 100 beginning October 12, 1999. It was the first chart-topping song in Santana's long-running career (his previous biggest hit being &quot;Black Magic Woman&quot;, number four in 1971). According to some charting standards, &quot;Smooth&quot; is Billboard's most popular song of all time. Though some songs have spent longer than 12 weeks at number one, when combining total sales during the entire time the song has charted, &quot;Smooth&quot; ranks higher than any other. The song was the last number one hit of the 1990s.\n \n The song won three Grammy Awards, including Record of the Year, Song of the Year, and Best Pop Collaboration with Vocals. It spent a record-breaking ten consecutive weeks at the top of the VSpot Top 20 Countdown, a record that held up until the Dixie Chicks broke it in 2006. According to Billboard's Hottest Hot 100 Hits by Fred Bronson, this is the number-one song of The Nineties (2003). A cover version of the song is included in the Wii version of Samba de Amigo. Escape the Fate also recorded a cover version of the song for the compilation album Punk Goes Pop 2, released on March 10, 2009.\n \n The song features a Latin-influenced feel, inspired by the classic Santana song, &quot;Guajira&quot;.\n \n Rob Thomas wrote this song for his wife, Marisol Thomas. The pair married in 1999, after meeting backstage in 1998. Of Spanish origin, she was the inspiration behind lines such as, &quot;My muñequita, my Spanish Harlem Mona Lisa&quot;. Thomas stated in interviews that the phrase &quot;Spanish Harlem Mona Lisa&quot; was inspired by the 1972 Elton John song Mona Lisas and Mad Hatters, which includes references to the 1961 Ben E. King song Spanish Harlem.\n \n On Billboard magazine's rankings of the top songs of the first fifty years of the Hot 100 singles chart, &quot;Smooth&quot; was ranked as the number-two song overall (behind only &quot;The Twist) and the number-one rock song in the history of the chart.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Smooth is a collaboration between Santana and Rob Thomas, the latter of the rock group Matchbox Twenty. The song was written by Rob Thomas and Itaal Shur and sung by Rob Thomas. Originally conceived by Shur as a song called &quot;Room 17&quot;, the lyrics were stripped off and the track was given to Thomas. Thomas re-wrote the lyrics and melody and re-titled it &quot;Smooth&quot;. Thomas's original thought was to have George Michael sing the song. Thomas recorded the song as a demo to play for Santana. After hearing the song being sung by Thomas, Santana decided to have Thomas record the final version.", "published": "Sun, 17 May 2009 11:41:19 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Smooth", "artist": {"url": "http://www.last.fm/music/Santana", "mbid": "1bc6816a-d056-4113-9b0a-6c52e5c31a3c", "name": "Santana"}, "url": "http://www.last.fm/music/Santana/_/Smooth", "listeners": "239121", "comments": ["ultimate creation !!! so long ...searching for it..", "How da he do dat? Great riff.", "It makes my blood and cells jump from rhythm emotions!", "must move to this... must!!", "♡♥ღ♫ღ♥♡", "La musica Santana - todos canciónes son incredibles!", "Klasse !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "einfach klasse !!!!!!!!!!!!!!!", "brilliant", "love this so much", "great lyrics....hot...hot...hot...", "meine erster Song war , wie kann es anders sein SAMPA PA TI und die Platte hab ich in Oldenburg bei Hertie gekauft :-). Bei Carlos Santana bewundere ich die Vielfaftigkeit seine Song's sind  nie langweilig. \nWas mich ärgert  das unzählige Qualittativ schlechte gepresst werden.", "sooooo good~", "So smooth, so sexy. Great to dance to as well. Ready for summer!", "It is impossible to resist his rhythm Salud!!,", "Rob Thomas - Best move ever. Carlos so smooooooth", "a timeless track", "unf", "Carlos santana looks like gadaffi", "Santana!!!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/latin", "name": "latin"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}, {"url": "http://www.last.fm/tag/latin%20rock", "name": "latin rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}]}, "mbid": "05d97932-7734-41ec-a44b-47ec8cbad4d1", "duration": "239000", "playcount": "1142424", "id": "29238"}}