{"track": {"album": {"@attr": {"position": "7"}, "title": "(What's the Story) Morning Glory?", "url": "http://www.last.fm/music/Oasis/(What%27s+the+Story)+Morning+Glory%3F", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/31381233.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/31381233.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/31381233.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/31381233.png", "size": "extralarge"}], "artist": "Oasis", "mbid": ""}, "wiki": {"content": "&quot;Some Might Say&quot; is a song by British rock band Oasis, written by the band's lead guitarist Noel Gallagher. It was the first single to be released from their definitive second album (What's the Story) Morning Glory ? in 1995, and provided the band with their first #1 in the UK Singles Chart (see 1995 in British music).\n \n The track was apparently inspired by the Small Faces and/or T-Rex. It was the last Oasis track to feature original drummer Tony McCarroll, who was asked to leave the band before the main recording sessions for (What's the Story) Morning Glory ? when tensions arose between McCarroll and the Gallagher brothers. The rest of the tracks on the album feature Alan White on drums.\n \n The sleeve artwork, shot at Cromford railway station in Derbyshire, England, features art director Brian Cannon's father with wheelbarrow and his mother with mop. Also pictured are Matthew Sankey, Cannon's aide and Carla Knox, barmaid of his local pub. Liam Gallagher can be seen on the bridge whilst Noel can be viewed with a watering can. Cannon himself rates this piece amongst his greatest works.\n \n The planned promo video for the song was cancelled due to Liam not turning up for the shoot. Instead, a makeshift video was created using footage from the &quot;Cigarettes &amp; Alcohol&quot; and US &quot;Supersonic&quot; videos.\n \n In an interview promoting the compilation album, Stop the Clocks, Noel stated that &quot;Some Might Say&quot; is the &quot;archetypical Oasis song' and 'defines what Oasis is&quot;. This is notable, as the song isn't played live much. Noel added later in the interview that along with &quot;Some Might Say&quot;, its b-side, &quot;Acquiesce&quot;, was also the song that defined Oasis.\n \n The song also appears on Stop the Clocks, as do two of the b-sides. Surpisingly, this means that the &quot;Some Might Say&quot; single contains the fourth largest number of tracks to appear on Stop the Clocks of any Oasis release (after Definitely Maybe, Morning Glory and The Masterplan). Therefore, more songs from this single ended up on Stop the Clocks than Don't Believe the Truth (2 songs), Standing on the Shoulder of Giants, Heathen Chemistry (1 song each) and Be Here Now (no songs from this album appear on Stop the Clocks).\n \n &quot;Some Might Say&quot; is a playable track in both Guitar Hero World Tour and The European version of Guitar Hero On Tour: Decades\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Some Might Say&quot; is a song by British rock band Oasis, written by the band's lead guitarist Noel Gallagher. It was the first single to be released from their definitive second album (What's the Story) Morning Glory ? in 1995, and provided the band with their first #1 in the UK Singles Chart (see 1995 in British music).  The track was apparently inspired by the Small Faces and/or T-Rex. It was the last Oasis track to feature original drummer Tony McCarroll...", "published": "Fri, 12 Dec 2008 01:30:15 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Some Might Say", "artist": {"url": "http://www.last.fm/music/Oasis", "mbid": "39ab1aed-75e0-4140-bd47-540276886b60", "name": "Oasis"}, "url": "http://www.last.fm/music/Oasis/_/Some+Might+Say", "listeners": "508556", "comments": ["not bad at all", "Lovely!", "Excellent!", "Oh, I love this so very much...", "One of their best. [2]", "One of their best.", "My all time favourite song!", "glorious", "You know what some might say.", "one of my fav Oasis songs.", "Takes me right back to my teenage years. Memmmmmorieees...", "one of the best oasis song ever", "U like this song? Then u may like this too :) http://www.youtube.com/watch?v=0ZinlkwhUJw", "My best Oasis song EVER.", "wonderful easy melodie", "Absolutely, 100% PERFECT. [3]", "An upbeat song here which is really more in keeping with the sound of 90's Britpop than the classic rock tropes that normally define Oasis (in my opinion).", "This is the sound of the 90s", "Nah Don't Look Back In Anger is better!", "the best song ever written"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/britpop", "name": "britpop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/oasis", "name": "oasis"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0683d882-2813-460e-90c6-26caf783e1ff", "duration": "328000", "playcount": "2479744", "id": "16256"}}