{"track": {"album": {"@attr": {"position": "12"}, "title": "Make Yourself", "url": "http://www.last.fm/music/Incubus/Make+Yourself", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/80514301.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/80514301.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/80514301.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/80514301.png", "size": "extralarge"}], "artist": "Incubus", "mbid": "00d1109d-6954-3791-8193-c29fdc28bf30"}, "wiki": {"content": "&quot;Pardon Me&quot; is a song by American alternative rock band Incubus from their 1999 album Make Yourself. It was the first Incubus song to receive a considerable amount of radio airplay, reaching #3 on the Billboard Modern Rock Tracks chart. A music video directed by Steven Murashige also gained considerable airplay.\n The song describes a state of confusion, with allusions to spontaneous combustion. Lead singer Brandon Boyd says he was inspired to write the song after making a connection between images of spontaneous combustion in a magazine and &quot;some turmoil in [his] life, both good and bad&quot;.\n Musically, the song combines fast-paced, ambient verses with prominent DJ scratching and a hard-rocking mid-tempo chorus. However, the acoustic version of the song is also well-regarded by fans, and helped the song become a radio hit. Initial radio reception was lukewarm, so Boyd and guitarist Mike Einziger decided to perform the song acoustically at several radio stations that had been playing the song, including KROQ, and this acoustic version grabbed the attention of radio programmers and listeners. An acoustic recording of the song was released on the When Incubus Attacks Volume 1 EP.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Pardon Me&quot; is a song by American alternative rock band Incubus from their 1999 album Make Yourself. It was the first Incubus song to receive a considerable amount of radio airplay, reaching #3 on the Billboard Modern Rock Tracks chart. A music video directed by Steven Murashige also gained considerable airplay.\n The song describes a state of confusion, with allusions to spontaneous combustion. Lead singer Brandon Boyd says he was inspired to write the song after making a connection between images of spontaneous combustion in a magazine and &quot;some turmoil in  life, both good and bad&quot;.\n ", "published": "Thu, 9 Jul 2009 20:25:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Pardon Me", "artist": {"url": "http://www.last.fm/music/Incubus", "mbid": "308aea66-5205-4344-b700-319a8dccaa43", "name": "Incubus"}, "url": "http://www.last.fm/music/Incubus/_/Pardon+Me", "listeners": "445560", "comments": ["Zombiewizardgod ---- people's mindless games", "I've been thinking of combustication as a welcomed vacation.", "I was having a look in a book and I found a picture of a guy fried above his knee", "I've had enough of the world, and it's people's mindless games", "Part of my \"woe is me\" playlist on Spotify/Facebook. Consider joining these groups: OVER THE PRETENCE and I'm British, but I have this thing for American music...", "lovelovelove", "The scratching on this is just amazing", "I perceive a lot of sincerity. Perhaps that's why is my favorite... by now.", "why pardon you !!", "Brandon Boyd's lyrics are just life inspiring. Not too many bands can say that post 1979. [3]", "Brandon Boyd's lyrics are just life inspiring. Not too many bands can say that post 1979. [2] Just amazing!", "met brandon in orlando, circa 1998 - he was at the virgin mega center looking at photography books :)  always reminds me of \"having a look in a book..\"  cool story bro", "Pardon me, while I burp.", "Pardon me, while I burp.", "\"Pardon me while I burst into flames.\"", "I don't think this song will ever get old...", "PARDON ME!~ WHY I BURST IN-TOOO FLAMES! So deep... *gets chills*", "Never thought I'd be 23, on the verge of spontaneous combustion! Love this song!", "great song!!", "Indeed"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/incubus", "name": "incubus"}, {"url": "http://www.last.fm/tag/cimx-fm", "name": "cimx-fm"}]}, "mbid": "06a88436-bd08-4a60-b40f-44cf0e80e1a7", "duration": "240000", "playcount": "2578817", "id": "15361818"}}