{"track": {"album": {"@attr": {"position": "4"}, "title": "Abbey Road", "url": "http://www.last.fm/music/The+Beatles/Abbey+Road", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88060027.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88060027.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88060027.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88060027.png", "size": "extralarge"}], "artist": "The Beatles", "mbid": "9e53c190-5621-3848-8ae4-39ad9f7d9ace"}, "wiki": {"content": "&quot;Oh! Darling&quot; is a song of The Beatles composed by Paul McCartney (credited to Lennon/McCartney) and appearing as the fourth song on the Abbey Road album in 1969. Its working title was &quot;Oh! Darling (I'll Never Do You No Harm)&quot;\n McCartney later said of recording the track, &quot;When we were recording 'Oh! Darling' I came into the studios early every day for a week to sing it by myself because at first my voice was too clear. I wanted it to sound as though I'd been performing it on stage all week.&quot; He would only try the song once each day, if it was not right he would wait until the next day. In order to make sure he got every precious first take right, McCartney would practice the song in the bathtub. He once lamented that &quot;five years ago I could have done this in one take&quot;\n \n In a 1980 interview with Playboy magazine, John Lennon said, &quot;'Oh! Darling' was a great one of Paul's that he didn't sing too well. I always thought I could have done it better—it was more my style than his. He wrote it, so what the hell, he's going to sing it.&quot;\n \n George Harrison described the song as &quot;a typical 1950s–'60s-period song because of its chord structure.&quot;Oh! Darling&quot; appears to have drawn heavily on the New Orleans rhythm and blues sound popularised during the 1950s and early 1960s by African-American musicians like Fats Domino; it also seems to have drawn on the Louisiana swamp blues sound found in songs like Slim Harpo's &quot;Raining In My Heart.&quot; Furthermore, it may have drawn on the related Louisiana genre known today as swamp pop, whose distinctive sound bears an uncanny resemblance to the basic structure of &quot;Oh! Darling&quot; — so much so that some in Louisiana originally thought the song had been recorded by a local musician. (When swamp pop musician John Fred met the Beatles in London in the 1960s, he was shocked to learn that &quot;they were very familiar with Louisiana music.&quot;) Fittingly, swamp pop musician Jay Randall eventually covered &quot;Oh! Darling&quot; for the Lanor label of Church Point, Louisiana\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Oh! Darling&quot; is a song of The Beatles composed by Paul McCartney (credited to Lennon/McCartney) and appearing as the fourth song on the Abbey Road album in 1969. Its working title was &quot;Oh! Darling (I'll Never Do You No Harm)&quot;\n McCartney later said of recording the track, &quot;When we were recording 'Oh! Darling' I came into the studios early every day for a week to sing it by myself because at first my voice was too clear. I wanted it to sound as though I'd been performing it on stage all week.&quot; He would only try the song once each day, if it was not right he would wait until the next day.", "published": "Mon, 5 Aug 2013 10:15:18 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Oh! Darling", "artist": {"url": "http://www.last.fm/music/The+Beatles", "mbid": "b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d", "name": "The Beatles"}, "url": "http://www.last.fm/music/The+Beatles/_/Oh!+Darling", "listeners": "509652", "comments": ["♥", "Paul sounds powerful on this.", "Is that all you got to say?", "Not my favourite, but still better than most stuff today.", "cool - i rarely listen to this album", "awesome song", "Paul isn't a wanker. You're a wanker. Paul's voice makes males pregnant too.", ":)", "They were, and always will be, the definitive catalyst of social and musical change from the 1960s and onward into the future.  Their music spans generations --- but you had to be there to really understand its impact....", "love the emotional, screamy voice", "Paul's voice makes girls pregnant. [20]", "pretty good stevie wonder cover", "PAUL!", "Paul's voice makes girls pregnant. [19]", "Killer vocals!!!", "An embarrassing old man he is, but the song's allright.", "To be fair he is a wanker, a wanker that can play bass and sing well (except he can't sing anymore)", "Paul's voice makes girls pregnant. [17]", "Paul's voice makes girls pregnant. [16] Pure testosterone from the man. That said I met this bitchy part-time girl recently at my local record store who called Paul a wanker but couldn't think of any reason why apart from \"he just is\", annoyed me to no end, dude's a national treasure", "zappa"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/the%20beatles", "name": "the beatles"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "08458493-c50f-45b9-9b34-0a08e19f5411", "duration": "205000", "playcount": "2950949", "id": "1000403"}}