{"track": {"album": {"@attr": {"position": "4"}, "title": "Weezer", "url": "http://www.last.fm/music/Weezer/Weezer", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/53593773.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/53593773.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/53593773.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/53593773.png", "size": "extralarge"}], "artist": "Weezer", "mbid": "a6386b40-5135-4782-a0df-1ad4463525ab"}, "wiki": {"content": "&quot;Buddy Holly&quot; is a song by the rock group Weezer, written by Rivers Cuomo. It was released as the second single from the band's debut album Weezer (The Blue Album) in 1994. The single was released on what would have been Buddy Holly's 58th birthday, had he not been killed in a plane crash along with fellow rock pioneers Ritchie Valens and The Big Bopper on February 3, 1959. The lyrics reference the song's 1950s namesake and actress Mary Tyler Moore. It reached #2 and #34 on the US Modern Rock Tracks chart and the US Mainstream Rock Tracks chart, respectively. It also reached #12 in the UK. Rolling Stone ranked &quot;Buddy Holly&quot; #497 in its 2004 list of The 500 Greatest Songs of All Time. The single was certified gold by the RIAA in 2006.\n \n <strong>Song development</strong>\n Rivers Cuomo has stated in one of his MySpace blogs from 2006 that he remembers questioning whether or not to include this song on The Blue Album. He almost kept it off the final track list, but encouragement from producer Ric Ocasek soon changed his mind. In the book 'River's Edge', Ocasek is quoted as saying, &quot;I remember at one point he was hesitant to do 'Buddy Holly' and I was like, 'Rivers, we can talk about it. Do it anyway, and if you don't like it when it's done, we won't use it. But I think you should try. You did write it and it is a great song.'&quot; Cuomo said that he felt the song was &quot;too cheesy&quot; and didn't know if the song represented the sound he was going for with the band's music. Matt Sharp recalls:\n \n     ...Ric said we'd be stupid to leave it off the album. We'd come into the studio in the morning and find little pieces of paper with doodles on them: WE WANT BUDDY HOLLY.\n \n Cuomo has since concluded that he is glad that he didn't change his mind about the song because it is one of his favorite songs to play and sing live. Furthermore, it has proved to be one of Weezer's most successful singles and a song that is very much enjoyed live.\n \n An early demo of &quot;Buddy Holly&quot; recorded by Cuomo in 1993 has a different feel, as the song is played at a much slower tempo than the version that appears on the album. This version appeared on Alone: The Home Recordings of Rivers Cuomo. The liner notes for Alone explain that the chorus, in its most primitive form, originally was sung as: &quot;Oo-wee-oo you look just like Ginger Rogers/Oh, oh, I move just like Fred Astaire,&quot; the rest of the chorus the way it appears even in the Blue Album version.\n \n The music video for &quot;Buddy Holly&quot; was directed by Spike Jonze and filmed at Charlie Chaplin Studios in Hollywood over the course of one full day of shooting.\n \n The video portrayed Weezer performing at the original Arnold's Drive-In diner from the popular '70s television show Happy Days. The video combined contemporary footage of the band with clips from the show. Happy Days cast member Al Molinaro made a cameo appearance in the video. Al plugs his hometown, Kenosha, Wisconsin, in the introduction. In the memorable climax, editing and a stunt double allowed Fonzie to dance to the band's performance. The video also features brief cameos by some members of the band as dancers at Arnold's. Initially, actor Anson Williams, who played Potsie on Happy Days, objected to footage of him appearing in the video, but relented after a letter from David Geffen, founder of Geffen Records.\n \n The video was met with great popularity and heavy rotation on MTV. The innovative video scored four awards at the 1995 MTV Video Music Awards, including prizes for Breakthrough Video and Best Alternative Video.\n \n The &quot;Buddy Holly&quot; music video became so popular that it was included on the Microsoft Windows 95 CD-ROM when the operating system was first released.\n \n <strong>Track Listings</strong>\n Promo Only Radio Single\n \n    1. &quot;Buddy Holly &quot;- 2:40\n \n UK Retail CD\n \n    1. &quot;Buddy Holly&quot; - 2:40\n    2. &quot;My Name Is Jonas&quot; (Live) - 3:40\n    3. &quot;Surf Wax America&quot; (Live) - 4:09\n    4. &quot;Jamie&quot; - 4:18\n \n UK Retail Cassette/UK Retail 7&quot; Single (Black Vinyl)\n \n    1. &quot;Buddy Holly&quot; - 2:40\n    2. &quot;Jamie&quot; - 4:18\n \n Australian Retail CD\n \n    1. &quot;Buddy Holly&quot; - 2:40\n    2. &quot;Holiday&quot;\n \n Dutch Retail CD\n \n    1. &quot;Buddy Holly&quot; - 2:40\n    2. &quot;Surf Wax America&quot; (Live) - 4:09\n \n Live tracks recorded at Horizontal Boogie Bar, Rochester, NY on November 27, 1994.\n \n <strong>Chart positions</strong>\n UK Singles Chart: 12\n U.S. Billboard Hot 100 Airplay: 18\n U.S. Billboard Mainstream Rock Tracks: 36\n U.S. Billboard Modern Rock Tracks: 2\n U.S. Billboard Top 40 Mainstream: 17\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Buddy Holly&quot; is a song by the rock group Weezer, written by Rivers Cuomo. It was released as the second single from the band's debut album Weezer (The Blue Album) in 1994. The single was released on what would have been Buddy Holly's 58th birthday, had he not been killed in a plane crash along with fellow rock pioneers Ritchie Valens and The Big Bopper on February 3, 1959. The lyrics reference the song's 1950s namesake and actress Mary Tyler Moore. It reached #2 and #34 on the US Modern Rock Tracks chart and the US Mainstream Rock Tracks chart, respectively.", "published": "Mon, 28 Sep 2009 21:02:09 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Buddy Holly", "artist": {"url": "http://www.last.fm/music/Weezer", "mbid": "6fe07aa5-fec0-4eca-a456-f29bff451b04", "name": "Weezer"}, "url": "http://www.last.fm/music/Weezer/_/Buddy+Holly", "listeners": "822080", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/weezer", "name": "weezer"}]}, "mbid": "08b36638-05c6-4775-b210-b69ebd7d907d", "duration": "160000", "playcount": "4361001", "id": "26132"}}