{"track": {"album": {"@attr": {"position": "1"}, "title": "Icky Thump", "url": "http://www.last.fm/music/The+White+Stripes/Icky+Thump", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/43809009.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/43809009.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/43809009.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/43809009.png", "size": "extralarge"}], "artist": "The White Stripes", "mbid": "778a38ca-91ff-4f4e-91c1-b6c641033758"}, "wiki": {"content": "&quot;Icky Thump&quot; is a Grammy Award-winning song recorded by the American alternative rock band The White Stripes. Written by Jack White, it is the first single released from Icky Thump.\n \n The name of the track comes from the Northern England exclamation &quot;Ecky Thump,&quot; roughly meaning &quot;what the heck?&quot; The title was then changed to &quot;Icky&quot; so that &quot;teenagers would understand it better back in America,&quot; in the same way Led Zeppelin took out the &quot;a&quot; so Americans wouldn't call them 'Lead Zeppelin' (pronounced 'leed')&quot; . The phrase was popularized in an episode of The Goodies.\n \n Though grounded to a greater degree than the Get Behind Me Satan singles in straightforward garage rock, the song differed radically from previous White Stripes singles in its unusual construction: angular tempo-changes, stream-of-consciousness lyrics, and chaotic improvised snake-charming solos, played on a Univox synthesizer.\n \n The song deals with the topic of immigration [7]. The song itself seems to criticize the current immigration policy, something seen also in the video. It is thus the first political White Stripes track since &quot;The Big Three Killed My Baby,&quot; off The White Stripes.\n \n The lyrics talk about someone (perhaps Jack White himself) taking a trip to Mexico in a wagon, easily crossing the border to Mexico, as opposed to the difficulties Mexican immigrants face while illegally crossing northwards. It then mentions a Mexican lady giving him a bed to sleep in, then tying him up and holding him hostage. When finally able to escape, White decides to start doing his own house chores (referring, most likely, to the hiring of illegal immigrants as very low paid house servants). In the video, when White escapes the lady's house and crosses back to the USA, he passes by Mexican workers building a wall, likely the so-called Great Wall of Mexico.\n \n The defining verse against immigration policies comes near the end of the song:\n \n White Americans What? Nothin' better to do? Why don't you kick yourself out? You're an immigrant too.\n \n Who's using who? What should we do? Well you can't be a pimp And a prostitute too.\n \n The song also ended the 15-week run of &quot;What I've Done&quot; by Linkin Park at the top of the Modern Rock Tracks chart. It is the second song by the White Stripes to top the chart, after &quot;Seven Nation Army.&quot; The song is sandwiched between the 15 week run at number 1 of &quot;What I've Done and &quot;The Pretender&quot; by Foo Fighters 18 week run, separated by only the 1 week appearance of &quot;Paralyzer&quot; by Finger Eleven.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Icky Thump&quot; is a Grammy Award-winning song recorded by the American alternative rock band The White Stripes. Written by Jack White, it is the first single released from Icky Thump.  The name of the track comes from the Northern England exclamation &quot;Ecky Thump,&quot; roughly meaning &quot;what the heck?&quot; The title was then changed to &quot;Icky&quot; so that &quot;teenagers would understand it better back in America,&quot; in the same way Led Zeppelin took out the &quot;a&quot; so Americans wouldn't call them 'Lead Zeppelin' (pronounced 'leed')&quot; . The phrase was popularized in an episode of The Goodies. ", "published": "Wed, 23 May 2012 09:56:33 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Icky Thump", "artist": {"url": "http://www.last.fm/music/The+White+Stripes", "mbid": "11ae9fbb-f3d7-4a47-936f-4c0a04d3b3b5", "name": "The White Stripes"}, "url": "http://www.last.fm/music/The+White+Stripes/_/Icky+Thump", "listeners": "610103", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}, {"url": "http://www.last.fm/tag/cimx-fm", "name": "cimx-fm"}]}, "mbid": "08fdd1c9-fae7-45ab-8a72-8e4d1f0e639c", "duration": "226000", "playcount": "3175379", "id": "96355455"}}