{"track": {"album": {"@attr": {"position": "1"}, "title": "By the Way", "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/By+the+Way", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/85872471.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/85872471.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/85872471.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/85872471.png", "size": "extralarge"}], "artist": "Red Hot Chili Peppers", "mbid": "3f66063a-e91b-4025-9582-1adb1695123b"}, "wiki": {"content": "&quot;By the Way&quot; is the title track on the eighth studio album by the Red Hot Chili Peppers. It was released as the album's foremost single and eventually a music video was made as an accompaniment. The song was the band's sixth #1 hit on the Modern Rock Tracks chart, staying at the summit for 14 weeks, tying it with &quot;Dani California&quot; as the band's second longest stay at the top, behind only &quot;Scar Tissue&quot;, which was at the top for 16 weeks. It also spent 7 weeks at #1 on the Mainstream Rock Tracks chart, their fourth song to top this chart.\n \n The track is a popular and energetic number when played in concert. It is always included in live acts, even during circumstances in which only a small number of songs are played (such as special performances).\n \n The frenetic video was directed by Jonathan Dayton and Valerie Faris, a couple who has collaborated with the band to create music videos on numerous other occasions. It is not a visual verbatim demonstration of the lyrical denotations, but rather a story all its own.\n \n The video starts off with Anthony calling for a taxi. He gets in the taxi and a cabbie (played by Dave Sheridan) realizes he has Anthony as his passenger and puts a copy of the &quot;By the Way&quot; single into the CD player to please him, making Anthony smile mildly. Suddenly, the cabbie begins to be out of control as he lip-synchs the song loud and clear and begins to accelerate the taxi faster and faster and drive rambunctiously throughout the streets of L.A. after locking the car door, which makes Anthony uncomfortable and apprehensive. Anthony attempts to call on his cell phone, but the cabbie brakes so hard Anthony loses grip of his cell phone and the cabbie snatches it and throws it out of the window. The cabbie drives Anthony even more crazy as he drives the car in a cloud of dust and backs up under a bridge. Fans might think that it is the bridge that Anthony talked about in the song, &quot;Under the Bridge&quot;. While under the bridge, the cabbie pulls out flare sticks and begins to torture him through awkward dancing while Anthony finally pages Flea and John, who are having lunch in a cafe, which says &quot;Help! I've been kidnapped.&quot; At first John and Flea thinks it a hoax so they ignore the first message, then when Anthony pages them for the second time, Flea and John set out on Flea's Ford Bronco to find Anthony once again with the crazy cabbie in the taxi and begin a wild chase and even having some road rage. Anthony soon sees them, and breaks out of the taxi window and jumps in Flea's truck with a sigh of relief as the Chilis drive on another road to escape the cabbie. At the end of the video, we see Chad flag down the taxi, the cabbie realizes that he is a also member of the Chilis, so he lets Chad in and drives off the window that was broken was not shown intact with him.\n \n     * If you look closely, you can see the word &quot;Jammin'!&quot; on the cabbie's shirt.\n     * Rumours exist that the bridge that Anthony gets driven under is the one he sang about in the song, &quot;Under the Bridge&quot; where he struggled with drugs and almost ended his life.\n     * The book that Anthony holds in his hand at the beginning is Lexicon Devil which is a biography of his earlier influence, The Germs.\n \n \n “ \tIt’s kidnapping… A cab driver kidnaps me and just goes haywire through the town; he’s a fan, but he’s kind of a (pause) obsessive, compulsive, psychologically misarranged fan, and he sees me and starts enjoying himself a little too much and my friends have to come and rescue me. \t”\n \n Anthony Kiedis – The Making of: By the Way; Greatest Hits.\n \n The fast and often jerky camera angles used in the high speed chase sequences are based on the 2000 Mexican film Amores Perros in which all the characters are linked by a car crash at the beginning of the film; before the crash is an almost identical high speed car chase sequence.\n \n Contrary to the music video, the song's lyrics tell an ambiguous story of a girl named Dani. The story had been gradually developing throughout a 7 year time period, starting with &quot;Californication&quot;, in which the lyrics refer to an unnamed &quot;Teenage bride with a baby inside&quot;. This story was continued in &quot;By the Way&quot;, and concluded in &quot;Dani California&quot;.\n \n An electro house remix of &quot;By the Way&quot; by Rene Amesz and Peter Gelderblom was released on 5 July 2007, and became a popular track in clubs worldwide. The remix is also known as &quot;Waiting 4&quot;, which is a prominently featured lyric. It reached #29 for one week in late November/early December 2007 in the United Kingdom. It is included on the UK edition of Now 68 and Wild Weekends 04 (2007).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;By the Way&quot; is the title track on the eighth studio album by the Red Hot Chili Peppers. It was released as the album's foremost single and eventually a music video was made as an accompaniment. The song was the band's sixth #1 hit on the Modern Rock Tracks chart, staying at the summit for 14 weeks, tying it with &quot;Dani California&quot; as the band's second longest stay at the top, behind only &quot;Scar Tissue&quot;, which was at the top for 16 weeks. It also spent 7 weeks at #1 on the Mainstream Rock Tracks chart, their fourth song to top this chart. ", "published": "Wed, 20 Jan 2010 20:27:33 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "By the Way", "artist": {"url": "http://www.last.fm/music/Red+Hot+Chili+Peppers", "mbid": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "name": "Red Hot Chili Peppers"}, "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/_/By+the+Way", "listeners": "988924", "comments": ["Seeing this live last night made my year.", "I don't know about you but I'm standing in line to see the show tonight... waiting for A NEW ALBUM... just saying.", "does the start of this dong sounds anything like any other new song?", "The beauty of this song is timeless [2]", "will ferrell on the drums [2]", "possabily the greatest album of all time", "will ferrell on the drums", "Great song.", "ahhhh vocal harmonies are mind balm, so great.", "\"Ooh! Ah! Kiss a little monkey! Ohh Ah! Kiss a little monkeh!\"", "CLASSIC intro to a seminal album.", "Bass of the gods and a spellbinding guitar attack that slays armies with its sweet simplicity.", "<333333", "BY THE WAY <3", "amo esta cancion desde el inicio hasta el final", "Can't believe this is the first time LastFM has played me the chilli peppers", "luv this tune.................", "good song!!!!", "will ferrells rock group", "The beauty of this song is timeless"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/red%20hot%20chili%20peppers", "name": "red hot chili peppers"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}]}, "mbid": "0986ca4b-bc47-46f0-9b69-9ed26636f432", "duration": "216000", "playcount": "6665368", "id": "24817"}}