{"track": {"album": {"@attr": {"position": "7"}, "title": "Rage Against the Machine", "url": "http://www.last.fm/music/Rage+Against+the+Machine/Rage+Against+the+Machine", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/56688071.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/56688071.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/56688071.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/56688071.png", "size": "extralarge"}], "artist": "Rage Against the Machine", "mbid": "10cf6ada-ef3f-3cd3-9a7b-bdc15db2dddf"}, "wiki": {"content": "&quot;Wake Up&quot; is a song by American rap metal band Rage Against the Machine. It is the seventh track from their self-titled debut album. While never released as a single, it remains a staple of their live shows and is usually played as the last song before the encore.\n \n The opening riff of the song is reminiscent of the opening chords of the Led Zeppelin song &quot;Kashmir&quot;.\n \n The lyrics discuss racism within the American government and the counter-intelligence programs of the FBI; a spoken portion of the song is taken from an actual FBI memo in which J. Edgar Hoover suggests targets for the suppression of the black nationalist movement. The song also makes references to prominent black figures targeted by the government such as Malcolm X and Martin Luther King Jr., and goes as far as saying that the government arranged their assassinations.\n \n The song was also used in the closing credits of the Matrix movie franchise.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Wake Up&quot; is a song by American rap metal band Rage Against the Machine. It is the seventh track from their self-titled debut album. While never released as a single, it remains a staple of their live shows and is usually played as the last song before the encore.  The opening riff of the song is reminiscent of the opening chords of the Led Zeppelin song &quot;Kashmir&quot;.  The lyrics discuss racism within the American government and the counter-intelligence programs of the FBI; a spoken portion of the song is taken from an actual FBI memo in which J.", "published": "Fri, 23 Apr 2010 14:56:57 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Wake Up", "artist": {"url": "http://www.last.fm/music/Rage+Against+the+Machine", "mbid": "3798b104-01cb-484c-a3b0-56adc6399b80", "name": "Rage Against the Machine"}, "url": "http://www.last.fm/music/Rage+Against+the+Machine/_/Wake+Up", "listeners": "621379", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/political", "name": "political"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/metal", "name": "metal"}]}, "mbid": "0a51b3aa-30e1-48f5-a29a-0ae8b66e213d", "duration": "364000", "playcount": "2863952", "id": "10024"}}