{"track": {"album": {"@attr": {"position": "2"}, "title": "Rage Against the Machine", "url": "http://www.last.fm/music/Rage+Against+the+Machine/Rage+Against+the+Machine", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/56688071.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/56688071.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/56688071.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/56688071.png", "size": "extralarge"}], "artist": "Rage Against the Machine", "mbid": "10cf6ada-ef3f-3cd3-9a7b-bdc15db2dddf"}, "wiki": {"content": "&quot;Killing in the Name&quot; was the first single released by <a href=\"http://www.last.fm/tag/rap%20metal\" class=\"bbcode_tag\" rel=\"tag\">rap metal</a> band Rage Against the Machine from their self-titled album, and is arguably the band's signature song. On 31 August 1999, it was reissued together with one previously unreleased track, &quot;Darkness of Greed&quot; the track &quot;Clear the Lane&quot; originally released on a white only pressing at the time of first release on the b-side to 'killing in the name'. The album's cover pictured Thích Quảng Đức, a Vietnamese Buddhist monk, burning himself to death in Saigon in 1963 in protest of the murder of Buddhists by Prime Minister Ngô Đình Diệm's regime.\n \n <strong>Live performances</strong>\n \n Zack de la Rocha sometimes changes the lyrics in the second verse from &quot;Some of those that work forces are the same that burn crosses&quot; to &quot;Some of those that burn crosses are the same that hold office&quot; when playing live. It is also sometimes changed to &quot;Some of those that work forces are the same that burn churches&quot;.\n \n <strong>Critical reception</strong>\n \n &quot;Killing in the Name&quot; was placed at number 89 on &quot;100 Greatest Guitar Solos&quot;, a poll made by Guitar World. Q magazine placed &quot;Killing in the Name&quot; at number 24 in its list of the 100 Greatest Guitar Tracks and at number 99 in its list of the 100 greatest songs ever.\n \n The song earned its notoriety in the United Kingdom when its BBC Radio 1 DJ, Bruno Brookes, played the uncensored version of the song on his Top 40 countdown, leading to 138 complaints. This moment of infamy has since been consistently referenced by numerous British rock media.\n \n <strong>Other appearances</strong>\n \n The band Audioslave, which incorporated all but one member of Rage Against the Machine, played the song at multiple shows.&quot;Killing in the Name&quot; is featured on fictional alternative rock station Radio X, in the video game Grand Theft Auto: San Andreas and is used as a bumper song on The Jim Rome Show.\n \n A note-for-note cover version of &quot;Killing in the Name&quot; is a playable song in the Guitar Hero II video game for PlayStation 2 and Xbox 360, as a part of the main song list. It is found in the fifth song tier, Return of the Shred, in the PS2 version and in the sixth tier, Relentless Riffs, in the Xbox 360 version. However the song's lyrics are altered to remove the expletives, replacing the sentence repeated over 15 times &quot;Fuck you, I won't do what you tell me!&quot; with &quot;You're under control, I won't do what you tell me!, and the word &quot;Motherfucker!&quot; near the end is replaced with &quot;Under control!&quot;.\n \n La Maison Tellier made an acoustic cover of &quot;Killing in the Name&quot; that possessed a distinctive folk sound.\n \n In July 2007 a remix of this song by SebastiAn (miscredited as a Mr. Oizo remix) was Zane Lowe's &quot;Hottest Record in the World&quot; on his show on BBC Radio 1. Comedian Bill Hicks played the song at the end of his shows toward the end of his life.\n \n The song was featured in the movie Step Up 2 during the final dance scene.\n \n The Apples, a funk band from Tel Aviv, Israel released a cover on a 7&quot; vinyl on Freestyle Records.\n \n In 2004, radio and television commentator Glenn Beck used instrumental sections of the song as an open for his radio show.\n \n In early December 2009, members of the social networking site Facebook launched a group encouraging people to buy the song in the week running up to Christmas in order to prevent the winner of the The X Factor (UK) TV show from achieving the coveted Christmas number one slot in the UK Singles Chart. 954,863 members (as of the 20th December 2009) have joined the group. They won, and also donated over £65,000 to UK charity Shelter. The week also set a record for download sales in a single week as it reached the top spot on downloads alone. No hard copies of the single were released.\n \n <strong>Music video</strong>\n \n The video was released in 1993. This clip was filmed entirely in a small venue. The uncensored version of the video clip was banned on MTV for such a long period of time that the video's existence was in doubt until its release on the self-titled video.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Killing in the Name&quot; was the first single released by <a href=\"http://www.last.fm/tag/rap%20metal\" class=\"bbcode_tag\" rel=\"tag\">rap metal</a> band Rage Against the Machine from their self-titled album, and is arguably the band's signature song. On 31 August 1999, it was reissued together with one previously unreleased track, &quot;Darkness of Greed&quot; the track &quot;Clear the Lane&quot; originally released on a white only pressing at the time of first release on the b-side to 'killing in the name'.", "published": "Mon, 20 Aug 2012 08:06:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Killing in the Name", "artist": {"url": "http://www.last.fm/music/Rage+Against+the+Machine", "mbid": "3798b104-01cb-484c-a3b0-56adc6399b80", "name": "Rage Against the Machine"}, "url": "http://www.last.fm/music/Rage+Against+the+Machine/_/Killing+in+the+Name", "listeners": "1012526", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/metal", "name": "metal"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/political", "name": "political"}]}, "mbid": "0aceb2f2-473d-4d9e-8c09-adc917e15542", "duration": "313000", "playcount": "6172875", "id": "10019"}}