{"track": {"album": {"@attr": {"position": "1"}, "title": "Crush", "url": "http://www.last.fm/music/Bon+Jovi/Crush", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/85817999.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/85817999.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/85817999.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/85817999.png", "size": "extralarge"}], "artist": "Bon Jovi", "mbid": "755f2186-1828-3c4e-8221-5617e6ce2284"}, "wiki": {"content": "&quot;It's My Life&quot; is Bon Jovi's first single from the album Crush. It was released on May 23, 2000. It was written by Jon Bon Jovi, Richie Sambora and Max Martin.\n \n &quot;It's My Life&quot; became one of the most successful Bon Jovi singles, hitting #1 across many countries (however, it only reached #33 in the band's native US) and most importantly, becoming a symbol of the band's longevity as they prevailed through many different changes in the mainstream rock scene with admirable success. It was credited with reviving their career after they came off a five year break, during which they each pursued individual solo careers. It was also credited with introducing the veteran band to an entirely new, younger audience.\n \n Paul Anka covers Bon Jovi's &quot;It's My Life&quot; on his 2005 album, &quot;Rock Swings.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;It's My Life&quot; is Bon Jovi's first single from the album Crush. It was released on May 23, 2000. It was written by Jon Bon Jovi, Richie Sambora and Max Martin.  &quot;It's My Life&quot; became one of the most successful Bon Jovi singles, hitting #1 across many countries (however, it only reached #33 in the band's native US) and most importantly, becoming a symbol of the band's longevity as they prevailed through many different changes in the mainstream rock scene with admirable success.", "published": "Mon, 2 Sep 2013 15:29:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "It's My Life", "artist": {"url": "http://www.last.fm/music/Bon+Jovi", "mbid": "5dcdb5eb-cb72-4e6e-9e63-b7bace604965", "name": "Bon Jovi"}, "url": "http://www.last.fm/music/Bon+Jovi/_/It%27s+My+Life", "listeners": "491030", "comments": ["This song was one of my ultimate childhood songs. THE ultimate childhood song for me, possibly.", "It's my music!:D", "Thanks Anna :-) for the song :-)", "Cool sound!", "Great song.", "One of the strongest songs released.", "it is the song where i came from to love bon jovi music and the artist. it all started there for me ! \r\nvery energizing song !", "♥", "Cool song from America's sweetheart of hard rock!!!!", "Perfect song", "why normal version wont even scrobble?!", "PLEASE DON'T READ THIS. I have nothing to say", "i actually like the ballad version with with that dude from the all-american rejects.....http://www.youtube.com/watch?v=3QbFHZTmwUE", "Great song", "I wish I could ban this stupid fucking ballad version.", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK", "their best", "I don't like the ballad.", "seh, sehr ,sehr ....gut!!! Bin begeistert !!!", "เป็นชีวิตของฉัน"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/bon%20jovi", "name": "bon jovi"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}]}, "mbid": "0b02e526-603a-442a-80aa-21a80e541cf3", "duration": "223000", "playcount": "3018785", "id": "1024798"}}