{"track": {"album": {"@attr": {"position": "1"}, "title": "Highway to Hell", "url": "http://www.last.fm/music/AC%2FDC/Highway+to+Hell", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91070889.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91070889.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91070889.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91070889.png", "size": "extralarge"}], "artist": "AC/DC", "mbid": "022beb6f-9d5f-4a2c-9e48-2d93c7df4c1d"}, "wiki": {"content": "&quot;Highway to Hell&quot; is a song by the hard rock band AC/DC. It is the opening track of the group's 1979 album Highway to Hell and the twelfth track on AC/DC Live.\n \n The song was written by Bon Scott, Angus Young and Malcolm Young while the main guitar riff was created by Malcolm Young. The track has become one of the most famous songs in rock history. AC/DC had made several studio albums before and was constantly supporting them by going on a grueling tour schedule.\n \n The song and album's title supposedly came after a reporter asked bandmembers if they could describe what life was like being constantly on tour. Angus replied that it was &quot;a fucking highway to Hell&quot;[citation needed], and the name stuck. He stated in the magazine &quot;Guitar World&quot; that when you are out on the road on a bus sleeping with a guy's smelly sock in your face, it's like you're on the highway to hell. Rumours persisted that the band members were satanists, and this comment, and the album cover depicting Angus with devil horns and tail only added fuel to the fire. (The band has denied having anything to do with Satanism, Malcolm having even commented that &quot;me mum would kill me for that!&quot;) Nevertheless, this and other songs brought AC/DC its first million-copy-selling album, and sent Highway to Hell to #17 on the charts. Scott would be found dead in the back of a friend's car just over six months later. The success of the Highway to Hell song and album set AC/DC on track to record its most famous album and tribute to Bon, Back In Black, one year later. The song &quot;Highway to Hell&quot; is part of the The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll list.[1] The single was certified Gold by the RIAA for sales in excess of 500,000.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Highway to Hell&quot; is a song by the hard rock band AC/DC. It is the opening track of the group's 1979 album Highway to Hell and the twelfth track on AC/DC Live.  The song was written by Bon Scott, Angus Young and Malcolm Young while the main guitar riff was created by Malcolm Young. The track has become one of the most famous songs in rock history. AC/DC had made several studio albums before and was constantly supporting them by going on a grueling tour schedule.  ", "published": "Tue, 2 Dec 2008 10:52:17 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Highway To Hell", "artist": {"url": "http://www.last.fm/music/AC%2FDC", "mbid": "66c662b6-6e2f-4930-8610-912e24c63ed1", "name": "AC/DC"}, "url": "http://www.last.fm/music/AC%2FDC/_/Highway+To+Hell", "listeners": "771094", "toptags": {"tag": [{"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/heavy%20metal", "name": "heavy metal"}, {"url": "http://www.last.fm/tag/acdc", "name": "acdc"}]}, "mbid": "0bae6a0b-34e2-4f73-a99a-fd082f6ea72d", "duration": "208000", "playcount": "5720763", "id": "1085428"}}