{"track": {"album": {"@attr": {"position": "3"}, "title": "August And Everything After", "url": "http://www.last.fm/music/Counting+Crows/August+And+Everything+After", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/86799045.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/86799045.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/86799045.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/86799045.png", "size": "extralarge"}], "artist": "Counting Crows", "mbid": "a9954f98-0eca-4266-838f-a715818b665a"}, "wiki": {"content": "&quot;Mr. Jones&quot; is a song by American  alternative rock band Counting Crows. It is the lead single and third track from their debut album, August and Everything After (1993). It was the band's first radio hit and remains one of their most popular singles.\n \n \n Overview\n \n &quot;Mr. Jones&quot; entered the American Top 40 on February 19, 1994, and entered the Top 10 five weeks later. On April 23, &quot;Mr. Jones&quot; passed R. Kelly's &quot;Bump n' Grind&quot;, taking the number-one position (which it surrendered, the following week, to Prince's &quot;The Most Beautiful Girl in the World&quot;).\n \n The band's surprise success happened to coincide with Kurt Cobain's death. These events took a significant toll on Adam Duritz, the lead vocalist and principal songwriter. Said Duritz in an interview: &quot;We heard that, that [Kurt] had shot himself. And it really scared the hell out of me because I thought, these things in my life are getting so out of control...&quot;. These events and feelings were the basis for &quot;Catapult&quot;, the first track of Recovering the Satellites.\n \n The primary topic of the song itself is perhaps how two struggling musicians (Duritz and bassist Marty Jones of The Himalayans) &quot;want to be big stars,&quot; believing that &quot;when everybody loves me, I will never be lonely&quot; Duritz would later recant these values, and in later concert appearances, &quot;Mr. Jones&quot; was played in a subdued acoustic style, if at all. Most directly referencing this, on the live CD Across a Wire Duritz changes the lyrics &quot;We all wanna be big, big stars, but we got different reasons for that&quot; to &quot;We all wanna be big, big stars, but then we get second thoughts about that,&quot; and &quot;when everybody loves you, sometimes that's just about as funky as you can be&quot; to &quot;when everybody loves you, sometimes that's just about as fucked up as you can be.&quot;\n \n The song is often interpreted differently. One popular belief is that &quot;Mr. Jones&quot; refers to Adam's penis, although Duritz has refuted this claim. Others believe it is a thinly veiled reference to the protagonist of Bob Dylan's &quot;Ballad of a Thin Man&quot;, a theory supported by the lyric &quot;I wanna be Bob Dylan, Mr. Jones wishes he was someone just a little more funky.&quot; Others have suggested that Mr. Jones refers to Marty Jones's father, although the lyric &quot;she dances while his father plays guitar&quot; seems to suggest Mr Jones' father is another separate character within the song. Another possibility is that Mr. Jones is an imaginary friend.\n \n When the Counting Crows performed the song during the Recovering the Satellites tour, it would often include the first verse from The Byrds' &quot;So You Want to Be a Rock and Roll Star?&quot; This version was often acoustic and was even performed on VH1's Storytellers.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Mr. Jones&quot; is a song by American  alternative rock band Counting Crows. It is the lead single and third track from their debut album, August and Everything After (1993). It was the band's first radio hit and remains one of their most popular singles.  \n Overview  &quot;Mr. Jones&quot; entered the American Top 40 on February 19, 1994, and entered the Top 10 five weeks later. On April 23, &quot;Mr. Jones&quot; passed R. Kelly's &quot;Bump n' Grind&quot;, taking the number-one position (which it surrendered, the following week, to Prince's &quot;The Most Beautiful Girl in the World&quot;). ", "published": "Tue, 23 Mar 2010 09:34:21 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Mr. Jones", "artist": {"url": "http://www.last.fm/music/Counting+Crows", "mbid": "a0327dc2-dc76-44d5-aec6-47cd2dff1469", "name": "Counting Crows"}, "url": "http://www.last.fm/music/Counting+Crows/_/Mr.+Jones", "listeners": "582382", "comments": ["I WANNA BE BOB DYLAN ;)", "☆☆☆☆☆", "I miss the 90s...", "subberheimer!", "before i used to think this guy is mental or something, but now i seem to enjoy his music.. sha la la uh yeah!", "20 years! Christ..", "gawd i miss the 90s... i dont think we realised how good we had it.", "Awesome, can't seem to get enough of this song. Makes me feel old to see how old this song is.", "This was always one of my favourite songs.  Then I married Mr Jones, and I still think it's great, but he doesn't like it.  haha!", "♥❤♥", "This song still stands up... almost 20 years after the debut. I saw them open for The Who. They played a crisp 40 minute set that sounded CD-quality... They kinda just came and then quickly got out of the way for the headliner...", "Just love Mr Jones", "Love the deep bass hits in the intro!  The rest is cool too :)", "who is this mr jones", "für mich ein Über-Hit", "~ ♪ ♡ ♫ ( ◕ ‿ ◕ ) ♫ ♡ ♪~", "who cannot move to to this, love it", "Energética.", "Love the song, video is hilarious!", "Good track"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}]}, "mbid": "0beb8db3-9487-4ecf-b64d-fcf850b2680a", "duration": "380000", "playcount": "2947462", "id": "1001306"}}