{"track": {"album": {"@attr": {"position": "2"}, "title": "Fallen", "url": "http://www.last.fm/music/Evanescence/Fallen", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/46370535.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/46370535.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/46370535.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/46370535.png", "size": "extralarge"}], "artist": "Evanescence", "mbid": "9cb25ce1-bc4f-40b4-bf8c-9f06e2162e8b"}, "wiki": {"content": "&quot;Bring Me to Life&quot; is a song by American <a href=\"http://www.last.fm/tag/rock\" class=\"bbcode_tag\" rel=\"tag\">rock</a> band <a href=\"http://www.last.fm/music/Evanescence\" class=\"bbcode_artist\">Evanescence</a>. It was released on April 22, 2003, as the first single from their debut studio album, <a title=\"Evanescence - Fallen\" href=\"http://www.last.fm/music/Evanescence/Fallen\" class=\"bbcode_album\">Fallen</a>, and as the lead single for the film Daredevil. It was written by Amy Lee and Ben Moody. It features guest vocals from Paul McCoy of <a href=\"http://www.last.fm/music/12+Stones\" class=\"bbcode_artist\">12 Stones</a>. It is the band's most successful single, and has peaked within the charts of more than 15 countries internationally, and won Best Hard Rock Performance at the 46th Grammy Awards.\n \n It was released on April 22, 2003, as the first single from their debut album, <a title=\"Evanescence - Fallen\" href=\"http://www.last.fm/music/Evanescence/Fallen\" class=\"bbcode_album\">Fallen</a>. The album's opening track, &quot;<a title=\"Evanescence &ndash; Going Under\" href=\"http://www.last.fm/music/Evanescence/_/Going+Under\" class=\"bbcode_track\">Going Under</a>&quot;, was initially planned to be the first single, however, the release of the Daredevil soundtrack impacted the decision to release it as the album's second single. The single includes &quot;Farther Away&quot; as a B-side and refers to it as the album version, however, the track order of Fallen was not finalized at the time of its release, and the track was eventually dropped from the album. The first pressing of the Australian single contained the track &quot;Missing&quot; as a B-side, but was mysteriously dropped from later pressings, and was eventually released as a bonus track on the band's first live album, <a title=\"Evanescence - Anywhere but Home\" href=\"http://www.last.fm/music/Evanescence/Anywhere+but+Home\" class=\"bbcode_album\">Anywhere but Home</a>.\n \n Earlier versions of &quot;Bring Me to Life&quot; were recorded and released as demos before Fallen's release, both containing a considerably different sound, featuring more industrial pieces of music and the absence of Paul McCoy's guest vocals. An acoustic version was recorded and released on the Bring Me To Life DVD. Several other versions of the track have been released, such as remixes, acoustic, and altered versions. The live version featured on the Anywhere But Home DVD contains a piano and vocal solo before the intro of the song, and features John LeCompt performing Paul McCoy's guest vocals.\n \n &quot;Bring Me To Life&quot; charted #73 on Billboard's 'Best of the 2000s Rock Songs' Chart, and is the only song by a female-led band to be on the chart.\n \n Lead vocalist, Amy Lee, has stated that the song has several meanings, the first being about an incident that took place at a restaurant. &quot;I was inspired to write it when someone said something to me — I didn’t know him, and I thought he might be clairvoyant,&quot; says Lee from a tour stop in Tulsa to The Boston Phoenix. &quot;I was in a relationship and I was completely unhappy. But I was hiding it. I was being completely abused and I was trying to cover it up; I wouldn’t even admit it to myself. So then I had spoken maybe 10 or 15 words to this guy, who was a friend of a friend. We were waiting for everyone else to show up, and we went into a restaurant and got a table. And he looked at me and said, ‘Are you happy?’ And I felt my heart leap, and I was like, he totally knows what I’m thinking. And I lied, I said I was fine. Anyway, he’s not really clairvoyant. But he is a sociology major.&quot; Lee stated the previous in a VH1 interview when asked about the meaning. &quot;Open-mindedness. It's about waking up to all the things you've been missing for so long. One day someone said something that made my heart race for a second and I realized that for months I'd been numb, just going through the motions of life.&quot;\n \n During an interview titled 'Amy Lee: Back In Black,' Lee claimed that she wrote &quot;Bring Me to Life&quot; about her long time friend, Josh Hartzler, whom she married on May 6, 2007.\n \n A music video for the song was directed by Philip Stolzl and filmed in January 2003.\n \n Lead vocalist Amy Lee is in a nightgown and barefooted, and asleep in a bed within a building, dreaming of falling through the air below a skyscraper. As the chorus begins, the band and Paul McCoy are performing in another room in the building as Lee awakens, making her way to the window. Lee climbs out of the window of her room and begins to scale and climb the building until she reaches the window of the room where the band is performing. During the bridge, McCoy notices Lee and opens the window, which accidentally causes her to lose her balance, and grabs the ledge for safety. Throughout the bridge and chorus, McCoy unsuccessfully attempts to reach for Lee, and she falls off the building. However, she is shown asleep within her bed again, as if the music video were a dream.\n \n &quot;Bring Me to Life&quot; has peaked within the top 10 of more than 15 countries worldwide, and within the top 20 of several other countries, thus making it the band's most successful single to date and considerably the reason behind the band's sudden success. It was certified Platinum status in 2003, selling more than 1 million copies in the United States. It managed to top the Billboard Alternative Songs chart and Pop 100 and remain on the charts for several more weeks, and peaked at #5 on the Billboard Hot 100. It also peaked at #4 on the Adult Pop Songs chart. The song initially peaked within the Christian rock charts as well, partially because of the lyrics being interpreted as a call for new life in Jesus Christ by several listeners. The song was internationally successful as well, topping the charts of Australia, Belgian, Italy and the United Kingdom, and peaking within the top 5 of Austria, Canada, France, Ireland, Germany, New Zealand, Norway, Netherlands and Sweden. It charted within the top 20 of every other countries of its release.\n \n <a href=\"http://www.last.fm/music/John+Tesh\" class=\"bbcode_artist\">John Tesh</a> released an instrumental version of the song on the 2007 album &quot;A Passionate Life&quot;. Welsh classical singer <a href=\"http://www.last.fm/music/Katherine+Jenkins\" class=\"bbcode_artist\">Katherine Jenkins</a> released a cover of the song on her album Believe.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Bring Me to Life&quot; is a song by American <a href=\"http://www.last.fm/tag/rock\" class=\"bbcode_tag\" rel=\"tag\">rock</a> band <a href=\"http://www.last.fm/music/Evanescence\" class=\"bbcode_artist\">Evanescence</a>. It was released on April 22, 2003, as the first single from their debut studio album, <a title=\"Evanescence - Fallen\" href=\"http://www.last.fm/music/Evanescence/Fallen\" class=\"bbcode_album\">Fallen</a>, and as the lead single for the film Daredevil. It was written by Amy Lee and Ben Moody. It features guest vocals from Paul McCoy of <a href=\"http://www.last.fm/music/12+Stones\" class=\"bbcode_artist\">12 Stones</a>. It is the band's most successful single, and has peaked within the charts of more than 15 countries internationally, and won Best Hard Rock Performance at the 46th Grammy Awards.  ", "published": "Fri, 31 Dec 2010 17:37:20 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Bring Me to Life", "artist": {"url": "http://www.last.fm/music/Evanescence", "mbid": "f4a31f0a-51dd-4fa7-986d-3095c40c5ed9", "name": "Evanescence"}, "url": "http://www.last.fm/music/Evanescence/_/Bring+Me+to+Life", "listeners": "908497", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/gothic%20rock", "name": "gothic rock"}, {"url": "http://www.last.fm/tag/evanescence", "name": "evanescence"}, {"url": "http://www.last.fm/tag/gothic", "name": "gothic"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "0bef462e-dff1-489f-982a-6ef2852bf65e", "duration": "237000", "playcount": "6763277", "id": "1030043"}}