{"track": {"album": {"@attr": {"position": "4"}, "title": "In Utero", "url": "http://www.last.fm/music/Nirvana/In+Utero", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/70240140.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/70240140.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/70240140.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/70240140.png", "size": "extralarge"}], "artist": "Nirvana", "mbid": "90d16827-b494-3d11-be94-3c736a4494ea"}, "wiki": {"content": "Rape Me is a song by the American grunge band Nirvana. The song was released as the second single from Nirvana's 1993 album In Utero, packaged as a double a-side along with &quot;All Apologies.&quot;\n \n &quot;Rape Me&quot; was written by Nirvana singer/guitarist Kurt Cobain in an apartment in Los Angeles, California in May 1991, around the time the band's second album, Nevermind (1991), was being mixed. It was first performed live on June 18, 1991, at the Catalyst in Santa Cruz, California, and subsequently played several times at Nirvana concerts during the next two years. These early live versions featured a dissonant, semi-improvised &quot;anti-solo&quot; after the second chorus, which was replaced by a bridge in the song's final incarnation.\n \n The band had wanted to debut it at the 1992 MTV Video Music Awards in Los Angeles on September 9, but MTV insisted on them playing &quot;Smells Like Teen Spirit&quot; instead. According to the Cobain biography Heavier Than Heaven, the network's reasoning was not so much due to the controversial usage of the word &quot;rape,&quot; but rather because they assumed Cobain was using the song to jab at the media (and MTV) for their abuse of his celebrity status. (Only weeks earlier, a Vanity Fair article depicting Cobain and his wife Courtney Love as unfit parents nearly resulted in the removal of their newborn child Frances Bean Cobain from their custody. MTV News was one of the media sources who reported this story.) Nirvana ultimately settled on playing their then-latest single &quot;Lithium.&quot; However, to show their disapproval of MTV's insistence, &quot;Lithium&quot; was preceded by the first 5 seconds of &quot;Rape Me.&quot; The opening chords and the song's title lyrics were sung twice, and MTV was seconds away from pulling their performance off the air and going to a commercial when the band abruptly stopped the song and went into the intro of &quot;Lithium.&quot;\n \n The song was first recorded in the studio by Jack Endino in October 1992 in Seattle, Washington.\n \n The studio version of &quot;Rape Me&quot; that appears on In Utero was recorded by Steve Albini in February 1993. In December of that year, it was released alongside &quot;All Apologies&quot; as the album's second single. A music video was considered but never made.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Rape Me is a song by the American grunge band Nirvana. The song was released as the second single from Nirvana's 1993 album In Utero, packaged as a double a-side along with &quot;All Apologies.&quot;  &quot;Rape Me&quot; was written by Nirvana singer/guitarist Kurt Cobain in an apartment in Los Angeles, California in May 1991, around the time the band's second album, Nevermind (1991), was being mixed. It was first performed live on June 18, 1991, at the Catalyst in Santa Cruz, California, and subsequently played several times at Nirvana concerts during the next two years.", "published": "Wed, 18 Mar 2009 17:42:46 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Rape Me", "artist": {"url": "http://www.last.fm/music/Nirvana", "mbid": "5b11f4ce-a62d-471e-81fc-a69a8278c7da", "name": "Nirvana"}, "url": "http://www.last.fm/music/Nirvana/_/Rape+Me", "listeners": "929201", "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nirvana", "name": "nirvana"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "0cbf2ed7-19c5-434b-a0a3-0436117cce4b", "duration": "170000", "playcount": "5829503", "id": "1004272"}}