{"track": {"album": {"@attr": {"position": "9"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Queen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92260671.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92260671.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92260671.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92260671.png", "size": "extralarge"}], "artist": "Queen", "mbid": "fcb78d0d-8067-4b93-ae58-1e4347e20216"}, "wiki": {"content": "Crazy Little Thing Called Love peaked at number two in the UK, it hit number one on the U.S. charts on February 23, 1980, remaining there for four consecutive weeks. It topped the charts in Australia for six weeks.\n \n The song is written in a rockabilly style. As reported by Mercury in Melody Maker, May 2, 1981, Mercury composed &quot;Crazy Little Thing Called Love&quot; on the guitar in just five to ten minutes. Other accounts say that he wrote it while lounging in a bubble bath in the Bayerischer Hof Hotel in Munich during one of Queen's extensive Munich recording sessions. He took it to the studio shortly after writing it and presented it to bandmates Roger Taylor and John Deacon. The three of them, with their new producer Mack, recorded it at Musicland Studios in Munich. The entire song was reportedly recorded in less than half an hour (although Mack says it was six hours)\n \n Freddie Mercury - May 1981,  Melody Maker:\n \n 'Crazy Little Thing Called Love' took me five or ten minutes. I did that on the guitar, which I can't play for nuts, and in one way it was quite a good thing because I was restricted, knowing only a few chords. It's a good discipline because I simply had to write within a small framework. I couldn't work through too many chords and because of that restriction I wrote a good song, I think.\n \n Brian May, 1982 On The Record:\n \n Interviewer: Did you use a Fender on &quot;Crazy Little Thing Called Love&quot;?\n \n Yes. I used on of Roger's really old, beat up, natural wood Telecaster. I got bludgeoned into playing it. That was Mack's idea. I said &quot;I don't want to play a Telecaster. It basically doesn't suit my style&quot;. But &quot;Crazy Little Thing Called Love&quot; was such a period piece, it seemed to need that period sound. So I said, &quot;Okay, Mack, if you want to set it up, I'll play it&quot;. He put it through a Mesa/Boggie, which is an amplifier I don't get on well with at all; it just doesn't suit me. I tried it, and it sounded okay. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Crazy Little Thing Called Love peaked at number two in the UK, it hit number one on the U.S. charts on February 23, 1980, remaining there for four consecutive weeks. It topped the charts in Australia for six weeks.  The song is written in a rockabilly style. As reported by Mercury in Melody Maker, May 2, 1981, Mercury composed &quot;Crazy Little Thing Called Love&quot; on the guitar in just five to ten minutes.", "published": "Sat, 25 Jul 2009 02:13:17 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Crazy Little Thing Called Love", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Crazy+Little+Thing+Called+Love", "listeners": "637271", "comments": ["Yup - good, thanks David.", "Always thought that it's by Elvis, when I realized, it blew me somewhat away.", "I'm never in a mood NOT to listen to this [9]", "This really feel like Elvis but ofc it's queen and that makes it more awesome.", "i like the \"guitar solo coming\" feeling in this song :D [2]", "I'm never in a mood NOT to listen to this [8]", "Nice!", "a minha preferida", "Must... Resist... Dammit I must dance!", "I can't keep still to this.", "READY FREDDIE! <3", "The Theme from Match.com.", "READY FREDDIE", "Eu adoro o cover do Maroon 5 também..", "i like the \"guitar solo coming\"  feeling in this song :D", "I always thought it was elvis. xD", "im obsessed with queen and my parents are like play something else but i just turn it up!!!!!", "people actually thought this was an elvis song hahaha wtf. sounds nothing like elvis! except maybe the \"crazy little thing called love\" bit. hahaha", "All this time I thought it was an Elvis song. It's a fitting tribute. [2] just genious!", "I love this song :)"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}]}, "mbid": "0d8c4ba9-5f64-455a-8c06-3d3e793aa853", "duration": "163000", "playcount": "3254972", "id": "12199"}}