{"track": {"album": {"@attr": {"position": "1"}, "title": "Gold", "url": "http://www.last.fm/music/R.E.M./Gold", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/70123662.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/70123662.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/70123662.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/70123662.png", "size": "extralarge"}], "artist": "R.E.M.", "mbid": "26965218-f7c5-4fa9-81f1-0dc08b1bdf56"}, "wiki": {"content": "&quot;Shiny Happy People&quot; is a song by the band R.E.M..\n  The song appeared on their 1991 album Out of Time and was released as a single in the same year. The song features guest vocals by Kate Pierson of the B-52's, who also has a prominent role in the song's music video.\n It peaked at #10 on the Billboard Hot 100, the fourth and, to date, last R.E.M. single to reach the top 10 on the chart. It also peaked at #6 on the UK Singles Chart, becoming the first R.E.M. song to reach the top ten in the UK and the only one to reach the top ten in both countries.\n It was recorded during the autumn of 1990, and was first released as a single in May 1991 in the U.K. However, the single would not go on sale in the U.S.A. until four months later.\n \n In 2005, Q magazine included the song in a list of &quot;Ten Terrible Records by Great Artists&quot;. In its 2006 &quot;Song of the Summer&quot; countdown, CBC Radio's Freestyle named &quot;Shiny Happy People&quot; 1991's &quot;Song of the Summer&quot;.In contrast, in 2006, the song received the number one position on AOL Music's list of the &quot;111 Wussiest Songs of All Time&quot;. Blender magazine also ranked the song at #35 on its list of the &quot;50 Worst Songs Ever&quot;. Also, when talking about the ill-fated song in 1995 on Space Ghost Coast to Coast Stipe simply stated &quot;I hate that song, Space Ghost.&quot; Due to the band's dislike of the song, it was one of their few Warner-released singles not included on their 2003 greatest hits album In Time. However, it was later included on their 2011 greatest hits album Part Lies, Part Heart, Part Truth, Part Garbage 1982–2011.\n \n The band performed it on Sesame Street under the title &quot;Furry Happy Monsters&quot;. The female vocal was performed by Stephanie D'Abruzzo of Avenue Q fame. An adaptation was written by Sesame Street writer Christopher Cerf, changing many of the lyrics to fit the context of the scene. Alvin and the Chipmunks recorded a cover of the song as a playable track for their 2007 video game. The song has also been covered by the Royal Philharmonic Orchestra, but without the lyrics. A cover version of the song is featured on the 2004 video game Donkey Konga 2. The Fatima Mansions recorded a scabrous song of the same title which used the main title line in its chorus on their EPs Bertie's Brochures and Tima Mansió Dumps the Dead. While the music and verse lyrics were totally changed, R.E.M.'s members are still credited as the authors. &quot;Shiny Happy People&quot; is one of several anachronistic songs that appear in the 2013 video game BioShock Infinite, which is set in 1912. This version of the song is performed as a big band piece by Tony Babino and various musicians.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Shiny Happy People&quot; is a song by the band R.E.M..\n  The song appeared on their 1991 album Out of Time and was released as a single in the same year. The song features guest vocals by Kate Pierson of the B-52's, who also has a prominent role in the song's music video.\n It peaked at #10 on the Billboard Hot 100, the fourth and, to date, last R.E.M. single to reach the top 10 on the chart. It also peaked at #6 on the UK Singles Chart, becoming the first R.E.M. song to reach the top ten in the UK and the only one to reach the top ten in both countries.\n ", "published": "Fri, 5 Apr 2013 14:44:23 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Shiny Happy People", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Shiny+Happy+People", "listeners": "379438", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/happy", "name": "happy"}]}, "mbid": "0dce11cd-d10a-4efa-8fec-f5b5645be38a", "duration": "224000", "playcount": "1508039", "id": "3076023"}}