{"track": {"album": {"@attr": {"position": "8"}, "title": "Led Zeppelin IV", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin+IV", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78946605.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78946605.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78946605.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78946605.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "103a462d-a9f2-4f05-9490-3d8fe506c8a6"}, "wiki": {"content": "&quot;When the Levee Breaks&quot; is a blues song written and first recorded by husband and wife Kansas Joe McCoy and Memphis Minnie in 1929. The song is in reaction to the upheaval caused by the Great Mississippi Flood of 1927. According to the <a href=\"http://www.songfacts.com/detail.php?id=335\" rel=\"nofollow\">When The Levee Breaks Songfacts</a>, African-American plantation workers were forced to work on the levee at gunpoint, piling sandbags to save the neighboring towns. Hence the lyrics, &quot;I works on the levee, mama both night and day, I works so hard, to keep the water away.&quot; \n \n Led Zeppelin's version\n “When the Levee Breaks” \n  \n Album Led Zeppelin IV \n Released November 8, 1971 \n Recorded December 1970 – March 1971  \n Length 7:08 \n Label Atlantic \n Writer Page/Plant/Jones/Bonham/Memphis Minnie \n Producer Jimmy Page \n  \n Robert Plant of Led Zeppelin had the original McCoy and Minnie recording in his personal collection. He removed and rearranged lines and line parts from the original song and added new lyrical parts (again, the lyrics focused on the Great Mississippi Flood of 1927), and combined it with a revamped melody. Recording for the song took place in December 1970 at Headley Grange, where the band used the Rolling Stones Mobile Studio. It had already been tried unsuccessfully by the band at Island Studios at the beginning of the recording sessions for their fourth album.[\n \n The Led Zeppelin version features a distinctive pounding drum beat by John Bonham recorded in a three-story stairwell, driving guitars and a wailing harmonica, all presumably meant to symbolize the relentless storm that threatens to break the levee, backing a powerful vocal performance by Robert Plant. The vocals were processed differently on each verse, sometimes with phasing added.\n \n According to Page, the song's structure &quot;was a riff that I'd been working on, but Bonzo's drum sound really makes a difference on that point.&quot; The famous drum performance was recorded by engineer Andy Johns by placing Bonham and a new drumkit at the bottom of a stairwell at Headley Grange, and recording it using two Beyerdynamic M160 microphones at the top, giving the distinctive resonant but slightly muffled sound. Back in the Rolling Stones' mobile studio, Johns compressed the drum sound through two channels and added echo through guitarist Jimmy Page's Binson echo unit The performance was made on a brand new drum kit that had only just been delivered from the factory. The drum break has long been popular in hip hop and dance music circles for its &quot;heavy&quot; sound, and has been sampled for many tracks. At one time the remaining band members took legal action against Beastie Boys for their use of this drum sample on &quot;Rhymin &amp; Stealin&quot; from Licensed to Ill.\n \n Page recorded Plant's harmonica part using the backward echo technique, putting the echo ahead of the sound when mixing, creating a distinct effect.\n \n The song was recorded at a different tempo, then slowed down. Plant then sang in the sort-of-in-between key the song was now in (approximately F minor), which explains its sort of flat and sludgy sound, particularly on the harmonica and guitar solos. Because this song was heavily produced in the studio, it was difficult to recreate live. The band only played this song a few times in the early stages of their 1975 U.S. Tour.\n \n This song was the only one on the album that was not remixed after a supposedly disastrous mixing job in the US (the rest of the tracks were mixed again in England). The original mixing done on this song was kept in its original form.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;When the Levee Breaks&quot; is a blues song written and first recorded by husband and wife Kansas Joe McCoy and Memphis Minnie in 1929. The song is in reaction to the upheaval caused by the Great Mississippi Flood of 1927. According to the <a href=\"http://www.songfacts.com/detail.php?id=335\" rel=\"nofollow\">When The Levee Breaks Songfacts</a>, African-American plantation workers were forced to work on the levee at gunpoint, piling sandbags to save the neighboring towns. Hence the lyrics, &quot;I works on the levee, mama both night and day, I works so hard, to keep the water away.&quot;  ", "published": "Fri, 17 Sep 2010 19:02:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "When the Levee Breaks", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/When+the+Levee+Breaks", "listeners": "474439", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/led%20zeppelin", "name": "led zeppelin"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}]}, "mbid": "0ea5fda2-45c5-4b80-b1c8-f3c1713ceae7", "duration": "428000", "playcount": "2650657", "id": "12731"}}