{"track": {"album": {"@attr": {"position": "2"}, "title": "Brand New Eyes", "url": "http://www.last.fm/music/Paramore/Brand+New+Eyes", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/54101471.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/54101471.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/54101471.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/54101471.png", "size": "extralarge"}], "artist": "Paramore", "mbid": "5da86c2c-716c-32fc-9396-e12befb9a3f1"}, "wiki": {"content": "&quot;Ignorance&quot; is a song by the American pop rock band Paramore. &quot;Ignorance&quot; was released by Fueled by Ramen in July 2009, as the lead single from the bands 2009 studio album entitled, Brand New Eyes. The song was written by Paramore band members Hayley Williams and Josh Farro; Paramore is also credited as being co-producers to the song. The song, recorded in Spring 2009, was the first song to be written for Brand New Eyes.\n \n Musically, &quot;Ignorance&quot; is credited as being an alternative rock pop song. Williams' and Farros's inspiration for writing the song was from personal experiences. &quot;Ignorance&quot; was generally well received by contemporary music critics. The song was commercially successful, charting within the top thirty in multiple territories, although the song charted better internationally. A music video for &quot;Ignorance&quot; was released in August 2009. In the video, the band is shown singing in a room with the only source of lighting being a hanging lightbulb.\n \n Background\n \n &quot;Ignorance&quot; was recorded by American pop rock band Paramore. The song was recorded in Spring 2009. &quot;Ignorance&quot; was written by Paramore's band members Hayley Williams and Josh Farro. The song was released as the lead single from the bands 2009 studio album Brand New Eyes in July 2009. &quot;Ignorance&quot; was the first song written for Brand New Eyes.[4] In an interview with Kerrang!, Williams, who co-wrote the song, discussed the songs meaning, and her and Farro's inspiration for writing the song, saying,\n \n     &quot;In my eyes, this song is a huge turning point for the band. The truth of it is, growing up is not easy. We’re five different people who have to work towards the same goal on a daily basis. There were a lot of times when I felt really alone or angry or insecure. I don’t always feel good at confronting people, especially people that I love, like these guys. Sometimes it takes songs to get the point across. The song is from one person’s perspective. It’s unfair that I’m the one who gets to talk about it but it helped me a lot. The line ‘ignorance is your new best friend’ is about how I felt I was losing people, and I think the band did too. But it’s okay, we’re growing up. I love that song.&quot;\n \n Hayley Williams explained in an interview with The Guardian how this song saved the band from splitting up &quot;I tried to mumble all the way through,&quot; she said about the first time she sung the lyrics to her Paramore bandmates. &quot;But Taylor [York, guitarist] was right next to the speaker and heard every word. He gave me this fierce look – I thought he was going to kill me – and said, 'So do you want to tell me about those lyrics?' I ran into the bathroom, I was so nervous. But we talked for two hours and reconciled a lot of tough, heavy things. That song saved our band.&quot; (Source <a href=\"http://www.songfacts.com/detail.php?id=16208\" rel=\"nofollow\">Ignorance Songfacts</a>).\n \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ignorance&quot; is a song by the American pop rock band Paramore. &quot;Ignorance&quot; was released by Fueled by Ramen in July 2009, as the lead single from the bands 2009 studio album entitled, Brand New Eyes. The song was written by Paramore band members Hayley Williams and Josh Farro; Paramore is also credited as being co-producers to the song. The song, recorded in Spring 2009, was the first song to be written for Brand New Eyes.  ", "published": "Wed, 12 Jan 2011 18:50:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ignorance", "artist": {"url": "http://www.last.fm/music/Paramore", "mbid": "44cf61b8-5197-448a-b82b-cef6ee89fac5", "name": "Paramore"}, "url": "http://www.last.fm/music/Paramore/_/Ignorance", "listeners": "373178", "comments": ["Reminds No Doubt's songs.", "Ignorance is your new best friend [73]", "Ignorance is your new best friend [72]", "You're not a judge, but if you're gonna judge me\r\nWell, sentence me to another life.", "Hayleeeeeeeeeeeeeeeyyyyy <3", "Ignorance is your new best friend ♥ love this song! [71]", "If I'm a bad person, you don't like me...well I guess I'll make my own way", "It's not a war, no, it's not a rapture :D [2]", "Live HD clip of this track from when I saw them in Copenhagen - http://youtu.be/NO8iz_ocd80", "This track explains how I feel/have felt about a bunch of people in my life. Almost autobiographical.", "way better than their new stuff (still kewl band just not what it used to be)", "Where's your gavel? What's my offence this time? ♥", "I GUESS I'LL GO!", "http://www.lastfm.com.br/music/Paramore/+images/88229511 \r\nParamore cover. VOTE UP!", "well you treat me just like another stranger, well it's nice to meet you sir, i guess I'll go, i best be on my way out..", "It's not a war, no, it's not a rapture :D", "never gets old! [2]", "\"You're not a judge but if you're gonna judge me \r\nWell, sentence me to another life.\"", "Ignorance is your new best friend ♥ love this song! [70]", "Ignorance is your new best friend ♥ love this song! [69]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/pop%20punk", "name": "pop punk"}, {"url": "http://www.last.fm/tag/paramore", "name": "paramore"}, {"url": "http://www.last.fm/tag/pop%20rock", "name": "pop rock"}]}, "mbid": "0f061025-a50e-44d5-8853-86d9ae3d09b9", "duration": "219000", "playcount": "4801428", "id": "310186397"}}