{"track": {"album": {"@attr": {"position": "7"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Queen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92260671.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92260671.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92260671.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92260671.png", "size": "extralarge"}], "artist": "Queen", "mbid": "fcb78d0d-8067-4b93-ae58-1e4347e20216"}, "wiki": {"content": "&quot;Bicycle Race&quot; is a single by the English rock band Queen. It was released on their 1978 album <a title=\"Queen - Jazz\" href=\"http://www.last.fm/music/Queen/Jazz\" class=\"bbcode_album\">Jazz</a> and was written by Queen's front-man <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a>. The song is unusual for a Queen single in that it shows off the band's humorous side. Among other comic moments it has a middle eight which features bicycle bells. Fans would often replicate this at Queen concerts with their own such bells.\n \n Mercury was inspired to write 'Bicycle Race' while Queen were in France to work on their 1978 album release (Jazz) during the annual Tour de France. \n \n To release this song Queen staged a bicycle race with 65 naked women. The video was originally banned and subsequently re-edited with added special effects to censor the offensive imagery.\n A great backlash would follow after Queen released promotional posters featuring a woman's nude backside atop a bicycle. Queen, as always, took it in stride in their typical tongue-in-cheek fashion.\n \n &quot;People think we take ourselves a lot more seriously than we actually do&quot;, Roger Taylor said in a press conference at the time. Lead singer Mercury went further and said of the poster, &quot;It's cheeky - naughty, but not lewd. Certain stores, you know, won't run our poster. I guess some people don't like to look at nude ladies.&quot;\n \n This song was released as a double-A side with &quot;<a title=\"Queen &ndash; Fat Bottomed Girls\" href=\"http://www.last.fm/music/Queen/_/Fat+Bottomed+Girls\" class=\"bbcode_track\">Fat Bottomed Girls</a>&quot; and contains the line &quot;Fat Bottomed Girls, they'll be riding today/ so look out for those beauties, oh yeah&quot;. For its part, &quot;Fat Bottomed Girls&quot; contains the line &quot;Get on your bikes and ride!&quot;  A crudely retouched photograph of a naked cyclist from the bicycle race was used for the single cover (now sporting a bikini bottom).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Bicycle Race&quot; is a single by the English rock band Queen. It was released on their 1978 album <a title=\"Queen - Jazz\" href=\"http://www.last.fm/music/Queen/Jazz\" class=\"bbcode_album\">Jazz</a> and was written by Queen's front-man <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a>. The song is unusual for a Queen single in that it shows off the band's humorous side. Among other comic moments it has a middle eight which features bicycle bells. Fans would often replicate this at Queen concerts with their own such bells.  Mercury was inspired to write 'Bicycle Race' while Queen were in France to work on their 1978 album release (Jazz) during the annual Tour de France.  ", "published": "Wed, 11 May 2011 15:10:06 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Bicycle Race", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Bicycle+Race", "listeners": "485278", "comments": ["BI-SEXUAL, BIII-SEXUAL!\r\nI WANT TO RIDE MY....\r\nOh. Uh....", "I only knew the chorus :P", "The '92 Greatest Hits album was my first CD and I remember this being my personal favorite", "Fat bottom girls on bicycles!", "I THOUGHT STAR WARS EPISODES IV THROUGH VI WERE OK. SO I CAN'T HONESTLY SAY I DON'T LIKE STAR WARS. I AM NOT A FANATIC ABOUT IT.I DON'T WATCH BICYCLE RACES THOUGH. R.I.P. FREDDIE.", "So look out for those beauties oh yeah(:", "This isn't just one of the best Queen songs, this isn't just one of the best SONGS of all time, this is one of the best THINGS of all time", "Oh my bike.", "this is one of my favorite songs by the great Freddie Mercury and Queen", "and i don't like star wars", "I've got a bike, you can ride it if you like it's got a basket, a bell...", "epic song!", "those bells though", "Look out for those beauties.", "I want to ride my bicycle!", "Fat-bottom girls...", "I want it to be summer so I can ride my bike!!", "the music video is epic", "And I don't like Star Wars", "AHHH HAAAAA!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/glam%20rock", "name": "glam rock"}]}, "mbid": "0f3a3c3f-03f8-43a6-8c58-3d1f21eed7f4", "duration": "181000", "playcount": "2233122", "id": "12197"}}