{"track": {"album": {"@attr": {"position": "2"}, "title": "Black Holes and Revelations", "url": "http://www.last.fm/music/Muse/Black+Holes+and+Revelations", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88400305.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88400305.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88400305.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88400305.png", "size": "extralarge"}], "artist": "Muse", "mbid": "de6dc138-8b53-4b35-8c96-c10c0871923b"}, "wiki": {"content": "&quot;Starlight&quot; is a song by British alternative rock band Muse and is the second track on their 2006 album Black Holes and Revelations. It was released on 4 September 2006 in the United Kingdom as the second single from Black Holes and Revelations. The song peaked at #13 on the UK Singles Chart. It was also the second single released in the United States, reaching number two on the Modern Rock Tracks chart. The song was first played live during the Radio 1's Big Weekend festival in summer 2006. In live performances &quot;Starlight&quot; is usually played half a step down from the key of B used on Black Holes &amp; Revelations.\n \n &quot;Starlight&quot; was first written in the band's practice studio in late 2004. Bassist Chris Wolstenholme said that it is &quot;a love song about missing someone, friends, family, someone you love.&quot; Lead singer Matt Bellamy commented that he first wrote the song on a boat in bad weather.\n \n In a separate interview with Tom Wilson and Lara Mathews, posted on MuseLive Forums, Wolstenholme was asked what he thought &quot;was the hardest song on the album to record?&quot; His response was &quot;Starlight,&quot; stating it &quot;was one of the songs we went around in circles with, and we recorded maybe six or seven different versions of it.&quot;\n \n An alternative mix of &quot;Starlight&quot;, known as the &quot;New Mix, &quot;Radio Mix&quot; or &quot;Radio Version&quot; was distributed on promotional media only. This version was presumably created to give the song a sound more suitable for radio broadcast.\n \n Muse worked with Paul Minor on Starlight's music video, which was filmed in Los Angeles. In the video, the band perform on the deck of the MS Ocean Chie, a handysize bulk carrier. Band members are also carrying flares, in an attempt to &quot;get rescued,&quot; but in the end this fails and they are abandoned. This relates to the song's lyrics, which mentions ships and abandonment.\n \n Matthew Bellamy stated in an interview with The Sunday Mail that the band wanted to &quot;create the idea of a band lost at sea because we see ourselves as being outside what's happening in the music scene.&quot; He also told the interviewer, Billy Sloan, that &quot;it was an epic feeling playing on a huge platform with the sea all around us.&quot;\n \n &quot;Starlight&quot; received mixed critical reviews, from various publishers.\n \n NME's review was harshly critical of the song, with the reviewer stating that the song &quot;is a tune so chart-hungry it's virtually dry-humping JK and Joel's legs.&quot;\n \n MusicOMH stated that the song was &quot;a track perfectly at home on drivetime radio&quot; while saying it &quot;showcases another side to the band's music and their staggering breadth of appeal.&quot;\n \n Meanwhile, Leeds Music Scene reviewer Maria Pinto-Fernandes gave &quot;Starlight&quot; a glowing review, with a score of 4.5 stars out of 5. In her review, she commented that &quot;the band's musical arrangements on the track do not come into being just by accident.&quot; She also stated that the song was just as passionate when performed live as when heard on CD.\n \n &quot;Starlight&quot; entered the UK Singles Chart the week of September 3 at number 38 via digital downloads. The following week, and with the physical release in the United Kingdom, the single peaked at number 13. Since then, the single's chart position steadily declined, and it remained in the Top 75 after fifteen weeks, during the week of December 11, 2006. The next week, &quot;Starlight&quot; had fallen out of the Top 75.\n \n &quot;Starlight&quot; has also peaked at number two on Billboard's Modern Rock Tracks chart, Muse's second highest charting single to date on any major chart in the US. It also charted in at number nine on the Triple J Hottest 100, 2006. It was also ranked at number four on Colombian radio station Radiónica's 2006 top 100.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Starlight&quot; is a song by British alternative rock band Muse and is the second track on their 2006 album Black Holes and Revelations. It was released on 4 September 2006 in the United Kingdom as the second single from Black Holes and Revelations. The song peaked at #13 on the UK Singles Chart. It was also the second single released in the United States, reaching number two on the Modern Rock Tracks chart. The song was first played live during the Radio 1's Big Weekend festival in summer 2006.", "published": "Sun, 9 May 2010 04:48:10 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Starlight", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Starlight", "listeners": "1172053", "comments": ["Magical good!", "This song, as magical as it is, is even more magical when you see it live aaaaaaahhhh <3", "I will never EVER get tired of this song. [11]", "Yo nunca me cansaré de esta canción (10). JAMÁS", ":-)", ":-)", "\"faaar awaaaay this shit is taking me faaaar away\" was what i got at the first listen.", "Awesome song.", "<3 <3", "Clap. Clap-clap. Clap. Clap-clap-clap.", "Yo nunca me cansaré de esta canción (9).", "this ship is taking me far away", "I will never EVER get tired of this song. [8] so many great memories of me and my sister singing this when i was a kid, i miss those days <3", "this doesn't get old", "<3 <3", "https://www.youtube.com/watch?feature=player_embedded&v=-vL0FhbFUbM#at=157\r\n\r\nCheck this out. ; )", "Great song <3", ":)", "some contestant on 'the voice' tried to sing this last night on TV.  Just proves how beautiful Matt Bellamy's voice is.", "I will never EVER get tired of this song. [7]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0f58256c-8a5d-4bfa-a7b2-ca203a3b562c", "duration": "240000", "playcount": "10942580", "id": "53033048"}}