{"track": {"album": {"@attr": {"position": "2"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Bruce+Springsteen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91266097.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91266097.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91266097.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91266097.png", "size": "extralarge"}], "artist": "Bruce Springsteen", "mbid": "ce73ebd3-5ae0-35a0-93e8-187bcc7fa47a"}, "wiki": {"content": "&quot;Thunder Road&quot; is a song written and performed by Bruce Springsteen, and the opening track on his 1975 breakthrough album Born to Run. It is ranked as one of Springsteen's greatest songs, and often appears on lists of the top rock songs of all time.\n \n The lyrics to &quot;Thunder Road&quot; describe a young woman named Mary, her boyfriend, their hopeless lives and their &quot;one last chance to make it real.&quot; Thematically, it reads as a nostalgic companion piece to &quot;Born to Run&quot;.\n \n Musically, the song opens with a quiet piano and harmonica introduction, meant, as Springsteen said years later in the Wings For Wheels documentary, as a welcoming to both the track and the album, a signifier that something was about to happen. Eschewing a traditional verse-and-chorus structure, the song's arrangement gradually ramps up in instrumentation, tempo and intensity. The title phrase is not used until the middle section of the song, and then is not used again. Finally, after the closing line there is a saxophone-and-piano duet in the instrumental coda.\n \n In this song, Springsteen mentions Roy Orbison &quot;singing for the lonely&quot; on the radio. Orbison, one of whose best-known songs is &quot;Only the Lonely,&quot; was a huge influence on Springsteen.\n \n The song's title comes from the Robert Mitchum film Thunder Road. Springsteen declared that he was somehow inspired from the movie even if, as he says, &quot;I never saw the movie, I only saw the poster in the lobby of the theater.&quot;\n \n &quot;Thunder Road&quot; is a classic rock staple, and has been covered by artists such as Melissa Etheridge, Cowboy Junkies, Badly Drawn Boy, brazilian singer Renato Russo, Mary Lou Lord[7], Bonnie 'Prince' Billy with Tortoise[8] and Frank Turner. Adam Duritz of Counting Crows often sings large portions of the lyrics to &quot;Thunder Road&quot; in the middle of their song &quot;Rain King.&quot;\n \n Badly Drawn Boy also ends his album Born in the UK with the line &quot;if we still don't have a plan, we'll listen to 'Thunder Road'&quot;.\n \n In the movie Explorers starring River Phoenix and Ethan Hawke, the name of the space vessel they create out of a Tilt-A-Whirl is &quot;Thunder Road&quot;.\n \n In an episode of King of Queens, Doug is seen playing a harmonica and then asking Spence if it &quot;sounded anything like Thunder Road&quot;.\n \n In the video game Rock Band 2, a clothing item from the Rock Shop that you can purchase is called Thunder Road. In reference to the song's lyrics, the item description reads, &quot;You got a guitar. You learned to make it talk. Slip on this jacket if you're ready for the long walk.&quot;\n \n In the novel High Fidelity by Nick Hornby, the protagonist Rob Fleming ranks &quot;Thunder Road&quot; as one of his five best side one tracks.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Thunder Road&quot; is a song written and performed by Bruce Springsteen, and the opening track on his 1975 breakthrough album Born to Run. It is ranked as one of Springsteen's greatest songs, and often appears on lists of the top rock songs of all time.  The lyrics to &quot;Thunder Road&quot; describe a young woman named Mary, her boyfriend, their hopeless lives and their &quot;one last chance to make it real.&quot; Thematically, it reads as a nostalgic companion piece to &quot;Born to Run&quot;.  ", "published": "Sun, 28 Feb 2010 22:06:34 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Thunder Road", "artist": {"url": "http://www.last.fm/music/Bruce+Springsteen", "mbid": "70248960-cb53-4ea4-943a-edb18f7d336f", "name": "Bruce Springsteen"}, "url": "http://www.last.fm/music/Bruce+Springsteen/_/Thunder+Road", "listeners": "314027", "comments": ["this song is all kinds of majestic", "You look like crap to my eyes.", "I think I'll never see what people hear in this (or in his music in general). Sounds like crap to my ears.", "This might be the best song I've ever heard", "tops,...........", "With a chance to make it good somehow - hey what else can we do now? Except roll down the window, and let the wind blow back your hair. Well, the night's busting open, these two lanes will take us anywhere.. We got one last chance to make it real, to trade in these wings on some wheels.", "Dat xylophone.", "What can you say,he is the Boss", ":)))", "Thunder Road from Hammersmith '75 is so good I have no words. Floored every time. Magic!", "he is the best", "So you're scared and you're thinking that maybe we ain't that young anymore\r\nShow a little faith, there's magic in the night", "Just a perfect song and I guess I can say that about maybe 10 songs. It just makes me feel feelies. It's represents everything I've always loved about music.", "Saw him play at Sheridan College, 1975. Wonderful!", "with cap'n tightpants on this one, been listening to this since 1978 when I bought the album, goosebumps every time, even at this age!!", "love it...", "Wow, this is a great version of this classic song. Love it.", "Greatest song ever.", "♥", "Wikipedia claims the narrator is Mary's boyfriend. Where in the song is this indicated? I've always figured they'd maybe met once, or were just friends, and he was asking for love in return for \"saving her\" on Thunder Road."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/bruce%20springsteen", "name": "bruce springsteen"}]}, "mbid": "12592265-717d-4714-b316-0303938081be", "duration": "350000", "playcount": "1558477", "id": "1005826"}}