{"track": {"album": {"@attr": {"position": "12"}, "title": "Fallen", "url": "http://www.last.fm/music/Evanescence/Fallen", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/46370535.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/46370535.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/46370535.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/46370535.png", "size": "extralarge"}], "artist": "Evanescence", "mbid": "9cb25ce1-bc4f-40b4-bf8c-9f06e2162e8b"}, "wiki": {"content": "<em>Written by: A. Lee and B. Moody</em>\n \n &quot;My Immortal&quot; is one of the most popular songs ever recorded by Evanescence. This song lasts the entire span of Evanescence’s recording history. It is credited as the 4th song ever written for Evanescence. <a href=\"http://www.last.fm/music/Ben+Moody\" class=\"bbcode_artist\">Ben Moody</a> wrote the original in full when he was 15 years old. It is the second song that he wrote for the band (<a title=\"Evanescence &ndash; Understanding\" href=\"http://www.last.fm/music/Evanescence/_/Understanding\" class=\"bbcode_track\">Understanding</a> is credited as his first). In the later versions of the song, <a href=\"http://www.last.fm/music/Amy+Lee\" class=\"bbcode_artist\">Amy Lee</a> is credited to have written the bridge and the coinciding piano part to the song. There are seven different recorded versions of the song. The <a title=\"Evanescence - Fallen\" href=\"http://www.last.fm/music/Evanescence/Fallen\" class=\"bbcode_album\">Fallen</a> version of the song has strings by composer <a href=\"http://www.last.fm/music/Graeme+Revell\" class=\"bbcode_artist\">Graeme Revell</a>.\n \n Until near the end of 2002, the Fallen version was played live. They then began playing the Band version, which later became the version they released as a single. When performed live, Amy is playing the piano herself, but the notes are changed into a much simpler melody, probably to avoid mistakes during live playing. Amy has stated she hates the song because she can never really relate to it (and that you can notice when performing live), since it is not hers and not based on real events.\n \n The <a title=\"Evanescence - Mystary EP\" href=\"http://www.last.fm/music/Evanescence/Mystary+EP\" class=\"bbcode_album\">Mystary EP</a> version is like the band version's demo recording. Amy is playing piano with added strings in the background. It also has some similarities to the Fallen version, although a lot of fans say that this one has a more sophisticated piano arrangement. Amy also takes short pauses in the choruses. The verses don't have much of a difference to the band version. Like the Fallen version, this version doesn't include the rock part at the end. Wind-up Records were unhappy with this version and decided that the Origin version was best, but with more strings in the background.\n \n The song has many different interpretations. Ben wrote a short story before writing the lyrics to the song. According to Ben, the song is about a spirit staying with you after its death and haunting you until you actually wish that the spirit were gone because it won't leave you alone. Ben dedicated the song along with the Fallen album to his grandfather. The song peaked at #2 on the pop chart just behind Britney Spears’ Toxic, and was #1 on the Hot Adult Contemporary chart for 3 weeks.\n \n The band version of My Immortal is Ben Moody's last recording with Evanescence before his departure in October of 2003.\n \n This song was nominated for Best Pop Vocal Performance by Duo or Group for the 47th Annual Grammy Awards of 2004.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Written by: A. Lee and B. Moody  &quot;My Immortal&quot; is one of the most popular songs ever recorded by Evanescence. This song lasts the entire span of Evanescence’s recording history. It is credited as the 4th song ever written for Evanescence. <a href=\"http://www.last.fm/music/Ben+Moody\" class=\"bbcode_artist\">Ben Moody</a> wrote the original in full when he was 15 years old. It is the second song that he wrote for the band (<a title=\"Evanescence &ndash; Understanding\" href=\"http://www.last.fm/music/Evanescence/_/Understanding\" class=\"bbcode_track\">Understanding</a> is credited as his first). In the later versions of the song, <a href=\"http://www.last.fm/music/Amy+Lee\" class=\"bbcode_artist\">Amy Lee</a> is credited to have written the bridge and the coinciding piano part to the song.", "published": "Wed, 11 Aug 2010 17:04:31 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "My Immortal", "artist": {"url": "http://www.last.fm/music/Evanescence", "mbid": "f4a31f0a-51dd-4fa7-986d-3095c40c5ed9", "name": "Evanescence"}, "url": "http://www.last.fm/music/Evanescence/_/My+Immortal", "listeners": "810976", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/gothic", "name": "gothic"}, {"url": "http://www.last.fm/tag/evanescence", "name": "evanescence"}, {"url": "http://www.last.fm/tag/gothic%20rock", "name": "gothic rock"}]}, "mbid": "12697306-81da-4fbc-9710-e1b9e7218254", "duration": "262000", "playcount": "6522512", "id": "1070490"}}