{"track": {"album": {"@attr": {"position": "3"}, "title": "Meteora", "url": "http://www.last.fm/music/Linkin+Park/Meteora", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/52490659.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/52490659.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/52490659.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/52490659.png", "size": "extralarge"}], "artist": "Linkin Park", "mbid": "3e42e773-ab67-4b20-ae41-0e1cf7510827"}, "wiki": {"content": "&quot;Somewhere I Belong&quot; is a nu metal song written by Linkin Park from their second studio album Meteora. The song was released as the album's debut single in early 2003 and entered the top ten on the majority of the charts it appeared on. It reached #32 on the Hot 100 on April 22, 2003.\n \n &quot;Somewhere I Belong&quot; was officially released to U.S. radio on March 18, 2003. The song reached the top thirty on the Hot 100 Airplay, and the following week it debuted on the Hot 100, the official U.S. chart. &quot;Somewhere I Belong&quot; peaked at number thirty-two in its fifteenth week and remained on the chart until its twentieth week. The song entered the top ten on the majority of the Billboard charts on which it appeared. While &quot;Somewhere I Belong&quot; proved somewhat popular on modern rock radio, it reached number one on the Mainstream Rock Tracks chart and on the Modern Rock Tracks chart.\n \n In Canada &quot;Somewhere I Belong&quot; was officially released to radio in March 2003. The song reached the top five on the Canadian Singles Chart where it peaked at #3. &quot;Somewhere I Belong&quot; is the highest charted Linkin Park song in Canada.\n \n The song was released in Australia, Europe and New Zealand in May 2003. &quot;Somewhere I Belong&quot; peaked at number ten in the UK Singles Chart. Although Linkin Park reached number one in New Zealand and the top ten in the Ireland, Japan and Canada, it was a moderate top twenty success in Germany, Italy, Austria, Netherland, Sweden and Australia. &quot;Somewhere I Belong&quot; reached the top thirty in France and Belgia in early 2003. The song was also featured in a profile video for Jamaican sprinter Usain Bolt at the 2008 Beijing Olympics.\n \n Conservative commentator Mark Levin's son selected the song's instrumental as the bumper music for his father's radio talk show.\n \n Its clip, directed by Joseph Hahn, shows the band playing the song in front of a fire, with occasional shots of Chester Bennington and Mike Shinoda in front of a waterfall with what look like Asian monks around them. The doors in what is supposedly Bennington's room has the Chinese characters for fire and water, which possibly represent the waterfall and burning fire behind Shinoda while rapping. During the video, on a dresser sits several props, most notably figures of Sazabi from Mobile Suit Gundam: Char's Counterattack, Wing Zero Custom from Gundam Wing: Endless Waltz, and Gundam GP01 Full Vernian &quot;Zephyranthes&quot; from Mobile Suit Gundam 0083: Stardust Memory. It was awarded as Best Rock Video at the 2003 MTV Video Music Awards, and was the first music video broadcast on Fuse TV.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Somewhere I Belong&quot; is a nu metal song written by Linkin Park from their second studio album Meteora. The song was released as the album's debut single in early 2003 and entered the top ten on the majority of the charts it appeared on. It reached #32 on the Hot 100 on April 22, 2003.  &quot;Somewhere I Belong&quot; was officially released to U.S. radio on March 18, 2003. The song reached the top thirty on the Hot 100 Airplay, and the following week it debuted on the Hot 100, the official U.S. chart.", "published": "Sun, 2 Aug 2009 18:11:54 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Somewhere I Belong", "artist": {"url": "http://www.last.fm/music/Linkin+Park", "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419", "name": "Linkin Park"}, "url": "http://www.last.fm/music/Linkin+Park/_/Somewhere+I+Belong", "listeners": "762630", "comments": ["I wanna heal, I wanna feel, like I'm close to something real, I wanna find something I've wanted all along, somewhere I belong!  Love this song!", "My favourite!", "descbries my entire life since 2007", "Still like there old stuff.", "This song is so fucking perfect! [2]", "They used to be so cool! I love their old stuff. Now it's just plain mainstream electro-pop they do...", "still my favourite <3", "love Linkin park", "meteora & hybrid theory are so much better than the rest of their stuff", "Who didn't love Linkin Park at some point in their lives?", "I love this song! One of LP's best", "Linkin Park has the best lyrics ever", "Video has 50 foot tall mammoths....I love this song XD", "This song is so fucking perfect!", "YAY!", "SOMEWHERE I BELOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOONG", "My favorite song from Meteora.", "love this song ^-^", "Massive riff - Excellent lyrics :-)", "One of my favourite Linkin Park songs, lyrics especially good!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nu%20metal", "name": "nu metal"}, {"url": "http://www.last.fm/tag/linkin%20park", "name": "linkin park"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "12fa7051-b962-443d-b2b8-d924323fb8c9", "duration": "213000", "playcount": "5697716", "id": "1181551"}}