{"track": {"album": {"@attr": {"position": "3"}, "title": "Nevermind", "url": "http://www.last.fm/music/Nirvana/Nevermind", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/77269934.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/77269934.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/77269934.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/77269934.png", "size": "extralarge"}], "artist": "Nirvana", "mbid": "e4520f1b-80fc-4bb8-9f45-0d98ac3c152f"}, "wiki": {"content": "&quot;Come as You Are&quot; is a song by the American grunge band Nirvana, written by frontman Kurt Cobain. It is the third song on (and second single from) the band's second album Nevermind (1991). It was the album's second most successful single, and the band's second American Top 40 hit in 1992. After its release as a single in March 1992, &quot;Come as You Are&quot; peaked at number 32 on the Billboard Hot 100; it was the band's second and last American Top 40 hit. The single stayed on the chart for 18 weeks. The song also reached number three on the Billboard Mainstream and Modern Rock Tracks charts.\n \n It was also one of the few new songs Nirvana recorded onto a rehearsal tape the group sent to producer Butch Vig prior to the recording of Nevermind in 1991. The group recorded the song with Vig during album sessions at Sound City Studios in Van Nuys, California, in early 1991. &quot;Come as You Are&quot; was selected as the second single from the album; it was anticipated that the album's first single, &quot;Smells Like Teen Spirit&quot;, would be a &quot;base-building alternative cut&quot;, while &quot;Come as You Are&quot; would be able to cross over into other radio formats. However, &quot;Smells Like Teen Spirit&quot; became a surprise hit and boosted the band's popularity.\n \n The song's prominent line &quot;And I swear that I don't have a gun&quot; has also been interpreted to mean that Cobain &quot;had nothing to hide from anyone.&quot; Cobain was known for writing using heavy metaphor in his lyrics, allowing fans to decide what the words meant to them. After the death of the song's author, the media paid much attention to the song's prominent line, and other songs on Nevermind that mentioned guns, though the album was written and recorded three years before Cobain's death and therefore it was taken as a mere coincidence.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=1931\" rel=\"nofollow\">Come As You Are Songfacts</a>, the chords in this song are a slowed down replica of Killing Joke's 1985 song  <a title=\"Killing Joke &ndash; Eighties\" href=\"http://www.last.fm/music/Killing+Joke/_/Eighties\" class=\"bbcode_track\">Eighties</a>. The songs were so similar that Nirvana considered holding off releasing this as a single. Killing Joke decided not to sue Nirvana, and in 1992, Dave Grohl helped them out by playing drums for them on an album. \n \n The music video was directed by Kevin Kerslake, who later directed the videos for &quot;Lithium,&quot; &quot;In Bloom,&quot; and &quot;Sliver.&quot; The video features the band in a dark room, where the appearance of falling water in front of the band distorts and blurs the band members' faces (an idea suggested by Cobain). Throughout the video, clips such as cells multiplying at an incredible rate, to a living organism in its embryotic stages are shown. The video clip also features Kurt Cobain swinging away on a chandelier throughout the room, and water begins to flow into the room. In addition, the video shows parts involving a dog wearing a cone collar. Images of a baby swimming underwater (a reference to the cover of Nevermind) and a gun floating appear. Towards the end, a clip of the band appears, with Cobain in the front, lying on the ground and kissing the camera. The band shot outdoor footage in a park in Hollywood Hills a few days prior to the main video shoot. Kerslake projected this footage in the background of many shots in the main part of the video.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Come as You Are&quot; is a song by the American grunge band Nirvana, written by frontman Kurt Cobain. It is the third song on (and second single from) the band's second album Nevermind (1991). It was the album's second most successful single, and the band's second American Top 40 hit in 1992. After its release as a single in March 1992, &quot;Come as You Are&quot; peaked at number 32 on the Billboard Hot 100; it was the band's second and last American Top 40 hit. The single stayed on the chart for 18 weeks. The song also reached number three on the Billboard Mainstream and Modern Rock Tracks charts. ", "published": "Wed, 21 Nov 2012 03:38:04 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Come as You Are", "artist": {"url": "http://www.last.fm/music/Nirvana", "mbid": "5b11f4ce-a62d-471e-81fc-a69a8278c7da", "name": "Nirvana"}, "url": "http://www.last.fm/music/Nirvana/_/Come+as+You+Are", "listeners": "1494108", "comments": ["Memoriaaaaa...", "So hauntingly beautiful. ~<>{8]", "My Nirvana inspired original song \"Nevermind\" about being to busy with our own lives that we neglect others video at http://www.youtube.com/watch?v=eKtDLMeRSEU", "check out Pink Freud's version", "Mas ele tinha e ponto final, música não era a vida real dele.", "http://www.youtube.com/watch?v=2Q6n8OWhZmM", "You said that you did not had a gun =(", "I cry. :) [1]", "F@#king still lovin this!!", "the effect on the guitar really makes the song, so good", "just watched a heroin special about cobain and youtube, and then this song comes on. Damn why does this hurt even 19 yrs later?\r\nRIP Kurt", "My favourite Nirvana song [5]", "My favorite nirvana song [4]", "My favorite nirvana song [3]", "best song for me.", "I was just going to sign off from my computer, and then this song came on, Fuuuuuuuuuuuuucccck, why does Nirvana have to be so good?", "Heeey! you! Yes, you! please, come as you are :D", "меня уносит, обажаю", "Love Love Love.", "\"No I don't have a gun\" - Kłamał.."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nirvana", "name": "nirvana"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "13cafb9a-3379-4472-97df-298b6d8220d3", "duration": "219000", "playcount": "9990539", "id": "9953"}}