{"track": {"album": {"@attr": {"position": "4"}, "title": "A Rush of Blood to the Head", "url": "http://www.last.fm/music/Coldplay/A+Rush+of+Blood+to+the+Head", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88463753.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88463753.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88463753.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88463753.png", "size": "extralarge"}], "artist": "Coldplay", "mbid": "53e93362-49f6-322f-8ae4-15a416c83209"}, "wiki": {"content": "Chris Martin wrote &quot;The Scientist&quot; after listening to George Harrison's &quot;All Things Must Pass&quot;. In an interview with Rolling Stone, Martin revealed that while working on the band's second album, A Rush of Blood to the Head, he knew that the album was missing something. One night, during a stay in Liverpool, Martin found an old piano that was out of tune. He wanted to work on George Harrison's song &quot;Isn't It a Pity&quot;, but he could not manage to do so. When the song came to Martin, he asked that the recorder be turned on. He concludes with saying that he came across this chord sequence and noted that the chord was &quot;lovely&quot;. Martin recorded the vocals and piano takes in a studio in Liverpool.\n \n When asked about the development of the song, during a track-by-track reveal, Martin said: &quot;That's just about girls. It's weird that whatever else is on your mind, whether it's the downfall of global economics or terrible environmental troubles, the thing that always gets you most is when you fancy someone.&quot;\n \n However, the inside cover to A Rush of Blood to the Head stated: &quot;The Scientist is Dan.&quot; 'Dan' refers to Dan Keeling, the A&amp;R man who signed the band to Parlophone.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Chris Martin wrote &quot;The Scientist&quot; after listening to George Harrison's &quot;All Things Must Pass&quot;. In an interview with Rolling Stone, Martin revealed that while working on the band's second album, A Rush of Blood to the Head, he knew that the album was missing something. One night, during a stay in Liverpool, Martin found an old piano that was out of tune. He wanted to work on George Harrison's song &quot;Isn't It a Pity&quot;, but he could not manage to do so.", "published": "Thu, 29 Apr 2010 09:38:26 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "The Scientist", "artist": {"url": "http://www.last.fm/music/Coldplay", "mbid": "cc197bad-dc9c-440d-a5b5-d52ba2e14234", "name": "Coldplay"}, "url": "http://www.last.fm/music/Coldplay/_/The+Scientist", "listeners": "1302172", "comments": ["Awesome! I just received a free iTunes Card Code and it redeemed just fine! Crazy! Check this site out: freeitunesforever|d●t| com", "these lyrics are so great, but, chris martin wailing at the end really tears me up", "ok? It's bloody brilliant.", "It's ok", "Not bad", "Great song", "If you like Snow Patrol you could watch this video I've made for one of their songs http://youtu.be/d-2kEsK-QBQ", "I often listen to this song before going to sleep..", "Great song for a love story :')", "i was hoping that of all the coldplay songs, they'd play this one, and they did. <3", "Favorite Coldplay song EVER! The Zero Summers did an acoustic guitar cover of this song on Youtube, fabulous!!", "Can't believe how great this song is...  ''.. running in circles; coming up tails, heads on a silence apart.. ''  I can't stop listening.. :O", "Moving, brilliant", "I expect something better! this tunes we  hear it alot!", "Lovely", "other_better_times_of_coldplay_ _ _", "Masterpiece ¹²³", "posted 11-13-2004, rated 0, view \"I believe The Scientist is a spiritual song, compared to the agnostic God Put A Smile On Your Face. It yearns for humans to go back to it's original purity - Adam & Eve. 'Come back and haunt me' is like the ghosts of history warning, shadowing us. 'Running in circles, chasing tails, coming back as we are' is the endless human mother nature cycle of good/bad, ying/yang, life/death, and for the believers: heaven/hell. The last verse is ZEITGEIST...we will forever part/distance ourselves from Gaia, Purity because of capitalism, 'science and progress'. We will never return to the innocence of Adam & Eve, the world is corrupted, money hungry, materialistic, full of divorce, hungry people, greedy businessmen etc et al...\"", "Song for eternity", "nice"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/coldplay", "name": "coldplay"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/britpop", "name": "britpop"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "1504a675-4a3d-4103-96f5-22970eb4f6bf", "duration": "306000", "playcount": "11098815", "id": "1004949"}}