{"track": {"album": {"@attr": {"position": "10"}, "title": "Jagged Little Pill", "url": "http://www.last.fm/music/Alanis+Morissette/Jagged+Little+Pill", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83701229.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83701229.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83701229.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83701229.png", "size": "extralarge"}], "artist": "Alanis Morissette", "mbid": ""}, "wiki": {"content": "&quot;Ironic&quot; is a song written by Alanis Morissette and Glen Ballard and produced by Ballard for Morissette's third album Jagged Little Pill (1995). It was released as the album's fourth single in 1996.\n \n Musically, the song is a glossy take on a basic grunge music format with delicate, sparsely-instrumented verses alternating with loud, aggressive chorus sections. Lyrically, it comprises a series of vignettes describing situations that end with the question &quot;Isn't it ironic?&quot;\n \n Because &quot;Ironic&quot; was Morissette's first single to be given a commercial release in the United States, it was eligible to appear on the Billboard Hot 100 chart and reached number four. As of 2008, it was her highest-peaking single in the US. &quot;Ironic&quot; became Morissette's third number-one hit on Billboard's Modern Rock Tracks chart and her first on the Top 40 Mainstream chart and received frequent rotation on Adult Top 40 radio stations. It reached the Top Ten in Germany and peaked just outside the Top Ten in the United Kingdom, becoming Morissette's first top twenty hit there.\n \n &quot;Ironic&quot;, which contains a reference to a plane crash (...&quot;and as the plane crashed down, he thought, 'well, isn't this nice?'&quot;), was on the list of songs deemed inappropriate by Clear Channel following the September 11, 2001 attacks, and subsequently left off the set list during her 2002 tour.\n \n &quot;Ironic&quot; was also recently made popular by the 90 second version arranged by Andrew &quot;Flanders&quot; Ryan, for the dashing A Cappella Choir &quot;Harambee&quot; in the 2008 edition of the Australian &quot;Battle of the Choirs&quot;.\n \n The song's usage of the word &quot;ironic&quot; attracted attention for what many feel is an improper application of the term.Many situations that Morissette describes in the song are arguably examples of cosmic irony: events that, as the Oxford English Dictionary puts it, appear &quot;as if in mockery of the fitness or rightness of things&quot;, such as &quot;a death row pardon/two minutes too late&quot;.\n \n Morissette has also confirmed that she is a self-dubbed &quot;malapropism queen&quot; and alleges that the song was lighthearted and not taken too seriously at the time it was written:\n \n &quot;For me the great debate on whether what I was saying in ‘Ironic’ was ironic wasn’t a traumatic debate. I’d always embraced the fact that every once in a while I’d be the malapropism queen. And when Glen and I were writing it, we definitely were not doggedly making sure that everything was technically ironic. It’s a testament to the fact that we didn’t think it was going to be put under the microscope by 30 million people. For me the sweetest moment came in New York when a woman came up to me in a record store and said, ‘So all those things in the “Ironic” aren’t ironic.’ And then she said, ‘And that’s the irony.’ I said, ‘Yup.’ To me it’s a real snapshot of a nineteen-year-old’s definition and version of how life worked at the time. All that ‘Ironic’ touches on spawned all my future inquiries into and current understandings of the mysteries of life.&quot;\n \n The popular Irish comedian Ed Byrne always performs a skit in which he jokingly attacks the song for its lack of ironies: &quot;The only ironic thing about that song is it's called ironic and it's written by a woman who doesn't know what irony is. That's quite ironic.&quot; Byrne goes through the song, working out how to change the various unfortunate incidents, mentioned in the song, into ironies. Popular satirists Berger and Wyse also parodied the song in their cartoon strip The Pitchers. In an episode where superhero Irony Man (a pun on Iron Man) likens his superpowers to lyrics from Morrisette's song, causing his cohorts to rename him &quot;The Man from Alanis&quot; (a pun on The Man from Atlantis).\n \n In 2004 Morissette amended a lyric as a show of her support for same-sex marriage:\n     &quot;It's meeting the man of my dreams\n     And then meeting his beautiful husband&quot;\n \n She first sang the line at the fifteenth annual GLAAD Media Awards in March 2004. She recorded an acoustic version of the song with the amended lyric for an exclusive iTunes Music Store release. Another acoustic version was recorded for the album Jagged Little Pill Acoustic (2005), and another for the Cities 97 Sampler Volume 16 (2004). A live version without the altered lyric is included on the album Alanis Unplugged (1999). The song was also performed in a duo with Avril Lavigne, at the House of Blues, in 2005.\n \n The single's video was released in January 1996 and received heavy rotation on MTV and VH1 in the US. It was directed by Stéphane Sednaoui and features Morissette driving a black Lincoln Continental Mark V through a winter landscape. She also plays her passengers: one in a green sweater riding in the back seat; one in a yellow sweater with braided hair, also in the back seat; and one in a red sweater in the front passenger seat. At the end of the video, the car stalls and Morissette, as the driver, exits but her passengers are nowhere to be seen. However, a man then appears and asks them a question about the driver. (Not all versions contain the last scene.)\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ironic&quot; is a song written by Alanis Morissette and Glen Ballard and produced by Ballard for Morissette's third album Jagged Little Pill (1995). It was released as the album's fourth single in 1996.  Musically, the song is a glossy take on a basic grunge music format with delicate, sparsely-instrumented verses alternating with loud, aggressive chorus sections. Lyrically, it comprises a series of vignettes describing situations that end with the question &quot;Isn't it ironic?&quot;  ", "published": "Thu, 5 Mar 2009 05:36:28 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ironic", "artist": {"url": "http://www.last.fm/music/Alanis+Morissette", "mbid": "4bdcee62-4902-4773-8cd1-e252e2e31225", "name": "Alanis Morissette"}, "url": "http://www.last.fm/music/Alanis+Morissette/_/Ironic", "listeners": "569412", "comments": ["Timeless!", "\" I like the song, but 95% of the situations she describes here aren't really ironic. \"\r\n\r\ni know. isnt that ironic?", "I like the song, but 95% of the situations she describes here aren't really ironic.", "It's the very first song played on my last.fm account. Isn't it ironic? Haha.", "can't help singing along :)", "Great Song", "Nostalgia :)", "Good song. Isn't that \"ironic?\"", "\"It's like rain on your wedding day....\" Been there.\n\"It's the good advice that you just didn't take....\"  That too.\nShe forgot the good idea you didn't pursue, but somebody else did, the faithless friend you mistakenly thought you could trust, and on and on.\n\"Who would've thought... it figures....\"  Whether those things are ironic or not, that's life.", "It's meeting the man of my dreams, and then meeting his beautiful wife.", "This should be called 'Iconic' by now.", "It's like ten thousand spoons when all you need is a knife", "class", "<3 this song describes life :D", "love this song...\"life has a funny way of sneaking up on you\"", "Yeah, it isn't ironic really.", "And isn’t it ironic… don’t you think?", "Épica", "Perfect.", "I LOVE THIS SONG!!!!!!!!!!!!!!!!!!!!!!!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}]}, "mbid": "15d5edc1-3a20-4b2c-912b-e69dd8f6355d", "duration": "227000", "playcount": "3127217", "id": "23574"}}