{"track": {"album": {"@attr": {"position": "6"}, "title": "The Black Parade", "url": "http://www.last.fm/music/My+Chemical+Romance/The+Black+Parade", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/81077927.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/81077927.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/81077927.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/81077927.jpg", "size": "extralarge"}], "artist": "My Chemical Romance", "mbid": "d31bec3d-51ca-3503-8f68-c2c9cf8e3251"}, "wiki": {"content": "&quot;I Don't Love You&quot; is the third UK, Philippine, Malaysian and Australian single and sixth track from My Chemical Romance's third studio album, The Black Parade. It is the tenth overall single from the band. It was released April 2, 2007, to the United Kingdom, following &quot;Welcome to the Black Parade&quot; and &quot;Famous Last Words&quot;, both of which were successful hits for the band. The band opted to release &quot;Teenagers&quot; as the third single in the U.S. instead of &quot;I Don't Love You&quot;. The band released the single in Canada, on MuchMusic on March 19. The song nabbed a positive 4/5 star review from music site Pitchfork Media, who claimed: &quot;..it's the band's first proper power ballad and, well, they should definitely think about writing dozens more.&quot; The single was released in Australia on May 16.\n \n The music video was directed by Marc Webb who also directed three previous My Chemical Romance music videos, from their Three Cheers for Sweet Revenge album. Webb was chosen instead of Sam Bayer who directed &quot;Welcome to the Black Parade&quot; and &quot;Famous Last Words&quot; from their third studio album The Black Parade. The music video is about two lovers in a strange abstract world, and the video seems to tell the story of how their love quickly withers away until one leaves the other alone. Towards the end of the video, one of the band's amplifiers explodes along with two of the guitars. On March 7, 2007, the band exclusively premiered the video on their YouTube channel, and on their MySpace. The video is in a color format, most likely to simulate more contrast between the two lovers. The music video also shows Gerard with his newly-dyed black hair, which he has sported since late December. There were also reports by one observers of Gerard wearing a wedding band (as can be seen in the video), which Gerard was asked about in an interview with 97X, where he mentioned that he had 'found someone very special' . The video appeared on Kerrang! TV in the UK on March 9, 2007, and on Channel 4 in the UK on March 8, 2007. The clip also shows the band members falling but not landing, in the order of Mikey Way, Ray Toro, Bob Bryar, Frank Iero, Gerard Way. The video was made available on March 19, 2007 for purchase on the UK iTunes store. The video also faced some controversy due to one of the protagonists being covered in blackface.[citation needed] The video was released in New Zealand on March 13, 2007.\n \n &quot;I Don't Love You&quot; debuted at #65 on the UK Singles Chart on downloads alone on March 25, 2007. It climbed to number #35, still on downloads alone the next week, on April 1, 2007. It rose to #13 in its physical release.\n \n &quot;I Don't Love You&quot; has also been a hit in the Philippines. The song leapt from #5 to #3 in the MYX Hit Chart dated April 8, 2007, matching the peak position of &quot;Helena&quot;, the band's previous highest-charting video before the first two videos from The Black Parade. It then reached #1 in May and then went back to #3. Yet, in most of the MYX Daily Top Ten episodes it retained its position at #4.\n \n On May 24, 2007, &quot;I Don't Love You&quot; debuted at #3 on the Galgalatz Israel Top 20.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;I Don't Love You&quot; is the third UK, Philippine, Malaysian and Australian single and sixth track from My Chemical Romance's third studio album, The Black Parade. It is the tenth overall single from the band. It was released April 2, 2007, to the United Kingdom, following &quot;Welcome to the Black Parade&quot; and &quot;Famous Last Words&quot;, both of which were successful hits for the band. The band opted to release &quot;Teenagers&quot; as the third single in the U.S. instead of &quot;I Don't Love You&quot;. The band released the single in Canada, on MuchMusic on March 19.", "published": "Wed, 3 Jun 2009 12:08:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "I Don't Love You", "artist": {"url": "http://www.last.fm/music/My+Chemical+Romance", "mbid": "c07f0676-9143-4217-8a9f-4c26bd636f13", "name": "My Chemical Romance"}, "url": "http://www.last.fm/music/My+Chemical+Romance/_/I+Don%27t+Love+You", "listeners": "435284", "comments": ["OH FUCK! I'll really miss you guys :(", ":((", "I finally might understand this song, and there is almost nothing more painful. [4]", "RIP MCR", "Good.", "one of my many favorites. so wish they stayed together but hey one of there best songs", "Painful Beautiful!", "I finally might understand this song, and there is almost nothing more painful. [3]", "Such a great song! Love it!!", "LOVE this song.", "I finally might understand this song, and there is almost nothing more painful. [2]", "Great breakup song.", "I used to not like this song for some reason...", "Brings back so many memories..", "ахуенный видос", "One of my most favorite songs of all time <3. Add me if we have Super musical compatibility ^^!", "Great song. I LOVE this band.", "The most beautiful sad song ever!", "I love this song !!! ♥♥♥", "I don't love you like I did yesterday."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/emo", "name": "emo"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/my%20chemical%20romance", "name": "my chemical romance"}, {"url": "http://www.last.fm/tag/punk%20rock", "name": "punk rock"}]}, "mbid": "18335c7a-ad38-42c2-8a5e-f5614f2c1f8a", "duration": "237000", "playcount": "3597195", "id": "66084307"}}