{"track": {"album": {"@attr": {"position": "16"}, "title": "In Time: The Best of R.E.M. 1988-2003", "url": "http://www.last.fm/music/R.E.M./In+Time:+The+Best+of+R.E.M.+1988-2003", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/72673954.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/72673954.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/72673954.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/72673954.png", "size": "extralarge"}], "artist": "R.E.M.", "mbid": "08c8f26f-cc49-4a21-b321-feec89d6ffcf"}, "wiki": {"content": "&quot;Everybody Hurts&quot; is a song by R.E.M., originally released on the band's 1992 album Automatic for the People and was also released as a single in 1993. It peaked at #29 on the Billboard Hot 100, #7 on the UK Singles Charts and #3 on the French Singles Chart.\n \n Much of the song was written by drummer Bill Berry, although as R.E.M. shares songwriting credits among its members, it is unknown how much he actually wrote. Berry did not drum on the song — a Univox drum machine took his place — but he was responsible for the sampling of the drum pattern on the track. The string arrangement was written by Led Zeppelin bassist John Paul Jones.\n \n In the liner notes of the album In Time - The Best of R.E.M. 1988-2003, Peter Buck writes that &quot;the reason the lyrics are so atypically straightforward is because it was aimed at teenagers&quot;, and &quot;I've never watched Buffy the Vampire Slayer, but the idea that high school is a portal to hell seems pretty realistic to me.&quot; Incidentally, the song was used in the 1992 film of the same name that preceded the show.\n \n In the video for the song, directed by Jake Scott and filmed along I-10 in San Antonio, Texas, the band is stuck in a traffic jam. It shows the people in other cars and subtitles of their thoughts appear on screen. At the end, all the people leave their cars and walk instead; they then vanish.\n \n In 1995, British emotional support listening service The Samaritans, in response to the high suicide rate but low crisis service take-up amongst young men, launched a UK press advertising campaign consisting solely of the lyrics to &quot;Everybody Hurts&quot; and the charity's hotline number.\n \n The song was placed on R.E.M.'s Warner Brothers &quot;best of&quot; album In Time - The Best of R.E.M. 1988-2003 in 2003. It was one of four songs from Automatic for the People to make the compilation, more than from any other album.\n \n In a 2006 poll for a Five program &quot;Britain's Favourite Break-up Songs&quot;, &quot;Everybody Hurts&quot; was voted 4th.\n \n In October 2007, MuchMoreMusic placed &quot;Everybody Hurts&quot; as number 5 of the Top 40 Most Memorable Music Videos on &quot;Listed&quot;.\n \n The song is included on R.E.M. Live.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Everybody Hurts&quot; is a song by R.E.M., originally released on the band's 1992 album Automatic for the People and was also released as a single in 1993. It peaked at #29 on the Billboard Hot 100, #7 on the UK Singles Charts and #3 on the French Singles Chart.  Much of the song was written by drummer Bill Berry, although as R.E.M. shares songwriting credits among its members, it is unknown how much he actually wrote.", "published": "Thu, 3 Sep 2009 15:27:54 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Everybody Hurts", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Everybody+Hurts", "listeners": "552624", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/rem", "name": "rem"}, {"url": "http://www.last.fm/tag/sad", "name": "sad"}]}, "mbid": "188548dc-0b03-4da9-9fbb-b33455d8629a", "duration": "363000", "playcount": "2808757", "id": "3075254"}}