{"track": {"album": {"@attr": {"position": "11"}, "title": "The Colour and the Shape", "url": "http://www.last.fm/music/Foo+Fighters/The+Colour+and+the+Shape", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69591230.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69591230.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69591230.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69591230.png", "size": "extralarge"}], "artist": "Foo Fighters", "mbid": "02084fd8-5bce-3495-9e9f-86261dcb59a2"}, "wiki": {"content": "Everlong is the second single from Foo Fighters' second album, 1997's &quot;The Colour and the Shape&quot;. It hit #18 in the UK and #3 on the Billboard Modern Rock chart. In 2000, on his first show back from heart surgery, American late night comedian David Letterman introduced the band's performance of the song with &quot;here's my favorite band, performing my favorite song&quot;.  This appearance made Foo Fighters the first band to perform the same song twice on Letterman's &quot;The Late Show&quot; program.\n \n Everlong has been featured in the popular music themed video games Rock Band 2 and Guitar Hero World Tour.\n \n Although the song is normally performed with electric guitars, vocalist/guitarist Dave Grohl's solo acoustic variation gained popularity after an impromptu rendition on Howard Stern's radio show in 1997. The band has often performed the acoustic version of the song live since then.\n \n A common feature of the electric live performances of Everlong involves Dave playing the first two verses and choruses on his own, with the entire band joining in for the final parts of the song. This can be seen on the Hyde Park DVD.\n \n A different acoustic version of this song concludes the 2006 live CD and DVD Skin and Bones.\n \n A muzak version of the chorus appears in the opening and closing scenes of band's music video for &quot;Learn to Fly,&quot; from the subsequent album There Is Nothing Left to Lose.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Everlong is the second single from Foo Fighters' second album, 1997's &quot;The Colour and the Shape&quot;. It hit #18 in the UK and #3 on the Billboard Modern Rock chart. In 2000, on his first show back from heart surgery, American late night comedian David Letterman introduced the band's performance of the song with &quot;here's my favorite band, performing my favorite song&quot;.  This appearance made Foo Fighters the first band to perform the same song twice on Letterman's &quot;The Late Show&quot; program.  Everlong has been featured in the popular music themed video games Rock Band 2 and Guitar Hero World Tour. ", "published": "Mon, 26 Oct 2009 16:45:09 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Everlong", "artist": {"url": "http://www.last.fm/music/Foo+Fighters", "mbid": "67f66c07-6e61-4026-ade5-7e782fad3a5d", "name": "Foo Fighters"}, "url": "http://www.last.fm/music/Foo+Fighters/_/Everlong", "listeners": "1048077", "comments": ["Great song, but can Dave Grohl sound anymore like J Mascis on the verses?", "Hello, i've waited here for you..", "\"Fully deserves its #1 ranking among their songs, with \"The Pretender\" as #2. At least in this case, all is right with the world.\"\r\n\r\nThe Pretender should not be in the top 10 at all compared to all the masterpieces on FF and TCATS. \r\n\r\nBuy why Dave Grohl, WHYYY do you have to play this song so often in a fucking lame acoustic version!? Srsly, it takes all the energy from the song. :(", "At Pedrooi: Agreed", "There's nothing better in this world then this song at the end of a Foos concert", "One of my favorite songs..", "One of the greatest songs of all time, personally prefer my hero though", "AND IIIIIII WONDER, WHEN I SING ALONG WITH YOOOOU!!!!!!!!!! IF ANYTHING COULD EVER FEEL THIS REAL FOREVER, IF ANYTHING COULD COULD EVER BE THIS GOOD AAAAGAAAAIN, THE ONLY THING I'LL EVER ASK OF YOU, YOU GOTTA PROMISE NOT TO STOP WHEN I SAYAYYYYYAYAYYYY WHEN---SHE SANG!! [2]", "Breathe out, so I can breathe you in ...\r\nmmm", "Fully deserves its #1 ranking among their songs, with \"The Pretender\" as #2.  At least in this case, all is right with the world.", "My favorite by them.", "Classic song.", "WHAT A PERFECT SONG", "GREAT TUNE", "love", "Love it!", "...thats such a great song... !!! lovely!!", "Favourite song by them. The acoustic version is even better, in my opinion.", "Bee-yootiful song.", "Great song."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/foo%20fighters", "name": "foo fighters"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}]}, "mbid": "19edc780-577a-4745-8b64-620be1bcb392", "duration": "393000", "playcount": "7591938", "id": "1000235"}}