{"track": {"album": {"@attr": {"position": "8"}, "title": "Achtung Baby", "url": "http://www.last.fm/music/U2/Achtung+Baby", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/60867765.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/60867765.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/60867765.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/60867765.png", "size": "extralarge"}], "artist": "U2", "mbid": "518022a9-bf1e-31ca-9706-599410449d23"}, "wiki": {"content": "Mysterious Ways is the eighth track on U2's 1991 album, Achtung Baby and was released as the album's second single. When the covers to &quot;Even Better Than the Real Thing&quot;, &quot;The Fly&quot;, &quot;Who's Gonna Ride Your Wild Horses&quot;, and &quot;Mysterious Ways&quot; are arranged, a picture of the band members driving a Trabant is formed.\n \n The video had a belly dancing theme, which included distorted shots of Bono dancing, and other mystical images. It was filmed by Stephane Sednaoui in Morocco.\n \n When played live on the Zoo TV Tour, this song featured a belly dancer on stage. The version played was extended, including a longer introduction with a piano part from The Edge. Also, a slide solo is featured after what was the end of the studio version of the song. Both the added intro and outro features added lyrics from Bono, much of which is sung in the falsetto. One of the dancers, Morleigh Steinberg, later married The Edge. It has been played on every tour since it debuted, appearing on every live video release since except for Elevation 2001: Live from Boston (although it was performed at the filmed concert). Edge has always used a Rickenbacker 330-12 for this song.\n \n The song reached #9 on the Hot 100 (the previous single, &quot;The Fly&quot;, had only managed to reach #61) making it one of the band's highest-charting singles in the U.S.; only three other U2 singles (&quot;With or Without You&quot;, &quot;I Still Haven't Found What I'm Looking For&quot;, and &quot;Desire&quot;) have reached higher positions. &quot;Mysterious Ways&quot; also topped both the Modern Rock Tracks chart and the Mainstream Rock Tracks chart. It peaked at #8 on the Dutch Top 40.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Mysterious Ways is the eighth track on U2's 1991 album, Achtung Baby and was released as the album's second single. When the covers to &quot;Even Better Than the Real Thing&quot;, &quot;The Fly&quot;, &quot;Who's Gonna Ride Your Wild Horses&quot;, and &quot;Mysterious Ways&quot; are arranged, a picture of the band members driving a Trabant is formed.  The video had a belly dancing theme, which included distorted shots of Bono dancing, and other mystical images. It was filmed by Stephane Sednaoui in Morocco.  ", "published": "Wed, 12 Aug 2009 21:59:56 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Mysterious Ways", "artist": {"url": "http://www.last.fm/music/U2", "mbid": "704acdbb-1415-4782-b0b6-0596b8c55e46", "name": "U2"}, "url": "http://www.last.fm/music/U2/_/Mysterious+Ways", "listeners": "379400", "comments": ["the best", "A beautiful Irish folksong....mysterious.", "The bass line is Mysterious (5)", "The bass line is mysterious [4]", "The bass line is mysterious [3]", "Love the crunching guitar sound on this classic 80's pop song from those Irish masters.I remember picking this single up at Woolies back in the days when one could buy plastic with plastic.", "I had this song on cassette single. How is this song that old.", "Happy Mondays, Step On [2] does remind of Madchester!", "This track/this CD is absofrickenlutely brilliant. BRILLIANT I SAY!", "Johnny, take a walk with your sister the moon let her pale light in, to fill up your room.", "Solo delirante do The Edge na versão do Slane Castle S2", "oh man, the ZooTV version...", "The bass line is mysterious [2] The bass line is pure eargasm.", "<3 the extra delay over \"GROOVE ON THIS MOMENT\"", "Happy Mondays, Step On ?", "Oh how this song blew my little 12 year old mind back in the day... It's easy to see why. It's an amazing song with an amazing groove and sounds.", "hard to describe,but i do like in a mysterious way =  ]", "So fucking funky", "amo a bono!", "I will never get tired of this! :3"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/u2", "name": "u2"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}]}, "mbid": "1afeb27b-d38f-48d6-839f-f9f074a795c4", "duration": "244000", "playcount": "1706537", "id": "1011916"}}