{"track": {"album": {"@attr": {"position": "5"}, "title": "Origin of Symmetry", "url": "http://www.last.fm/music/Muse/Origin+of+Symmetry", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90577151.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90577151.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90577151.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90577151.png", "size": "extralarge"}], "artist": "Muse", "mbid": "d533a21e-5f9b-4a72-a1c5-3fde4309f234"}, "wiki": {"content": "&quot;Plug In Baby&quot; is a song by English alternative rock band Muse, featured on their 2001 second studio album Origin of Symmetry. \n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=10313\" rel=\"nofollow\">Plug in Baby Songfacts</a>, on the show Muse: The Making of Origin of Symmetry, which aired on the UK radio station Xfm, lead singer Matthew Bellamy described this song as: &quot;A feeling of not being connected to each other, but we are, and it's a feeling of the mind evolving from the body, but when that happens you just get this yearn to do something physical and feel something sensational.&quot;\n \n Released as the lead single from the album on 5 March 2001, &quot;Plug In Baby&quot; became the band's highest-charting single when it peaked at number 11 on the UK Singles Chart, until it was surpassed by &quot;Time Is Running Out&quot; in 2003. \n \n Today, &quot;Plug In Baby&quot; is considered one of Muse's most notable songs, and has been featured on the live albums Hullabaloo Soundtrack (2002) and HAARP (2008). \n \n &quot;Plug In Baby&quot; is often praised for its opening guitar riff; Total Guitar readers voted the riff as the 13th best of all-time in 2004. The beginning of the riff shows similarities to Bach's &quot;Toccata and Fugue&quot;. Bellamy has also stated in a 2005 interview that it elaborates on the riff from DJ Shadow's track Organ Donor.\n \n  The bassline has been noted as being very similar to that of Air's single Sexy Boy, which was released 3 years earlier. \n \n &quot;Plug In Baby&quot; is a featured song in the rhythm video game Guitar Hero 5.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Plug In Baby&quot; is a song by English alternative rock band Muse, featured on their 2001 second studio album Origin of Symmetry.   According to the <a href=\"http://www.songfacts.com/detail.php?id=10313\" rel=\"nofollow\">Plug in Baby Songfacts</a>, on the show Muse: The Making of Origin of Symmetry, which aired on the UK radio station Xfm, lead singer Matthew Bellamy described this song as: &quot;A feeling of not being connected to each other, but we are, and it's a feeling of the mind evolving from the body, but when that happens you just get this yearn to do something physical and feel something sensational.&quot; ", "published": "Thu, 14 Oct 2010 18:43:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Plug In Baby", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Plug+In+Baby", "listeners": "751038", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "1bedf1c8-001a-40f6-bab2-d8c57816c866", "duration": "220000", "playcount": "6110656", "id": "1001677"}}