{"track": {"album": {"@attr": {"position": "2"}, "title": "Greatest Hits II", "url": "http://www.last.fm/music/Queen/Greatest+Hits+II", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92633831.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92633831.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92633831.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92633831.png", "size": "extralarge"}], "artist": "Queen", "mbid": "92faa683-a1a5-4198-a55d-af3471f14c94"}, "wiki": {"content": "&quot;Under Pressure&quot; is a 1981 song by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a> and <a href=\"http://www.last.fm/music/David+Bowie\" class=\"bbcode_artist\">David Bowie</a>. It marked Queen's first released collaboration with another recording artist, and is featured on their 1982 album Hot Space. The song reached #1 on the UK Singles Chart. It was also number 31 on VH1's 100 Greatest Songs of the '80s.\n \n Bowie had originally come to the studios in order to sing backing vocals on another Queen song, &quot;<a title=\"Queen &ndash; Cool Cat\" href=\"http://www.last.fm/music/Queen/_/Cool+Cat\" class=\"bbcode_track\">Cool Cat</a>&quot;. For whatever reason, Bowie was not satisfied with his contribution, and his vocals were removed from the track. \n \n Queen had been working on an earlier version of the song under the title &quot;Feel Like&quot; but were not yet satisfied with the result. The final version that became &quot;Under Pressure&quot; evolved from a jam session the band had with Bowie at his studio in Montreux, Switzerland, therefore it was credited as co-written by the five musicians. According to Queen bassist John Deacon (as quoted in a French magazine in 1984), however, the song's primary musical songwriter was <a href=\"http://www.last.fm/music/Freddie+Mercury\" class=\"bbcode_artist\">Freddie Mercury</a> — though all contributed to the arrangement. The earlier, embryonic version of the song without Bowie , &quot;Feel Like&quot; ,  is widely available in bootleg form.\n \n There has been some confusion about who created the song's famous bass line. John Deacon said (in Japanese magazine Musiclife in 1982, and in the previously mentioned French magazine) that David Bowie had created it. In more recent interviews, Queen guitarist <a href=\"http://www.last.fm/music/Brian+May\" class=\"bbcode_artist\">Brian May</a> and drummer <a href=\"http://www.last.fm/music/Roger+Taylor\" class=\"bbcode_artist\">Roger Taylor</a> have credited the bass riff to Deacon; Bowie also said on his website that the bass line was already written before he became involved. The September 2005 edition of online music magazine Stylus singled out the bass line as the best in popular music history.\n \n Roger Taylor was frequently rumored to be the song's chief writer. However, it appears that he served more as an intermediary for Mercury and Bowie (two of rock music's biggest stars at the time), being friends with both men. Taylor was involved in the production of the track and did some preliminary mixes with Bowie in New York, but Bowie was dissatisfied with these results and wanted to re-record everything (as claimed by May on a November 1982 interview for IM&amp;RW magazine). In the end, the final mix was done with the involvement of Mercury and recording engineer Mack, &quot;under pressure&quot; from Bowie and Taylor (according to Brian May in the same 1982 interview).\n \n Although very much a joint project, only Queen incorporated the song into their live shows at the time. Bowie chose not to perform the song before an audience until the 1992 Freddie Mercury Tribute Concert, when he and Annie Lennox sang it as a duet (backed by the surviving Queen members). However, since Mercury's death and the Outside tour in 1995, Bowie has performed the song at virtually every one of his live shows, with bassist Gail Ann Dorsey taking Mercury's vocal part.\n \n  The song also appeared in setlists from A Reality Tour mounted by Bowie in 2004, when he frequently would dedicate it to Freddie Mercury. Queen + Paul Rodgers have recently performed the song as well. While Bowie was never present for a live performance of the song with Mercury, Roger Taylor instead filled for back-up vocals usually in unison with Mercury as Mercury would take over most of Bowie's parts.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Under Pressure&quot; is a 1981 song by <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a> and <a href=\"http://www.last.fm/music/David+Bowie\" class=\"bbcode_artist\">David Bowie</a>. It marked Queen's first released collaboration with another recording artist, and is featured on their 1982 album Hot Space. The song reached #1 on the UK Singles Chart. It was also number 31 on VH1's 100 Greatest Songs of the '80s.  Bowie had originally come to the studios in order to sing backing vocals on another Queen song, &quot;<a title=\"Queen &ndash; Cool Cat\" href=\"http://www.last.fm/music/Queen/_/Cool+Cat\" class=\"bbcode_track\">Cool Cat</a>&quot;. For whatever reason, Bowie was not satisfied with his contribution, and his vocals were removed from the track.  ", "published": "Tue, 1 Feb 2011 17:42:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Under Pressure", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/Under+Pressure", "listeners": "504180", "comments": ["such a good song", "immortal classic", "Love !!", "'CAUSE LOVE'S SUCH AN OLD FASHIONED WORD ♥", "<3!", "sooo good", "great song !!!!", "The Girl Next Door", "ice, ice ba...er I mean...under pressure! \\m/ (Who wants to see Bowie and/or Freddie bitch slab Vanilla?)", "Really good song, made me a fan of David Bowie in the process to go with my love of Queen", "ein KLASSIKER!!!!", "Nice!", "One of the greatest songs of all time surely?", "einer der besten Songs von Queen", "David Bowie ~_~", "Isn't David Bowie in this song?", "my favorite queen song!", "INSANITY LAUGHS. UNDER PRESSURE WE'RE CRACKING.", "IT'S THE FEAR OF KNOWING WHAT THIS WORLD IS ABOUT, HEARING GOOD FRIENDS SCREAM \"LET ME OUT!!!\"", "Wonderful song <3333333333333"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/glam%20rock", "name": "glam rock"}]}, "mbid": "1f3db7d4-02d1-4b1b-bf19-6eb0f5ef861b", "duration": "236000", "playcount": "3319750", "id": "1008491"}}