{"track": {"album": {"@attr": {"position": "4"}, "title": "Big Shiny Tunes 12 (English Version)", "url": "http://www.last.fm/music/Various+Artists/Big+Shiny+Tunes+12+(English+Version)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/12907867.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/12907867.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/12907867.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/12907867.jpg", "size": "extralarge"}], "artist": "Various Artists", "mbid": ""}, "wiki": {"content": "wikipedia excerpt\n \n &quot;The video begins with a little girl getting out of bed and dancing in a circle with her parents. Suddenly, the scene cuts to a woman struggling with nurses in a psychiatric hospital, then going back into a room with the little girl and her parents dancing.\n \n The scene cuts back to the little girl; her parents let go of her hands and leave, and a man in a sweater approaches her and smiles, then touches her shoulder. The video then begins to cut rapidly back and forth between the woman being restrained in the mental institution and the girl dancing with her parents, who now have tape over their eyes. During this back and forth, the leather restraints turn into arms, bearing the same sleeves as the man in the sweater.\n \n The video goes back to the little girl hiding underneath her bed as the man in the sweater flips it. Suddenly the girl and the man are sitting in a similar position as earlier in the video, but the man is frozen and the girl walks towards the camera. Feathers begin to fall from the top of the screen and a man in black with large black wings is shown. The video momentarily cuts back to the institution, where the woman watches a butterfly fly around on numerous medical instruments. The scene once again shifts back to the little girl, who is now sitting in bed with a large amount of black hand prints on and around her; the camera slowly pans out to show the man in the sweater, his hands covered in black paint.\n \n The scene suddenly shifts to the man with wings struggling with the man in the sweater as the little girl watches from her bed and black feathers fall on her. The scene shifts back to the mental institution, where feathers are similarly falling on the woman. Her restraints disappear in the form of the man's hands letting go of her. She curls into a ball for several moments, then gets out of bed and walks into the camera,while the feathers form the silhouette of wings around her&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "wikipedia excerpt  &quot;The video begins with a little girl getting out of bed and dancing in a circle with her parents. Suddenly, the scene cuts to a woman struggling with nurses in a psychiatric hospital, then going back into a room with the little girl and her parents dancing.  The scene cuts back to the little girl; her parents let go of her hands and leave, and a man in a sweater approaches her and smiles, then touches her shoulder.", "published": "Wed, 1 Jul 2009 01:39:18 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Never Too Late", "artist": {"url": "http://www.last.fm/music/Three+Days+Grace", "mbid": "fabb37f8-eb2a-4cc1-a72a-b56935bbb72d", "name": "Three Days Grace"}, "url": "http://www.last.fm/music/Three+Days+Grace/_/Never+Too+Late", "listeners": "395722", "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/three%20days%20grace", "name": "three days grace"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "2064173d-8293-413b-ad77-fa3882912236", "duration": "209000", "playcount": "3369414", "id": "17225924"}}