{"track": {"album": {"@attr": {"position": "1"}, "title": "The Future Starts Here: The Essential Doors Hits", "url": "http://www.last.fm/music/The+Doors/The+Future+Starts+Here:+The+Essential+Doors+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87574361.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87574361.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87574361.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87574361.png", "size": "extralarge"}], "artist": "The Doors", "mbid": "2d4a66b0-c436-4f44-b3d4-29e6e8db8d8c"}, "wiki": {"content": "&quot;Break on Through (To the Other Side)&quot; is a song by The Doors from their debut album, The Doors. It was the first single released by the band and was unsuccessful compared to later hits, reaching only #126 in the United States. Despite this, it remains one of the band's signature and most popular songs and became a concert staple.\n \n Twenty-four years after its original US release, &quot;Break on Through&quot; became a minor hit in the UK, peaking at #64 in the singles chart.\n \n The song also appears as track one on the band's debut album. Elektra Records' censors objected to the drug use implied by the line &quot;she gets high&quot;, which is repeated in the middle section of the song (after the line &quot;everybody loves my baby&quot;). The original album version and all reissues until the 1990s have the word &quot;high&quot; deleted, with Morrison singing &quot;she gets&quot; four times before a final wail. Live versions and more recent, remastered releases have the full line portion restored.\n \n The song is in 4/4 time and quite fast paced, the tune being similar to that of blues guitarist Elmore James' &quot;Stranger Blues&quot;.\n \n The piece begins with a jazz-flavored drum groove similar the opening phrases played by Billy Higgins on Dexter Gordon's &quot;Soy Califa,&quot; in which a clave pattern is played as a rim click underneath a driving ride cymbal pattern. John Densmore appreciated the new (at the time) Bossa Nova craze coming from Brazil. So he decided to use it in the song.\n \n It is then joined in by a disjointed quirky solo on the organ quite similar to introduction of Ray Charles' &quot;What'd I Say&quot;, which has a few intentional misplaced notes in it, while the bass-line, similar to a typical bass line used in bossa nova, continues almost unhindered all of the way through the song.\n \n Robby's guitar riff initially came from the Paul Butterfield song &quot;Shake Your Moneymaker.&quot; He changed around some of the notes, as well as the beat and came up with the guitar for the song.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Break on Through (To the Other Side)&quot; is a song by The Doors from their debut album, The Doors. It was the first single released by the band and was unsuccessful compared to later hits, reaching only #126 in the United States. Despite this, it remains one of the band's signature and most popular songs and became a concert staple.  Twenty-four years after its original US release, &quot;Break on Through&quot; became a minor hit in the UK, peaking at #64 in the singles chart.  ", "published": "Wed, 19 Jan 2011 00:53:27 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Break on Through (to the Other Side)", "artist": {"url": "http://www.last.fm/music/The+Doors", "mbid": "9efff43b-3b29-4082-824e-bc82f646f93d", "name": "The Doors"}, "url": "http://www.last.fm/music/The+Doors/_/Break+on+Through+(to+the+Other+Side)", "listeners": "873172", "comments": ["This song is fucking good!!!", "good song", "Great song <3", "Music is truly the soundtrack of our lives... ;)", "i love that bass", "RIP Ray.  Go with God. Go jam with Jim now.", "Awesome.", "excellent", "YES.", "I've always known only the censored version and I was quite shocked when I heard \"she gets HIGH\" version :o", "die waren eine der besten .unvergessen", "i realyy do love this song, in my brain often I try to break through everthing, I adore them in this song", "Wow, awesome preview ;)", "rays a god on keys.", "She get high, yeah.", "Shake It!", "Break on throughhhhh to the other sidee.", "Cool band the doors , classy song !!", "Classy shit right here.", "BREAK ON THROUGHYAOWOWOWOWOW"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/psychedelic%20rock", "name": "psychedelic rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/psychedelic", "name": "psychedelic"}]}, "mbid": "20a59f49-5cab-4c27-a541-0bb4ddc88967", "duration": "279000", "playcount": "4934613", "id": "2723288"}}