{"track": {"album": {"@attr": {"position": "2"}, "title": "Nevermind", "url": "http://www.last.fm/music/Nirvana/Nevermind", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83456717.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83456717.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83456717.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83456717.png", "size": "extralarge"}], "artist": "Nirvana", "mbid": "e4520f1b-80fc-4bb8-9f45-0d98ac3c152f"}, "wiki": {"content": "In Bloom is a song by the American grunge band Nirvana. Written by frontman Kurt Cobain, the song addresses people outside of the underground music community who did not understand the band's message, and was also directed towards and written about the bands manager, &quot;He's the one, who likes all our pretty songs, and he likes to sing along, and he likes to shoot his gun, but he don't know what it means&quot;.\n \n Nirvana made its first music video for an early version of &quot;In Bloom&quot; in 1990, however the song did not appear on a commercial release until the release of the group's second album, Nevermind, in 1991. &quot;In Bloom&quot; became the fourth and final single from the album late in 1992. It was accompanied by a music video which parodied musical performances of 1960s variety shows.\n \n Like many Nirvana songs, &quot;In Bloom&quot; shifts back and forth between quiet verses to loud choruses. Cobain uses a Mesa Boogie guitar amplifier for the verses, and during the chorus he switches to a Fender Bassman amp (suggested by Vig) for a heavier, double-tracked fuzztone sound. The rhythm section of Novoselic and Grohl kept its parts simple; Grohl stated it was &quot;an unspoken rule&quot; to avoid unnecessary drum fills, while Novoselic said he felt his role was about &quot;serving the song&quot;. During the choruses, vocalist Cobain and drummer Grohl harmonize while singing &quot;He's the one/Who likes all our pretty songs/And he likes to sing along/And he likes to shoot his gun/But he knows not what it means&quot;. The song's intro reappears at the end of each chorus.\n \n Cobain's lyrics address the people outside of the underground music scene that began showing up at Nirvana shows after the release of the group's debut album Bleach. Nirvana biographer Michael Azerrad wrote, &quot;But remarkably, [the song's lyrics] translated even better to the mass popularity the band enjoyed.&quot; Regarding the song's chorus, Azerrad commented, &quot;The brilliant irony is that the tune is so catchy that millions of people actually do sing along to it.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "In Bloom is a song by the American grunge band Nirvana. Written by frontman Kurt Cobain, the song addresses people outside of the underground music community who did not understand the band's message, and was also directed towards and written about the bands manager, &quot;He's the one, who likes all our pretty songs, and he likes to sing along, and he likes to shoot his gun, but he don't know what it means&quot;.  ", "published": "Thu, 24 Dec 2009 20:51:40 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "In Bloom", "artist": {"url": "http://www.last.fm/music/Nirvana", "mbid": "5b11f4ce-a62d-471e-81fc-a69a8278c7da", "name": "Nirvana"}, "url": "http://www.last.fm/music/Nirvana/_/In+Bloom", "listeners": "1047940", "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/nirvana", "name": "nirvana"}]}, "mbid": "21468df7-e013-47b8-9172-8e104d7389ca", "duration": "255000", "playcount": "5843695", "id": "9955"}}