{"track": {"album": {"@attr": {"position": "13"}, "title": "Meteora", "url": "http://www.last.fm/music/Linkin+Park/Meteora", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/52490659.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/52490659.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/52490659.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/52490659.png", "size": "extralarge"}], "artist": "Linkin Park", "mbid": "3e42e773-ab67-4b20-ae41-0e1cf7510827"}, "wiki": {"content": "<strong>Overview</strong>\n &quot;Numb&quot; is the thirteenth and final song on the 2003 album <a title=\"Linkin Park - Meteora\" href=\"http://www.last.fm/music/Linkin+Park/Meteora\" class=\"bbcode_album\">Meteora</a> by the American nu metal band <a href=\"http://www.last.fm/music/Linkin+Park\" class=\"bbcode_artist\">Linkin Park</a>. It was released as album's third single. One of <a href=\"http://www.last.fm/music/Linkin+Park\" class=\"bbcode_artist\">Linkin Park</a>'s most well known and popular tracks, &quot;Numb&quot; topped the Billboard Hot Modern Rock Tracks chart for 12 weeks. The song spent six weeks at the top of the chart in 2003 and six weeks in 2004, making it the only song in history to be the most successful song of the year on the Hot Modern Rock Tracks chart for two years. The song also spent three weeks atop the Billboard Hot Mainstream Rock Tracks chart and peaked at #11 on the Billboard Hot 100. It has been criticized for sounding similar to a song called &quot;<a title=\"Linkin Park &ndash; Pushing Me Away\" href=\"http://www.last.fm/music/Linkin+Park/_/Pushing+Me+Away\" class=\"bbcode_track\">Pushing Me Away</a>&quot;, which was in their <a title=\"Linkin Park - Hybrid Theory\" href=\"http://www.last.fm/music/Linkin+Park/Hybrid+Theory\" class=\"bbcode_album\">Hybrid Theory</a> album.\n \n The song was later combined with Jay-Zs song &quot;<a title=\"Jay-Z &ndash; Encore\" href=\"http://www.last.fm/music/Jay-Z/_/Encore\" class=\"bbcode_track\">Encore</a>&quot; to create &quot;<a title=\"Linkin Park &amp; Jay-Z &ndash; Numb/Encore\" href=\"http://www.last.fm/music/+noredirect/Linkin+Park+&amp;+Jay-Z/_/Numb%2FEncore\" class=\"bbcode_track\">Numb/Encore</a>&quot;, a massive hit for both artists which was featured on the album Collision Course. A techno remix of &quot;Numb&quot; has received over 3 million views on YouTube. &quot;Numb&quot; was ranked #92 on Rhapsody's list of the Top 100 Tracks of the Decade.\n \n \n <strong>Music Video</strong>\n Directed by Joe Hahn, the indoor scenes of the music video are set in a church in Los Angeles, while the outdoor scenes are set in Prague, in Czech Republic. The school interiors, the classroom, the corridor and the outside playground are set in the Johannes Kepler's High School in Prague.\n \n The video follows the domestic and social problems faced during a day in the life of an unpopular young female student (portrayed by Briana Evigan). The girl apparently spends much of her time drawing pictures, revealing that she probably has dreams of becoming an artist. She is largely ignored and ridiculed at school, considering that when she is told off by the teacher for drawing in class everybody laughs at her, when she trips on the stairs nobody stops to help her up, and that when she tries to join a group of girls at a lunch table they immediately get up and leave. Also, there is a scene where her mother is ridiculing her for not being the daughter she wanted. There are also self-inflicted cut marks on her arms, which actually say &quot;NUMB&quot; - the title of the song. She is shown near the end of the video rubbing the marks after a stressful day, and then deciding to work off her stress by throwing paint instead. At the end of the video, the girl runs into the church that the band was playing in, almost as if she heard them.\n \n Throughout almost the whole video Chester Bennington has his eyes closed, they can just be seen open when he blinks as he sings the word: &quot;Tightly&quot; from the second verse starting: &quot;Can't you see that you're smothering me?&quot;\n \n MuchMusic's 100 Best Videos ranked it at #40.\n \n The track became one of Linkin Park's most critically-acclaimed songs, as well as one of their most commercially successful, peaking at #11 on the U.S. Billboard Hot 100 on February 24, 2004, and spending 3 weeks on top of the Mainstream Rock Tracks and 12 weeks on top of the Modern Rock Tracks. &quot;Numb&quot; was the 33rd best performing single on the Hot 100 during 2004. It was also successful in Oceania, peaking at #10 in Australia and #13 in New Zealand.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Overview\n &quot;Numb&quot; is the thirteenth and final song on the 2003 album <a title=\"Linkin Park - Meteora\" href=\"http://www.last.fm/music/Linkin+Park/Meteora\" class=\"bbcode_album\">Meteora</a> by the American nu metal band <a href=\"http://www.last.fm/music/Linkin+Park\" class=\"bbcode_artist\">Linkin Park</a>. It was released as album's third single. One of <a href=\"http://www.last.fm/music/Linkin+Park\" class=\"bbcode_artist\">Linkin Park</a>'s most well known and popular tracks, &quot;Numb&quot; topped the Billboard Hot Modern Rock Tracks chart for 12 weeks. The song spent six weeks at the top of the chart in 2003 and six weeks in 2004, making it the only song in history to be the most successful song of the year on the Hot Modern Rock Tracks chart for two years.", "published": "Mon, 9 Sep 2013 15:27:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Numb", "artist": {"url": "http://www.last.fm/music/Linkin+Park", "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419", "name": "Linkin Park"}, "url": "http://www.last.fm/music/Linkin+Park/_/Numb", "listeners": "978685", "comments": ["Считаю эту песню безусловным шедевром, классика. Через 20-30-40 лет её так же будут слушать и любить. Хит на все времена, не хуже хитов Пинк Флойд или Депеш Мод.", "Great song of my school years.", "Sparklingly FANTASTIC :*", "great song...", "Love it!", "sometime we all became NUMBs.............. [5]", "sometime we all became NUMBs.............. [4]", "Lol look at my pic- and shout with the shoes beneath...they fit together perfectly  xD\r\nsorry I thought it was funny......", "sometime we all became NUMBs.............. [3]", "sometime we all became NUMBs.............. [2]", "So much truth to this it hurts.", "*_*", "Tired of being what you want me to be...", "Gave me chills!", "Épica ♥ [6]", "Numb :D", "Épica ♥ [5]", "Épica ♥ [4]", "@Red_Pain, soon it will reach for sure. :)", "i still wonder how this song hasn't reached 1,000,000 listeners"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nu%20metal", "name": "nu metal"}, {"url": "http://www.last.fm/tag/linkin%20park", "name": "linkin park"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "22520b2e-f854-4aea-9e38-76e1caa7cd07", "duration": "186000", "playcount": "8115377", "id": "12993259"}}