{"track": {"album": {"@attr": {"position": "12"}, "title": "(What's the Story) Morning Glory?", "url": "http://www.last.fm/music/Oasis/(What%27s+the+Story)+Morning+Glory%3F", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/31381233.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/31381233.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/31381233.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/31381233.png", "size": "extralarge"}], "artist": "Oasis", "mbid": ""}, "wiki": {"content": "&quot;Champagne Supernova&quot; is a song by British rock band Oasis, written by guitarist Noel Gallagher. The seven-minute anthem is the closing track on the record-breaking album (What's the Story) Morning Glory?. Only though released as a single in Australia, France and the United States, a music video directed by Nigel Dick was released to the music channels and, as a result, the song received much television and radio airplay. The song achieved U.S. success, becoming the band's second #1 single on the Modern Rock Tracks chart.\n \n The song is considered a fan-favourite, and has received widespread critical acclaim. Noel Gallagher claimed, in a 2005 interview, that he has still not made up his mind as to what the song actually is about, though he thinks it might be about reincarnation.\n \n According to Songfacts, Noel Gallagher got the title when he misheard the name of the Pixies album Bossanova. He was watching a documentary about champagne at the time.\n \n Check out <a href=\"http://www.songfacts.com/detail.php?id=3495/\" rel=\"nofollow\">http://www.songfacts.com/detail.php?id=3495/</a> for more trivia &amp; information on Champagne Supernova. \n \n Noel Gallagher then had this to say about the song's lyrical content on the bands official website:\n \n     Some of the lyrics were written when I was out of it. There's the words: 'Someday you will find me/ Caught beneath a landslide/ ln a Champagne Supernova in the sky'. That's probably as psychedelic as I'll ever get. It means different things when I'm in different moods. When I'm in a bad mood being caught beneath a landslide is like being suffocated. The song is a bit of an epic. It's about when you're young and you see people in groups and you think about what they did for you and they did nothing. As a kid, you always believed the Sex Pistols were going to conquer the world and kill everybody in the process. Bands like The Clash just petered out. Punk rock was supposed to be the revolution but what did it do? Fuck all. The Manchester thing was going to be the greatest movement on earth but it was fuck all. When we started we decided we weren't going to do anything for anybody, we just thought we'd leave a bunch of great songs. But some of the words are about nothing. One is about Bracket The Butler who used to be on Camberwick Green, or Chipley or Trumpton or something. He used to take about 20 minutes to go down the hall. And then I couldn't think of anything that rhymed with 'hall' apart from 'cannonball'. so I wrote 'Slowly walking down the hall/ Faster than a cannonball' and people were like, 'Wow, fuck , man'. There's also the line 'Where were you while we were getting high?' because that's what we always say to each other. But the number of people who've started clubs called Champagne Supernova is fucking unbelievable. And the album isn't even released yet.\n \n In a 2009 interview, Noel told the following anecdote:\n \n     This writer, he was going on about the lyrics to &quot;Champagne Supernova&quot;, and he actually said to me: ‘You know, the one thing that’s stopping it being a classic is the ridiculous lyrics.’ And I went: ‘What do you mean by that?’ And he said: ‘Well, Slowly walking down the hall, faster than a cannonball — what’s that mean?’ And I went: ‘I don’t fucking know. But are you telling me, when you’ve got 60,000 people singing it, they don’t know what it means? It means something different to every one of them.’\n \n Paul Weller, former frontman of The Jam and friend of Oasis, provided the lead guitar and some of the backing vocals on the track, making it one of the rare times someone other than the Gallagher brothers provided backing vocals on an Oasis song.\n \n The song is included on Oasis' compilation album Stop the Clocks.\n \n &quot;Champagne Supernova&quot; is claimed by Greg Kot and Jim DeRogatis of the Chicago Public Radio show Sound Opinions to be the number one song to hum to yourself when another song is stuck in your head. The other song will be unstuck, but the drawback is that you will then have &quot;Champagne Supernova&quot; stuck in you head due to its infectious and memorable melody.\n \n The song is played at the majority of Oasis concerts. Noel Gallagher has stated that &quot;I think it's the only song, that since it was written, that we've played every night.&quot; During the Morning Glory Tour in 1995/96 and the Be Here Now Tour in 1997/98 the song's ending was usually stretched out by often 5 or so minutes, with Noel Gallagher playing a long improvised guitar solo. An example of one of these performances can be seen on the DVD &quot;...There and Then&quot;.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Champagne Supernova&quot; is a song by British rock band Oasis, written by guitarist Noel Gallagher. The seven-minute anthem is the closing track on the record-breaking album (What's the Story) Morning Glory?. Only though released as a single in Australia, France and the United States, a music video directed by Nigel Dick was released to the music channels and, as a result, the song received much television and radio airplay. The song achieved U.S. success, becoming the band's second #1 single on the Modern Rock Tracks chart. ", "published": "Sun, 16 Aug 2009 10:08:54 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Champagne Supernova", "artist": {"url": "http://www.last.fm/music/Oasis", "mbid": "39ab1aed-75e0-4140-bd47-540276886b60", "name": "Oasis"}, "url": "http://www.last.fm/music/Oasis/_/Champagne+Supernova", "listeners": "753964", "comments": ["THIS is how you end an album.", "where were you while we were getting high", "a timeless beauty", "Great song.  Makes me feel like I missed out on some things back in the 90s, though.", "<3", "Perfect", "Fantastic", "Put on your Bose headphones and turn it up !....Where were you when we were getting high ? You missed it.", "2nd listen here", "my 1st listen on last.fm (woo hoo!)", "6 minutes and 32 seconds of perfection.", "still love coldplay", "Ooh, it must be years since I last heard this one... beautiful. Used to be my favorite song many a millenia ago.", "♥♥♥", "comeback", "♥", "I was probably drinking whiskey while you were getting high.", "I was 11 the first time I heard this song too! This is the one song that made me fall in love with the music of Oasis.", "I first remember hearing/seeing this on MTV back in 96. I was 11. It changed my life.", "Faster than a cannonball!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/britpop", "name": "britpop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "240ac601-8ea0-4a7e-913c-adf745bc9f8d", "duration": "392000", "playcount": "4265798", "id": "15868"}}