{"track": {"album": {"@attr": {"position": "1"}, "title": "Led Zeppelin III", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin+III", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78949293.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78949293.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78949293.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78949293.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "f7af97bf-db4e-39c5-adde-60ee70a5ec4c"}, "wiki": {"content": "Immigrant Song is the opening track on English rock band Led Zeppelin's third album, Led Zeppelin III, written and released in 1970.\n \n The song is famous for its distinctive, wailing cry from vocalist Robert Plant (with a melody reminiscent of &quot;Bali Ha'i&quot;) at the beginning of the song, and is built around a repeating, staccato Jimmy Page/John Paul Jones/John Bonham riff. The hiss at the beginning of the track is feedback from an echo unit.\n \n &quot;Immigrant Song&quot; was written during Led Zeppelin's tour of Iceland, Bath and Germany in mid-1970. The opening date of this tour took place in Reykjavik, Iceland, which inspired Plant to write the song. As he explained:\n “ \tWe weren't being pompous ... We did come from the land of the ice and snow. We were guests of the Icelandic Government on a cultural mission. We were invited to play a concert in Reykjavik and the day before we arrived all the civil servants went on strike and the gig was going to be canceled. The university prepared a concert hall for us and it was phenomenal. The response from the kids was remarkable and we had a great time. &quot;Immigrant Song&quot; was about that trip and it was the opening track on the album that was intended to be incredibly different.”\n \n Just six days after Led Zeppelin's appearance in Reykjavik, the band performed the song for the first time on stage during the Bath Festival.\n \n The song is dedicated to the Icelander Leif Ericson, and is sung from the perspective of Vikings rowing west from Scandinavia in search of new lands. The lyrics make explicit reference to Viking conquests and the Old Norse religion (Fight the horde, sing and cry, Valhalla, I am coming!). In a 1970 radio interview, Plant jokingly recalled:\n         “We went to Iceland, and it made you think of Vikings and big ships... and John Bonham's stomach... and bang, there it was - Immigrant Song!”\n \n &quot;Immigrant Song&quot; is one of Led Zeppelin's few single releases, having been released in November of 1970 by their record label, Atlantic Records, against the band's wishes. It reached #16 on the Billboard charts. Its B side, &quot;Hey Hey What Can I Do&quot;, was otherwise unavailable before the release of the band's first boxed set in 1990. The single was also mistakenly released in Japan with &quot;Out on the Tiles&quot; as the B-side rather than &quot;Hey Hey What Can I Do.&quot; That single is now a rare collectible.\n \n One of the lines from the song became part of Led Zeppelin lore. The line, &quot;The hammer of the gods/will drive our ships to new lands&quot; prompted some people to start referring to Led Zeppelin's sound as the &quot;Hammer of the Gods.&quot; The phrase was used as the title of Stephen Davis' famous biography of the band, Hammer of the Gods: The Led Zeppelin Saga. The lyrics also did much to inspire the classic Heavy metal myth, of mighty Viking-esque figures on an adventure, themes which have been adopted in the look and music of bands from Iron Maiden to Manowar.\n \n &quot;Immigrant Song&quot; was used to open Led Zeppelin concerts from 1970 to 1972. On the second half of their 1972 concert tour of the United States, it was introduced by a short piece of music known as &quot;LA Drone&quot;, designed to heighten the sense of anticipation and expectation amongst the concert audience. By 1973, &quot;Immigrant Song&quot; was occasionally being used as an encore, but was then removed from their live set. Live versions of the song can be heard on the Led Zeppelin albums How The West Was Won (featuring a performance at Long Beach Arena in 1972) and the Led Zeppelin BBC Sessions (a version from the Paris Theatre in London in 1971). When played live, Page played a lengthy guitar solo, which was absent on the recorded Led Zeppelin III version. &quot;Immigrant Song&quot; was played as part of the 2009 Rock and Roll Hall of Fame induction ceremony for Jeff Beck by both Page and Beck.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Immigrant Song is the opening track on English rock band Led Zeppelin's third album, Led Zeppelin III, written and released in 1970.  The song is famous for its distinctive, wailing cry from vocalist Robert Plant (with a melody reminiscent of &quot;Bali Ha'i&quot;) at the beginning of the song, and is built around a repeating, staccato Jimmy Page/John Paul Jones/John Bonham riff. The hiss at the beginning of the track is feedback from an echo unit.  ", "published": "Mon, 4 May 2009 14:36:06 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Immigrant Song", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Immigrant+Song", "listeners": "723640", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/led%20zeppelin", "name": "led zeppelin"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}]}, "mbid": "2760727e-da9e-4f0e-993c-69908a38b3a6", "duration": "145000", "playcount": "4913439", "id": "12745"}}