{"track": {"album": {"@attr": {"position": "1"}, "title": "Forty Licks (disc 2)", "url": "http://www.last.fm/music/The+Rolling+Stones/Forty+Licks+(disc+2)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/54634985.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/54634985.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/54634985.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/54634985.png", "size": "extralarge"}], "artist": "The Rolling Stones", "mbid": ""}, "wiki": {"content": "'Start Me Up' is a song by The Rolling Stones featured on the 1981. album &quot;Tattoo You&quot; and is often used to open the Stones' concerts.\n \n The song opens with what has since become a trademark riff for Keith Richards. It is this, coupled with Charlie Watts' steady backbeat and Bill Wyman's echoing bass, that comprises most of the song. Lead guitarist Ronnie Wood can clearly be heard playing a layered variation of Richards' main riff. Often live versions of the song are lengthened by giving Wood a solo near the middle of the song, pieces of which can be heard throughout the original recording.\n \n 'Start Me Up' peaked at No. 7 on the UK Singles Charts in August 1981., where it remains a significant single as the Stones have not been back into the UK Top 10 since. In Australia, the song reached No. 1 in November 1981. In the United States, 'Start Me Up' spent three weeks at No. 2 on the Billboard Hot 100 chart. It also spent 13 weeks atop the Billboard Top Tracks chart. \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "'Start Me Up' is a song by The Rolling Stones featured on the 1981. album &quot;Tattoo You&quot; and is often used to open the Stones' concerts.  The song opens with what has since become a trademark riff for Keith Richards. It is this, coupled with Charlie Watts' steady backbeat and Bill Wyman's echoing bass, that comprises most of the song. Lead guitarist Ronnie Wood can clearly be heard playing a layered variation of Richards' main riff. Often live versions of the song are lengthened by giving Wood a solo near the middle of the song, pieces of which can be heard throughout the original recording. ", "published": "Tue, 5 May 2009 13:37:12 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Start Me Up", "artist": {"url": "http://www.last.fm/music/The+Rolling+Stones", "mbid": "b071f9fa-14b0-4217-8e97-eb41da73f598", "name": "The Rolling Stones"}, "url": "http://www.last.fm/music/The+Rolling+Stones/_/Start+Me+Up", "listeners": "492960", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/the%20rolling%20stones", "name": "the rolling stones"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "2d7cecca-1e90-4543-857b-62357f8490b7", "duration": "213000", "playcount": "2023830", "id": "16281"}}