{"track": {"album": {"@attr": {"position": "10"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Bruce+Springsteen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91266097.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91266097.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91266097.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91266097.png", "size": "extralarge"}], "artist": "Bruce Springsteen", "mbid": "ce73ebd3-5ae0-35a0-93e8-187bcc7fa47a"}, "wiki": {"content": "&quot;Glory Days&quot; is a 1984 song, written and performed by American rock singer Bruce Springsteen. In 1985 it became the fifth single released from his massively successful album Born in the U.S.A.\n \n &quot;Glory Days&quot; was recorded in April or May 1982 (sources differ) during the first wave of Born in the U.S.A. sessions. Even though the album went through several different phases of what would be on it, &quot;Glory Days&quot; was always seen as one of the cornerstones. The song is a seriocomic tale of a man who now ruefully looks back on the so-called glory days of himself and people he knew during high school. The music is jocular, consisting of what Springsteen biographer Dave Marsh called &quot;rinky-dink organ, honky-tonk piano, and garage-band guitar kicked along by an explosive tom-tom pattern.&quot; It also features a mandolin solo from Steven Van Zandt, one of the sideman's most noticeable instrumental contributions to the Springsteen studio canon.\n \n An alternate mix of &quot;Glory Days&quot; has circulated, which includes a deleted third verse between the second and the last. The missing verse refers to the singer's father sitting on a bar stool at the legion, bitter over his lack of any &quot;glory days.&quot;\n \n The single peaked at #5 on the Billboard Hot 100 pop singles charts in the summer of 1985. It was the fifth of a record-tying seven Top 10 hit singles to be released from Born in the U.S.A. Marsh named the second volume in his biography after the song.\n \n The music video for the song was shot in late May 1985 in various locations in New Jersey, and was directed by filmmaker John Sayles, the third video he had done for the album. It featured a narrative story of Springsteen, playing the protagonist in the song, talking to his young son and pitching to a wooden backstop against an imaginary lineup (he eventually lost the game to Graig Nettles). Intercut with these were scenes of Springsteen and the E Street Band lip-synching the song in a bar. Although he had left the band more than two years earlier, Steven Van Zandt was invited back to perform in this video, along with his sometimes hysterical stage antics.... but the two new members of the band, Nils Lofgren and Patti Scialfa, who had not been on the record at all, were also featured. Springsteen's then-wife Julianne Phillips made a cameo appearance at the baseball field at the end.\n \n The video began airing on MTV in mid-June 1985 and went into heavy rotation.\n \n &quot;Glory Days&quot; became a mainstay of the first set on the 1984-1985 Born in the U.S.A. Tour (prefaced by remarks in which Springsteen declared, &quot;I hated high school!&quot;), then went into the encores for the 1988 Tunnel of Love Express and 1992-1993 &quot;Other Band&quot; Tour, in the latter case serving as the &quot;band introductions&quot; song. It was given a rest for the 1999-2000 Reunion Tour, but then came back to appear in about half the shows on the 2002-2003 Rising Tour. Furthermore Springsteen often plays it in informal bar appearances, since it is one of his simpler songs for other musicians to pick up and play to.\n \n In almost all instances, performances of &quot;Glory Days&quot; are accompanied by considerable Springsteen/E Street Band stage shtick, vamping on the outro, continuing the song on with false endings, everyone but the drummer and keyboard players coming out to stage front in a line, and so forth. A good example of the elongated concert &quot;Glory Days&quot; was on a highly-promoted July 30, 2002 appearance on The Today Show broadcasting from Asbury Park, New Jersey. Later in The Rising Tour, the song would become further extended by incorporating a long boogie-woogie organ solo from Danny Federici. Steven Van Zandt makes his vocals shine on this song, most recently on the Springsteen's Magic Tour.\n \n Springsteen made a surprise appearance on Late Night With David Letterman on June 25, 1993 and played &quot;Glory Days&quot;. This was Letterman's last appearance on NBC.\n \n Glory Days was played during Michael J. Fox's farewell scene during the season finale of the fourth season of Spin City.\n \n Glory Days was performed at the 2009 Super Bowl half-time show with minor lyric changes appropriate to the occasion (football player instead of baseball player, &quot;Hail Mary&quot; instead of &quot;speedball&quot;.) During the song, Springsteen told Steve Van Zandt that they were going over their allotted 12 minutes, and Van Zandt responded that they should keep playing anyway.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Glory Days&quot; is a 1984 song, written and performed by American rock singer Bruce Springsteen. In 1985 it became the fifth single released from his massively successful album Born in the U.S.A.  &quot;Glory Days&quot; was recorded in April or May 1982 (sources differ) during the first wave of Born in the U.S.A. sessions. Even though the album went through several different phases of what would be on it, &quot;Glory Days&quot; was always seen as one of the cornerstones. The song is a seriocomic tale of a man who now ruefully looks back on the so-called glory days of himself and people he knew during high school.", "published": "Sun, 6 Dec 2009 01:06:20 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Glory Days", "artist": {"url": "http://www.last.fm/music/Bruce+Springsteen", "mbid": "70248960-cb53-4ea4-943a-edb18f7d336f", "name": "Bruce Springsteen"}, "url": "http://www.last.fm/music/Bruce+Springsteen/_/Glory+Days", "listeners": "254954", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/bruce%20springsteen", "name": "bruce springsteen"}, {"url": "http://www.last.fm/tag/the%20boss", "name": "the boss"}]}, "mbid": "315bde95-b63c-4bd8-a591-2795bc1dab8d", "duration": "227000", "playcount": "1032254", "id": "1005793"}}