{"track": {"album": {"@attr": {"position": "2"}, "title": "Minutes to Midnight", "url": "http://www.last.fm/music/Linkin+Park/Minutes+to+Midnight", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82991005.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82991005.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82991005.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82991005.png", "size": "extralarge"}], "artist": "Linkin Park", "mbid": "630ea5d2-7139-4d30-81b4-f6a8fb59a73a"}, "wiki": {"content": "&quot;Given Up&quot; is a song by Linkin Park, the song was released as the fourth single from their third studio album Minutes to Midnight. It was released on February 17, 2008 in United Kingdom as a digital download. The song was not as much as a success upon what was expected in the U.S, although it did manage to chart high on the Hot Modern Rock Tracks and the Hot Mainstream Rock Tracks.\n \n &quot;Given Up&quot;, along with the hit singles &quot;What I've Done&quot; and &quot;Bleed It Out&quot;, made its live debut on April 28, 2007 in Berlin, Germany. Live performances of these three songs at the AOL sessions were released on AOL on May 5, 2007. The performance of the song is available on the &quot;Bleed It Out&quot; CD single.\n \n &quot;Given Up&quot; is one of the heavier songs on the album. It notably features a eighteen second-long scream by Chester Bennington before the final chorus, as well as a steady guitar riff for the choruses of the song. The scream is split into two 9 second long screams when performed live allowing Chester to catch his breath, although he has completed the full scream in various live performances. It dawns a distinctive jingle sound during the verses and intro, generated by the jingling of guitarist Brad Delson's keys and a steady clapping beat by Mike Shinoda. The song was made available as a single on March 3, 2008. It is included as a master track in the Xbox 360, PlayStation 3, and Nintendo Wii versions of the music video game Rock Revolution. The song was also used in the trailer and commercials for the action film Crank 2: High Voltage, in which Bennington makes a cameo.\n \n In June 2007, the official Billboard website gave information stating that &quot;Given Up&quot; and &quot;Shadow of the Day&quot; would be the next two singles from Minutes to Midnight, following &quot;What I've Done&quot;. This proved incorrect after &quot;Bleed It Out&quot; was promoted to single status. On January 24, 2008, it was announced that &quot;Given Up&quot; would be the band's next single after &quot;Shadow of the Day&quot;, released on October 16, 2007. The single was released as digital download on February 17, 2008 along with a cover art.\n \n On Chester Bennington's official blog, he stated when the video was being shot and that it features live performance from the band. Bennington told the crowd at the MEN Arena and the O2 Arena during shows on January 27 and 29 that the performance of &quot;Given Up&quot; was recorded for use in the video although cameras were also visible during the performance of the song at the concert on January 28 at the O2 Arena. Linkin Park had officially finished filming the video on February 6, according to Billboard. The video premiered on the band's official website on March 3, 2008 at 4p.m. Pacific Standard Time (Midnight UTC). The video was uploaded to the band's YouTube  channel on March 4, 2008. The video was directed by Mark Fiore, the band's videographer.\n \n The video consists of live clips from the shows (stated above) and has been edited together in a sharp, rugged manner which contains short cut scenes with many special effects mainly altering the coloring. Transitions between cut scenes are in a style of warn analog tape distortion giving the video an even more rugged, tough appearance. Bennington performs his seventeen-second scream perched on the guard rail, inches from the audience. Throughout the video several flash scenes appear such as a cowboy, hippopotamus and quotes from &quot;Magical Thinking: True Stories&quot; (chapter &quot;Commercial Break&quot;) a book by the Augusten Burroughs. Frames from the Linkin Park videos &quot;One Step Closer&quot;, &quot;Papercut&quot;, &quot;What I've Done&quot;, &quot;Numb&quot;, and &quot;Breaking the Habit&quot; can also be seen through out the video.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Given Up&quot; is a song by Linkin Park, the song was released as the fourth single from their third studio album Minutes to Midnight. It was released on February 17, 2008 in United Kingdom as a digital download. The song was not as much as a success upon what was expected in the U.S, although it did manage to chart high on the Hot Modern Rock Tracks and the Hot Mainstream Rock Tracks.  &quot;Given Up&quot;, along with the hit singles &quot;What I've Done&quot; and &quot;Bleed It Out&quot;, made its live debut on April 28, 2007 in Berlin, Germany.", "published": "Thu, 18 Feb 2010 14:57:53 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Given Up", "artist": {"url": "http://www.last.fm/music/Linkin+Park", "mbid": "f59c5520-5f46-4d2c-b2c4-822eabf53419", "name": "Linkin Park"}, "url": "http://www.last.fm/music/Linkin+Park/_/Given+Up", "listeners": "501324", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/nu%20metal", "name": "nu metal"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/linkin%20park", "name": "linkin park"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "32774d17-4c9a-41af-b39c-ec976bf540cd", "duration": "189000", "playcount": "4079618", "id": "97664690"}}