{"track": {"album": {"@attr": {"position": "9"}, "title": "Nirvana", "url": "http://www.last.fm/music/Nirvana/Nirvana", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91771383.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91771383.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91771383.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91771383.png", "size": "extralarge"}], "artist": "Nirvana", "mbid": "56a92998-6dcc-36a9-9efc-5b7096ee0e41"}, "wiki": {"content": "<strong>&quot;Heart-Shaped Box&quot;</strong> is a song by the American grunge band Nirvana, written by vocalist and guitarist Kurt Cobain released as the first single from the group's third studio album In Utero in 1993. It was one of two songs from the album mixed by Scott Litt in order to augment the original production by producer Steve Albini. While Nirvana's label DGC Records did not release a physical single for sale in the United States, &quot;Heart-Shaped Box&quot; received much American radio airplay, reaching number one on the Billboard Modern Rock Tracks chart. The international release of the single reached number five in the United Kingdom.\n \n <strong>Origin and recording</strong>\n Kurt Cobain wrote &quot;Heart-Shaped Box&quot; in early 1992. Cobain forgot about the song for a while, but began working on it again when he and his wife Courtney Love moved to a house in the Hollywood Hills. In a 1994 Rolling Stone interview, Love said she overheard him working on the song's riff in a closet. She said she asked him if she could use the riff for one of her songs, to which he replied, &quot;Fuck off!&quot; and closed the closet door. &quot;He was trying to be so sneaky&quot;, said Love. &quot;I could hear that one from downstairs.&quot; The couple shared a journal in which they would write lyrics; Cobain biographer noted that Love's songwriting sensibility informed Cobain's on the song. The song's name came from a heart-shaped box Love had given Cobain. However, Cobain had originally titled the song &quot;Heart-Shaped Coffin&quot;.\n \n Nirvana had difficulty completing the song. Cobain attempted to have the rest of the band complete the song during jam sessions. He said, &quot;During those practices, I was trying to wait for Chris and Dave to come up with something but it just turned into noise all the time.&quot; One day Cobain made one last attempt at completing the song. Cobain was able to come up with a vocal melody and the band finally finished writing the song. Cobain said that when they completed &quot;Heart-Shaped Box&quot;, &quot;We finally realized that it was a good song.&quot;\n \n In January 1993, the band recorded a demo of &quot;Heart-Shaped Box&quot; during sessions with Craig Montgomery in Rio de Janeiro, Brazil; it was the first song recorded. The In Utero version was recorded in February 1993 by Steve Albini in Cannon Falls, Minnesota. It was remixed, along with &quot;All Apologies&quot; and later &quot;Pennyroyal Tea,&quot; by Scott Litt prior to the album's release. Cobain was unapologetic about the band's decision, and maintained that the vocals and bass were not prominent enough in the original mixes. Nirvana bassist Krist Novoselic was also unhappy with the original mix of &quot;Heart-Shaped Box.&quot; In a 1993 Chicago Sun-Times interview, he said the original effect used on the song's guitar solo sounded &quot;like a fucking abortion hitting the floor.&quot; When the song was remixed by Scott Litt, Cobain took the opportunity to add acoustic guitar and backing harmonies.\n \n <strong>Composition and lyrics</strong>\n Journalist Gillian Gaar described &quot;Heart-Shaped Box&quot; as &quot;the Nirvana formula personified, with a restrained, descending riff played through the verse, building in intensity to the cascading passion of the chorus&quot;.[1]\n \n Cobain said the song was inspired by documentaries about children with cancer. He told biographer Michael Azerrad, &quot;Anytime I think about it, it makes me sadder than anything I can think of.&quot; Azerrad asserted in his biography of Nirvana, Come as You Are: The Story of Nirvana, that despite Cobain's explanation, the song actually appeared to be about Courtney Love. Charles Cross wrote in his biography of Cobain Heavier Than Heaven that with the lyric &quot;I wish I could eat your cancer when you turn black&quot;, Cobain &quot;sang in what has to be the most convoluted route any songwriter undertook in pop history to say 'I love you'&quot;. Cobain said that the song's chorus of &quot;Hey/Wait/I've got a new complaint&quot; was him giving an example of how he was perceived by the media.\n \n <strong>Release</strong>\n In the United States, DGC issued &quot;Heart-Shaped Box&quot; to college, modern rock, and album-oriented rock radio stations in early September 1993. There were no plans to release a single for the song domestically. At the time, Geffen Records' head of marketing told Billboard that the label was not actively courting Top 40 radio, explaining &quot;Nirvana didn't sell nearly 5 million [records] because of a hit single. They sold that many albums because of who they are.&quot; The song entered the Billboard Modern Rock Tracks chart at number seven, and eventually peaked at number one on the chart. The song also reached number four on the Mainstream Rock Tracks chart. A single of the song was released in the United Kingdom, where it peaked at number on five on the UK Singles Chart.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Heart-Shaped Box&quot; is a song by the American grunge band Nirvana, written by vocalist and guitarist Kurt Cobain released as the first single from the group's third studio album In Utero in 1993. It was one of two songs from the album mixed by Scott Litt in order to augment the original production by producer Steve Albini. While Nirvana's label DGC Records did not release a physical single for sale in the United States, &quot;Heart-Shaped Box&quot; received much American radio airplay, reaching number one on the Billboard Modern Rock Tracks chart.", "published": "Fri, 19 Jun 2009 17:25:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Heart-Shaped Box", "artist": {"url": "http://www.last.fm/music/Nirvana", "mbid": "5b11f4ce-a62d-471e-81fc-a69a8278c7da", "name": "Nirvana"}, "url": "http://www.last.fm/music/Nirvana/_/Heart-Shaped+Box", "listeners": "889868", "comments": ["Jeden z najlepszych kawałków Nirvany.", "What's up with this thing where you write down a line from the song? It's fucking in there ok!", "I wish they had done the mix differently, but the wigs wanted it mixed for this radio feel, so that's what we have. There are some cool alt mixes off of Nevermind that are good.", "Literally took me to nirvana.", "I love Kurt", "Hey! Wait! I got a new complaint!", "never liked this one", "this is like one of the best songs ever created.", "Should listed the album as In Utero, (IMO) a much better album than the best of Nirvana. Whatever, still great :D", "Best Song Ever!!!!!!!!", "~<>{8]", "What else is there to say really?", "If I could even choose a favorite Nirvana song, (which is hard as hell) this very well might be it. RIP Cobain meeting you woulda been an honor.", "she eyes me like a Pisces when I am weak.", "forever in debt to your priceless advice. its about my ex", "never gets old [2]", "never gets old", "play loud [2]", "This song is so painfully perfect. [2]", "Anyone who thinks that this is the only great Nirvana song has probably only heard this one song."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/nirvana", "name": "nirvana"}]}, "mbid": "3b026816-c789-4ae8-a002-0fbbc5d4b67a", "duration": "281000", "playcount": "5850123", "id": "1005698"}}