{"track": {"album": {"@attr": {"position": "17"}, "title": "Greatest Hits II", "url": "http://www.last.fm/music/Queen/Greatest+Hits+II", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92633831.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92633831.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92633831.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92633831.png", "size": "extralarge"}], "artist": "Queen", "mbid": "92faa683-a1a5-4198-a55d-af3471f14c94"}, "wiki": {"content": "&quot;<strong>One Vision</strong>&quot; is a song of the British band <strong><a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a></strong> . The song originally began as a song written by <strong><a href=\"http://www.last.fm/music/Roger+Taylor\" class=\"bbcode_artist\">Roger Taylor</a></strong> about Martin Luther King, Jr., including lyrical references to King’s &quot;I Have A Dream&quot; speech, delivered on the steps of the Lincoln Memorial in Washington, D.C. in 1963. As evident in the &quot;documentary&quot; filmed of the &quot;making of&quot; the song, he other three members of the band provided their input, though the lion's share of the editing was due in part to Freddie.\n \n  First released as a single in 1985 , the song was included on the 1986 album A Kind of Magic. This song was one of the few songs from A Kind Of Magic that was not featured in the movie Highlander, but instead it was featured in the movie Iron Eagle. \n \n The song was included in all Queen's live concert performances of the 1986 Magic Tour, as the very first song of each concert. They claimed they chose &quot;One Vision&quot; as the introduction song because its intro made a perfect concert introduction.\n \n <span style=\"text-decoration:underline;\">Interviews with Queen:</span>\n \n <strong>Roger Taylor - 2003, Greatest Video Hits 2 DVD commentary:</strong>\n \n  &quot;It was basically my lyric with the others putting in the odd line. It was a good collaboration of that song.&quot;\n \n <strong>Brian May - 2003, Greatest Video Hits 2 DVD commentary:</strong>\n \n &quot;We made a very rare decision to have documentary cameras in there while we were recording, but the documentary cameras actually ruined the whole thing, because I think everyone was so conscious of them being there – everyone sort of played to the cameras. And when I watch any pieces of that now, I think it's totally false.&quot;\n \n &quot;There's a lot of influences on here: the drum solo on here is just an opportunity to do strange, psychedelic things.&quot;\n \n \n <strong>John Deacon - 1985, Greatest Video Hits 2 DVD:</strong>\n \n &quot;Freddie was on the phone, and he wanted to go back into the studio and do some more recording. So, in the end, we went back into the studio, and we actually recorded another single. It was his idea, really, that we could go in and actually write a song together. In fact, I was late getting to the recording sessions because I was on holiday at the time, but it's credited as a Queen composition, but to be honest, I would say it was mainly Roger, Brian, and Freddie that did most of the writing for it.&quot;\n \n <strong>Roger Taylor - 1986 - Making of One Vision :</strong>\n \n R.T.: &quot;The original words were actually about Martin Luther King, Jr., and now I haven't got a clue what it's about! Somebody said it was about Bob Geldof, but I don't think it is.&quot;\n \n Interviewer: Do you know the meaning of the original set of lyrics?\n \n RT: &quot;No, not anymore! Well, they changed my words!&quot;\n \n I: Who did?\n \n RT: &quot;That rotter Freddie!&quot;\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;One Vision&quot; is a song of the British band <a href=\"http://www.last.fm/music/Queen\" class=\"bbcode_artist\">Queen</a> . The song originally began as a song written by <a href=\"http://www.last.fm/music/Roger+Taylor\" class=\"bbcode_artist\">Roger Taylor</a> about Martin Luther King, Jr., including lyrical references to King’s &quot;I Have A Dream&quot; speech, delivered on the steps of the Lincoln Memorial in Washington, D.C. in 1963. As evident in the &quot;documentary&quot; filmed of the &quot;making of&quot; the song, he other three members of the band provided their input, though the lion's share of the editing was due in part to Freddie.  ", "published": "Sat, 12 Sep 2009 02:41:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "One Vision", "artist": {"url": "http://www.last.fm/music/Queen", "mbid": "0383dadf-2a4e-4d10-a46a-e9e041da8eb3", "name": "Queen"}, "url": "http://www.last.fm/music/Queen/_/One+Vision", "listeners": "324149", "comments": ["Very Good!", "\"There's only One Direction...\" Oh Freddie, how right you were :( *save us Zombie Freddie Mercury*", "FRIED CHICKEN!", "Fried Chicken rules!", "FRIED CHICKEN", "Awesome!!", "GEBT MIR EIN LEITBILD JAAAA JAAAA JAWOLL", "This is my favorite queen song.", "Loved this on Hungarian Rhapsody '86 film opening.", "I still think of the movie 'Iron Eagle' whenever I hear this song. Every time.", "A+", ":)...........", "So gebt mir ein Leitbild!", "i love this song", "the complete absurdity of that final payoff line always makes me smile.  :D", "Fried chicken, cheahhhhh", "Soundservant, oh it comes out when Laibach covered this song. Entitled, 'Geburt Einer Nation'. Laibach ftw!", "gimme gimme gimme fried chicken!", "did anyone interpret this song to be about supremacy?", "Fried Chicken!![6786]<<<well i guess a lot of people have said it already but i can't be arsed looking through the comments"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/queen", "name": "queen"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "3c5bdebf-67db-4d2d-97bf-8f7a22e83d76", "duration": "309000", "playcount": "1443270", "id": "1008474"}}