{"track": {"album": {"@attr": {"position": "7"}, "title": "The Suburbs", "url": "http://www.last.fm/music/Arcade+Fire/The+Suburbs", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/50128417.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/50128417.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/50128417.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/50128417.png", "size": "extralarge"}], "artist": "Arcade Fire", "mbid": "1cf9ad6c-ae66-333f-9690-604daca42564"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Half Light I", "artist": {"url": "http://www.last.fm/music/Arcade+Fire", "mbid": "52074ba6-e495-4ef3-9bb4-0703888a9f68", "name": "Arcade Fire"}, "url": "http://www.last.fm/music/Arcade+Fire/_/Half+Light+I", "listeners": "318134", "comments": ["This song is still absolutely magical, I'm sad to see it never gets much appreciation, might be their most underappreciated song (besides Vampire/Forest Fire).", "This is the best song on The Suburbs and possibly Arcade Fire's most underrated song.", "Sometimes I almost cry when listening to this.", "Why was the last shout for this song almost a year ago? It's so peaceful, beautiful, brilliant.", "This song is growing on me more and more every day. It's so sweet and delicate. \"You told us that we were too young. Now the night's closing in and in the half light we run. Lock us up safe, and hide the key. But the night tears us loose and in the half light we're free.\" Oh, I love these lyrics so much. Win and Régine sing it in such a lovely, innocent way. I love everything about this song, this album and this band.", "A standout track on an album of standout tracks.", "That moment when the street lights turn on before the sun completely sets.", "I love how the shared lead vocals sound. Best off of The Suburbs.", "I don't think i can express what i feel about this song so I just listen to it again.", "Such an intense sense of nostalgia. Captured the feeling of 'The Suburbs' as a concept perfectly.", "It gives me a nostalgic feeling, it's feels like when I was a little boy and was playing with friends in the neighborhood till the sunset. Life was so simple those days.", "everything about this song is beautiful. \"our heads are just houses without enough windows\" gets me every time... so many chills. best. band. ever.", "The drums on this one are very very great. The entire arrangement is great too! Sometimes I tend to take the whole great stuff about Arcade Fire for granted - but they are awesome at arrangements, ideas, songwriting, vocals, EVERYTHING. Wow.", "This is definitely one of the better songs on Suburbs.", "amazing song", "how people can dislike this is beyond me, it is one of the best off the album without a doubt", "the best off the suburbs for me, along with suburban war :), gorgeous song", "favouriteeeeee", "Amazing lead-in to II", "I have to say it, the best songs in The Suburbs are the ones sung by Regine."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/canadian", "name": "canadian"}]}, "mbid": "3d4d89da-d989-4e2f-9389-5a4fea9dc6c6", "duration": "254000", "playcount": "2028210", "id": "423294921"}}