{"track": {"album": {"@attr": {"position": "17"}, "title": "rearviewmirror (greatest hits 1991-2003)", "url": "http://www.last.fm/music/Pearl+Jam/rearviewmirror+(greatest+hits+1991-2003)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91484683.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91484683.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91484683.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91484683.jpg", "size": "extralarge"}], "artist": "Pearl Jam", "mbid": ""}, "wiki": {"content": "&quot;Yellow Ledbetter&quot; is a song by the American rock band Pearl Jam. Featuring lyrics written by vocalist Eddie Vedder and music co-written by bassist Jeff Ament and guitarist Mike McCready, &quot;Yellow Ledbetter&quot; was selected by the band to be the second B-side to the 1992 single for the song &quot;Jeremy&quot;, which was where it first appeared. The song eventually found its way onto radio, peaking at number 21 on the Billboard Mainstream Rock Tracks chart. The song was included on the 2003 B-sides and rarities album, Lost Dogs, and on Pearl Jam's 2004 greatest hits album, rearviewmirror (Greatest Hits 1991–2003). It's guitar solo is ranked 95 on Guitar World's &quot;100 Greatest Guitar Solos&quot;.\n \n &quot;Yellow Ledbetter&quot; was a Ten outtake and one of the first songs Pearl Jam wrote as a group. The song features lyrics written by vocalist Eddie Vedder and music co-written by bassist Jeff Ament and guitarist Mike McCready. McCready's guitar play on &quot;Yellow Ledbetter&quot; bears strong similarities to the guitar style of Jimi Hendrix with the mimicking of Hendrix's &quot;May This Be Love&quot; from the 1967 album, Are You Experienced, and &quot;Little Wing&quot; from the 1967 album, Axis: Bold as Love. The version of &quot;Yellow Ledbetter&quot; that was eventually released was the second take of the song. McCready on the song:\n \n     That was written around the time of the first record [1991's Ten]. I think that was the second thing Ed and I wrote together. It came out of a jam in the studio and Ed didn't really have any lyrics. He came up with some ideas right there on the spot, and that's what we recorded. For some reason, it didn't make it on Ten. I was kind of bummed at the time. I really wanted it to be on our first record. But at the time, I was really young and just happy to be around this situation, so I did whatever.\n \n &quot;Yellow Ledbetter&quot; is based on a I-V-IV chord progression in the key of E major. McCready plays his Stratocaster on the track in the style of Jimi Hendrix, incorporating hammerons and pulloffs into the subtle chord work. He makes expressive use of the guitar's whammy bar during the solo, bending notes to create a vacuum-like sound.\n \n The song title &quot;Yellow Ledbetter&quot; is derived from the actual name of an old friend of Vedder from Chicago, named Tim Ledbetter. The lyrics of &quot;Yellow Ledbetter&quot; have proven undecipherable when heard live and even on the early recorded version, as Vedder mumbles through much of the song with only certain parts being heard prominently, such as the famous line at the end of each verse &quot;I said, I don’t know whether I was the boxer or the bag,&quot; with these parts of the song heard on almost every live rendition of the song. There are many unofficial lyrics on various websites.\n \n Although many fans have made their own interpretations of the song, a common theory has been that the song is about someone receiving a letter and finding his or her brother had died overseas in war, cited from the lyrics in the Live at the Garden version &quot;I don't know whether my brother will be coming home in a box or a bag&quot;. On the official bootleg release of 5/3/03 - State College, Pennsylvania, Vedder sings &quot;I'd like to wish this war away, and I tried but it just, just don't happen, don't happen that way/And my brother...they sent him off to fight for the flag, I just, I don't hope he comes home in a box or a bag&quot;, and &quot;And I know that he's just following his path, as long, as long as it's not a box or a bag.&quot; On the official bootleg release of 7/11/03 - Mansfield, Massachusetts, Vedder sings in the first verse &quot;I think of him when I go to bed, and he's coming home in a box or a bag.&quot;\n \n Regarding the song, Vedder said in an online chat that it was written around the time of the Gulf War, and added that &quot;it's an anti-patriotic song, actually.&quot; On August 7, 2008, at a solo performance in Newark, New Jersey at the New Jersey Performing Arts Center, Vedder took a question from the audience requesting that he explain the meaning of &quot;Yellow Ledbetter&quot;. At first, Vedder joked, saying, &quot;Wait...you mean there's lyrics?&quot; He went on to talk about how the song took as its subject a friend of his from Seattle whose brother served in the first Gulf War. His friend received a &quot;yellow letter&quot; in the mail informing him that his brother had died in the war. Vedder and his friend then went for a walk. On this walk, the friend, whom Vedder described as &quot;alternative-looking,&quot; happened by a house with an American flag flying, and people on the porch. He stopped and gestured to the flag, as if to salute it, however the people on the porch glared at him disapprovingly due to his appearance.\n \n Without being released as a single, &quot;Yellow Ledbetter&quot; peaked at number 21 on the Billboard Mainstream Rock Tracks chart and number 26 on the Billboard Modern Rock Tracks chart in 1994. The song has managed to become a staple among fans of the band. Although the song has never been released on one of the band's studio albums, it remains to this day one of the band's most popular songs.\n \n Steve Huey of Allmusic said that McCready's &quot;airy Hendrix imitations provide the essential meat of the song.&quot; He added, &quot;Eddie Vedder's vocal is alternately intense and achingly wistful, with the latter particularly suiting the song's mood.&quot; He proclaimed &quot;Yellow Ledbetter&quot; as &quot;the sound of a band overflowing with prime material.&quot; Will Hermes of Spin said, &quot;The Hendrix-indebted power ballad &quot;Yellow Ledbetter&quot; is some of the best Pearl Jam music ever recorded.&quot; In 2007, McCready's guitar solo from &quot;Yellow Ledbetter&quot; was featured on Guitar World's &quot;100 Greatest Guitar Solos&quot; list.\n \n A snippet of the song was used in the final episode of the television series Friends in 2004. This marked the first time that Pearl Jam licensed a song for usage in a television show. It was also featured in the Cold Case episode &quot;The Long Blue Line&quot; in 2009.\n \n The first full live performance of &quot;Yellow Ledbetter&quot; occurred at the band's November 6, 1993 concert in Mesa, Arizona at the Mesa Amphitheatre. &quot;Yellow Ledbetter&quot; is frequently performed at Pearl Jam concerts, generally as the last song of the concert. The freeform nature of the song allows Pearl Jam to improvise and change the song around when performing it live. During performances, McCready often lengthens the outro, sometimes incorporating various songs which have influenced his playing style, such as &quot;Little Wing&quot;. Similarly, Vedder almost always changes the lyrics around, sticking with the same rhythm as the original recording. Live performances of &quot;Yellow Ledbetter&quot; can be found on the &quot;Daughter&quot; single, the Tibetan Freedom Concert compilation box set, various official bootlegs, the live album Live at Benaroya Hall, and the Live at the Gorge 05/06 box set. Performances of the song are also included on the DVDs Live at the Showbox and Live at the Garden. A performance of the song is also included on the DVD Immagine in Cornice as one of the Special Features. The version of the song on Tibetan Freedom Concert is a performance by Vedder and McCready and was recorded live at the Tibetan Freedom Concert.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Yellow Ledbetter&quot; is a song by the American rock band Pearl Jam. Featuring lyrics written by vocalist Eddie Vedder and music co-written by bassist Jeff Ament and guitarist Mike McCready, &quot;Yellow Ledbetter&quot; was selected by the band to be the second B-side to the 1992 single for the song &quot;Jeremy&quot;, which was where it first appeared. The song eventually found its way onto radio, peaking at number 21 on the Billboard Mainstream Rock Tracks chart.", "published": "Wed, 20 May 2009 22:32:07 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Yellow Ledbetter", "artist": {"url": "http://www.last.fm/music/Pearl+Jam", "mbid": "83b9cbe7-9857-49e2-ab8e-b57b01038103", "name": "Pearl Jam"}, "url": "http://www.last.fm/music/Pearl+Jam/_/Yellow+Ledbetter", "listeners": "299761", "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/pearl%20jam", "name": "pearl jam"}]}, "mbid": "3ed00b7a-7603-4807-bd2e-954c944c762f", "duration": "365000", "playcount": "1819616", "id": "1075786"}}