{"track": {"album": {"@attr": {"position": "1"}, "title": "The Very Best Of Sting And The Police", "url": "http://www.last.fm/music/Sting/The+Very+Best+Of+Sting+And+The+Police", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/70135676.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/70135676.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/70135676.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/70135676.png", "size": "extralarge"}], "artist": "Sting", "mbid": ""}, "wiki": {"content": "&quot;Message in a Bottle&quot; is a 1979 song by The Police, from their second album, Reggatta de Blanc.\n \n The song is ostensibly about a castaway on an island, who sends out a message in a bottle to seek help. A year later, he feels that there is no need for love. Later on, he sees &quot;a hundred billion bottles&quot; on the shore, finding out that there are more people like him out there. The Police debuted the song on live television.\n \n &quot;Message in a Bottle&quot; may also be read as a lament of isolation and loneliness caused by the loss of a loved one (&quot;love can break your heart&quot;): he seeks help but gets no reply, then realises that there are many more people out there like him, suggesting that everyone has to deal with loss and loneliness as part of the human experience. The island and the bottle are metaphors; by reaching out, the protagonist discovers he is not alone, and that other people share his feelings of alienation.[citation needed]\n \n The single was The Police's first number one hit in the United Kingdom, but only reached #74 in the United States. An alternate &quot;Classic Rock&quot; mix is available on Every Breath You Take: The Classics. This is Sting's favorite song as confessed to Jools Holland of BBC fame.\n \n The Police reformed at Live Earth, a 2007 charity concert to raise awareness of global warming and other environmental hazards and performed &quot;Message in a Bottle&quot; as the US finale, with John Mayer playing guitar with Andy Summers (who described the track as a personal favourite in his book One Train Later) and Kanye West performing a rap verse over the chorus of the song.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Message in a Bottle&quot; is a 1979 song by The Police, from their second album, Reggatta de Blanc.  The song is ostensibly about a castaway on an island, who sends out a message in a bottle to seek help. A year later, he feels that there is no need for love. Later on, he sees &quot;a hundred billion bottles&quot; on the shore, finding out that there are more people like him out there. The Police debuted the song on live television.  ", "published": "Thu, 5 Mar 2009 20:09:13 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Message in a Bottle", "artist": {"url": "http://www.last.fm/music/The+Police", "mbid": "9e0e2b01-41db-4008-bd8b-988977d6019a", "name": "The Police"}, "url": "http://www.last.fm/music/The+Police/_/Message+in+a+Bottle", "listeners": "588658", "comments": ["AWSOME BASS LINE!", "Last.fm, why u no play this song more often", "ahh the police so much better together as a whole then  on there own", "This brings back such great memories for me!", "Really cool", "Nice policemen!\r\nwww.jackybullfrog.com", "I'll send an SOS to the world ♥", "great!!", "A hundred billion bottles, washed up on the shore! ♥", "♥♥ Sending out an S.O.S. ♥♥", "How I miss The Police. My band back in high school. When they were still a band!", "Forever a classic.", "i hope that someone gets my i hope that someone gets my i hope that someone gets my......................", "wonderful song [2]", "Wonderful song.....love the guitar!", "Heard a thousand times but always a great Song !", "i send you an sos in my bottle of beer", "I prefer the driven police songs. Message in a bottle and Sue Lawley (so lonely) are great.", "Yes, kiteo, critics are TWATS indeed.", "very arresting... I love the police, I have a very long police record."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/new%20wave", "name": "new wave"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}]}, "mbid": "40ced6cf-b684-46e9-9047-f2b4a97afc02", "duration": "291000", "playcount": "2782206", "id": "2907291"}}