{"track": {"album": {"@attr": {"position": "1"}, "title": "Move Along", "url": "http://www.last.fm/music/The+All-American+Rejects/Move+Along", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/51500785.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/51500785.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/51500785.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/51500785.png", "size": "extralarge"}], "artist": "The All-American Rejects", "mbid": ""}, "wiki": {"content": "Released September 12, 2005.\n \n &quot;Dirty Little Secret&quot; is the first single by the power pop band The All-American Rejects taken from their second studio album Move Along. Released in late 2005, the song was the band's most successful single at the time, reaching #9 for three weeks on Billboard magazine's Billboard Hot 100 chart in January 2006. Their song &quot;It Ends Tonight&quot; has since surpassed that peak, charting at #8 later in 2006, along with their first single &quot;Gives You Hell&quot; from their third album, surpassing it at #4.\n \n The music video of the song was filmed at Dorney Park and other locations in Allentown, Pennsylvania. The video is based on the PostSecret project, where people share their secrets on postcards. These cards are sent anonymously to the project, and some are posted on the PostSecret website. The video shows a montage of people holding up PostSecret postcards, which reveal a range of fears, embarrassment, love, deception, sadness, wishes and secret actions.\n \n Listing of all the &quot;secret&quot; postcards in order of appearance in the video:\n \n     * I want to go blind so I don't have to see them together\n     * I'm a virgin\n     * I waste office supplies because I hate my boss\n     * I haven't spoken to my dad in 10 years and it kills me everyday\n     * Everything that I told her was a complete &amp; total lie\n     * When I eat, I feel like a failure\n     * I had gay sex at church camp. 3 times.\n     * I pee in the sink.\n     * I am a peaceful person who happens to be filled with violent rage.\n     * She cheated.\n     * I make fun of fat people, but my mom is huge.\n     * I wish I was the other twin.\n     * I hate feeling alone\n     * I'm only dating her to get to her sister!\n     * I'm afraid to take the next step...\n     * I miss feeling close to God.\n     * I hate people who remind me of myself.\n     * I fear I have an undiagnosed mental illness.\n     * 3 years ago, I tried to kill myself... Now I'm 18 and people say I'm happy... But I still want to die.\n     * I'm afraid that no one will ever love me...as much as my dog &quot;Charlie&quot; does\n     * Sometimes I think my fiance isn't the one\n     * Sometimes I fake empathy to get people to like me\n     * I'm afraid of naked women\n     * I leave poetry in library books.\n     * I love you so much but can't tell you!!!\n     * I feel ugly because I'm half-black, half-white\n     * I cheated on my SAT and I got a scholarship\n     * I thought I was in love with him...\n     * I take more than the suggested dose...\n     * I only love 2 of my children\n     * I'm in love with my best friend!!!!!\n     * I'm afraid to answer the telephone\n     * People think I've stopped lying ... but I've just gotten better at it\n     * I know it's really gross, but I like the smell of my own poop.\n     * My family is rich but I shoplift everyday!\n     * I can eat a dozen donuts in one sitting\n     * I have more body hair than any woman should\n     * I left the dryer on while I had sex\n     * I wish I was a girl\n \n     * The song has appeared in the movies She's the Man, John Tucker Must Die, and Bring It On: All or Nothing. It was also played a few times in Deuce Bigalow: European Gigolo. The song was also featured in the Smallville season 5 episode &quot;Hypnotic&quot;, and later on the soundtrack Smallville: The Metropolis Mix. and in American Pie: The Naked Mile\n \n     * Progressive metal band Queensrÿche also has a song entitled the same name, and on the same topic. (though it was written nearly 20 years earlier)\n     * The song is now available as a downloadable track for the music video game series Rock Band. It also appears in the Wii version of the game as one of the exclusive 5 bonus songs.\n \n     * It is a playable track on Guitar Hero On Tour: Decades for the Nintendo DS.\n \n     * The song was played at a Seattle Spurs Basketball Game at which Nick Wheeler and Chris Gaylor were.\n \n     * The song was parodied on a poster for milk. The poster features a picture of the band with milk-moustaches and the words 'Dairy Little Secret'.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Released September 12, 2005.  &quot;Dirty Little Secret&quot; is the first single by the power pop band The All-American Rejects taken from their second studio album Move Along. Released in late 2005, the song was the band's most successful single at the time, reaching #9 for three weeks on Billboard magazine's Billboard Hot 100 chart in January 2006. Their song &quot;It Ends Tonight&quot; has since surpassed that peak, charting at #8 later in 2006, along with their first single &quot;Gives You Hell&quot; from their third album, surpassing it at #4. ", "published": "Thu, 5 Mar 2009 06:03:34 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Dirty Little Secret", "artist": {"url": "http://www.last.fm/music/The+All-American+Rejects", "mbid": "", "name": "The All-American Rejects"}, "url": "http://www.last.fm/music/The+All-American+Rejects/_/Dirty+Little+Secret", "listeners": "552835", "comments": ["The All-American Rejects is increadible! They gonna come to Mosсow? I can wait this guys a century  or more :)", "She's the Man ♥", "¬ loves it ¬  N Jychelle N", "<3", "I remember first listening to this on the PES franchise and i was addicted to them ever since that.", "Great song.", "Heard this live in Birmingham, was fecking good. Surprised how awesome they were live :D", "<3", "http://www.youtube.com/watch?v=R1j9NASRQgU&list=UUSgAJOMc9FyVH2MWXyhWX_g&index=13", "this, and sugar we're goin down, were my favorite songs when i was 9 - 10.  god.  fantastic.  i love this, used to listen to it nonstop with my cousins", "i wish that i was born when music was this good in highschool..... now its shit like nikki minaj. i feel sad about the downfall of good music in the general population :(", "so many of my favorite songs when i was younger were by this band and i'm just now finding out", "when we live such fragile lives\nits the best way we survive", "One of there best songs they have! LOVE this band!", "love it :)", "remember the first time i heard this song on the radio... i was 10 years old and i miss this song, its really good.", "<3 *____*", "Awesome song", "One of there best songs they have! LOVE this band!", "Best song *-*"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/pop%20punk", "name": "pop punk"}, {"url": "http://www.last.fm/tag/punk", "name": "punk"}, {"url": "http://www.last.fm/tag/emo", "name": "emo"}]}, "mbid": "4257dca0-4d91-4f17-9f45-9731c8609972", "duration": "194000", "playcount": "3498451", "id": "18897082"}}