{"track": {"album": {"@attr": {"position": "1"}, "title": "Evanescence", "url": "http://www.last.fm/music/Evanescence/Evanescence", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69697602.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69697602.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69697602.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69697602.png", "size": "extralarge"}], "artist": "Evanescence", "mbid": "dca58b08-9e7b-4a1d-bd1a-3f8cfd39c65d"}, "wiki": {"content": "The <a href=\"http://www.songfacts.com/detail.php?id=23475\" rel=\"nofollow\">What You Want Songfacts</a> reports that Evanescence frontwoman Amy Lee penned the song at her house in New York with bassist Tim McCord and guitarist Terry Balsamo. She told MTV News: &quot;We were just jamming, like, recording demos, and obviously the song has grown a lot since then, with everyone else. For me, it was — and I need to remember this, so I can apply it in the future — it wasn't trying so hard to be some epic, massive chorus. I was just doodling around on the piano and the guys were like, 'Do that. Whatever you just did, that's an awesome melody.' And I was like, 'Really?' Sometimes you just need your friends to be like, 'Do that!'&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The <a href=\"http://www.songfacts.com/detail.php?id=23475\" rel=\"nofollow\">What You Want Songfacts</a> reports that Evanescence frontwoman Amy Lee penned the song at her house in New York with bassist Tim McCord and guitarist Terry Balsamo. She told MTV News: &quot;We were just jamming, like, recording demos, and obviously the song has grown a lot since then, with everyone else. For me, it was — and I need to remember this, so I can apply it in the future — it wasn't trying so hard to be some epic, massive chorus.", "published": "Thu, 11 Aug 2011 16:55:18 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "What You Want", "artist": {"url": "http://www.last.fm/music/Evanescence", "mbid": "f4a31f0a-51dd-4fa7-986d-3095c40c5ed9", "name": "Evanescence"}, "url": "http://www.last.fm/music/Evanescence/_/What+You+Want", "listeners": "116076", "comments": ["burası çok güzel ya \"We’re forever spiraling down, down, down, down\" düşüyomuş gibi hissettim", "\"Do what you want ‘til you find what you’re looking for (got to remember who you really are) \"  \"aradığını bulana dek ne halin varsa gör ama gerçekte kim olduğunu hatırla\"", "albümdeki en iyi şarkısı. \"Somewhere beyond the pain there must be a way to learn forgiveness\"", "Cheguei atrasado, comprei o ingresso as pressas, qnd cheguei nas catracas ouvi a beteria começar, entrei correndo, em meio a mutidão e as luzes azuis, pra ver minha banda preferida. <3 Sinto toda aquela adrenalina e emoção quando ouço essa música. Uma dos melhores momentos da minha vida ♥", "Do what you what you want, if you have a dream for better\r\nDo what you what you want till you don't want it anymore\r\n(remember who you really are)", "i love her voice", "@tannytat: I agree not the best song on album. Great album though.", "I wonder how nobody noticed that this song is nearly identical to Nightwish's Nemo. Seems like rip-off a bit.", "I love this song , the best ~ *-* '", "I LOVE THIS SONG! *-*", "amazing song", "My opinion is this song definitely not the best song on the album", "Chuhuchuwachuwa\r\no__O", "Best Evanescence song by far.", "I want to tell them to my grand son in the future... :)", "Most beautifully angsty voice on the planet.  I love them so much!", "I love them so much!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\nevanescence <3", "toll", "Muito boa essa música!! ♥♥♥", "Зачем такие песни писать,Эми???Чтоб мой мозг окончательно вынести ? ))"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20metal", "name": "alternative metal"}, {"url": "http://www.last.fm/tag/evanescence", "name": "evanescence"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/gothic%20rock", "name": "gothic rock"}]}, "mbid": "466d37f1-afb2-486c-bdf5-c84fe4aac2a1", "duration": "220000", "playcount": "1129673", "id": "518652120"}}