{"track": {"album": {"@attr": {"position": "1"}, "title": "Them vs. You vs. Me", "url": "http://www.last.fm/music/Finger+Eleven/Them+vs.+You+vs.+Me", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/56716361.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/56716361.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/56716361.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/56716361.png", "size": "extralarge"}], "artist": "Finger Eleven", "mbid": "5f704fba-ca65-4af1-aa1a-b1433d9e74e8"}, "wiki": {"content": "&quot;Paralyzer&quot; is the first single from alternative rock band Finger Eleven's fifth album, Them vs. You vs. Me. It was released in March 2007. Finger Eleven's frontman Scott Anderson has said that the single has a feel distinct from the rest of Finger Eleven's music, possessing more of a &quot;dance rock&quot; feel. A radio edit version exists, with the guitar intro dropped.\n \n The song received high airplay in both the United States and Canada, and was performed live on the March 14, 2007 episode of The Tonight Show with Jay Leno and again ten months later on January 9, 2008, in a testament to the longevity of the single's success. The song has surpassed &quot;One Thing&quot; to be Finger Eleven's most successful single.\n \n The single has three versions. One is the original CD version, while the other two are radio edit versions, in which the line containing the word &quot;shitty&quot; is either censored or replaced with &quot;It's not been fun.&quot; The song alludes to the band's prior hit &quot;One Thing&quot; with the line &quot;I should just stay home, if one thing really means one&quot;; in addition, the recurring guitar riff quotes The Cars' &quot;Moving in Stereo&quot; and Motley Crue's &quot;Too Young to Fall in Love.&quot;\n \n The song is played during the New York Islanders warm-ups at the Nassau Veterans Memorial Coliseum.[citation needed] It has been featured on The CW's Gossip Girl &amp; Greek. It is also a playable song in the rhythm game Rock Revolution by Konami; although the game's producers have stated that all songs will be covers, the song is one of two for which the game uses the original master recording (the other being Given Up by Linkin Park).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Paralyzer&quot; is the first single from alternative rock band Finger Eleven's fifth album, Them vs. You vs. Me. It was released in March 2007. Finger Eleven's frontman Scott Anderson has said that the single has a feel distinct from the rest of Finger Eleven's music, possessing more of a &quot;dance rock&quot; feel. A radio edit version exists, with the guitar intro dropped.  The song received high airplay in both the United States and Canada, and was performed live on the March 14, 2007 episode of The Tonight Show with Jay Leno and again ten months later on January 9...", "published": "Tue, 10 Aug 2010 18:18:04 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Paralyzer", "artist": {"url": "http://www.last.fm/music/Finger+Eleven", "mbid": "0b76f632-25fa-4681-9862-86499c28afd3", "name": "Finger Eleven"}, "url": "http://www.last.fm/music/Finger+Eleven/_/Paralyzer", "listeners": "389684", "comments": ["this song ruined my life", "Love this song ♥", "♥", "my go to karaoke song lol", "God I luv this song....", "I mean it's not a bad song, but I'm just sick of music always being about either sex or love", "\"Well I'm still imagining a dark lit place or your place or my place!!..\"", "\"I hold out for one more drink ,before I think I’m looking too desperately...\"", "This song sounds like Trampled Underfoot by Led Zeppelin", "I seem to be struck by you ♥", "I'm not paralyzed but I seem to be struck by you <3", "love it", "I'm only two years younger than you, ring, and it's an old song to me...", "Oh yeah!! This song hits the spot...", "I love Finger Eleven so much but this track pretty much describes me perfectly. :x", "if your body matches what your eyes can do, youll proably move right through me on my way to you.......EPIC", "....and i feel akward as i should....love that lyric and whole song", "Their orginal name was... \"Rainbow Butt Monkeys\"...? ._. Weird... Lol. xD", "Yeah, the person who thinks this is an old song is probably a 12-year-old and doesn't know any better. For -adults- five years seems like it was yesterday! At least, it does for me...", "awesome"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/finger%20eleven", "name": "finger eleven"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "49792b07-2333-4f6b-8544-1f0ff178b0b3", "duration": "208000", "playcount": "2417005", "id": "78519948"}}