{"track": {"album": {"@attr": {"position": "7"}, "title": "Stadium Arcadium", "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/Stadium+Arcadium", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/66662762.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/66662762.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/66662762.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/66662762.png", "size": "extralarge"}], "artist": "Red Hot Chili Peppers", "mbid": "3d2e2240-17b8-30f0-999e-63c630d1db30"}, "wiki": {"content": "Slow Cheetah is a rock and roll song from the Red Hot Chili Peppers' 2006 album Stadium Arcadium. The song is characteristic of the band's stylistic shift from rap and funk towards a mellower sound, evident in their latest albums. “Slow Cheetah” is unusual in that it is one of the few songs on Stadium Arcadium to feature the use of an acoustic guitar.\n \n Andrew Perry of The Observer notes that within the dreamy, anthemic atmosphere of “Slow Cheetah,” the Chili Peppers transmute their funk and metal into a much mellower and softer style, whilst sacrificing little of their passion and energy. David M. Goldstein of Cokemachineglow writes that “Slow Cheetah” is “an example of how the band has learned to function in slower tempos without inducing sleep.” Stadium Arcadium received generally positive reviews, and even won a Grammy Award for Best Rock Album in 2007.\n \n For much of Stadium Arcadium, guitarist John Frusciante experiments with a vast array of synthesized effects, many of which are reminiscent of the idiosyncratic timbres found on 2004’s Shadows Collide With People. The ghostly outro of “Slow Cheetah” is a clear example of Frusciante’s affinity for psychedelia, and provides a stark contrast to the song’s acoustic beginning. The backwards guitar at the song’s outro is similar to 1991’s “Give It Away”, where Frusciante used the same technique. Both “Slow Cheetah” and “Give It Away” draw heavily from Jimi Hendrix’s guitar technique in “Castles Made of Sand,” as well as from the famous backmasking in the Beatles' song “Tomorrow Never Knows.” Flea’s bass in “Slow Cheetah” is characteristic of his minimalist techniques found in By The Way and Stadium Arcadium – a radical departure from his funky, slap-bass style commonly used on pre-Californication albums.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Slow Cheetah is a rock and roll song from the Red Hot Chili Peppers' 2006 album Stadium Arcadium. The song is characteristic of the band's stylistic shift from rap and funk towards a mellower sound, evident in their latest albums. “Slow Cheetah” is unusual in that it is one of the few songs on Stadium Arcadium to feature the use of an acoustic guitar.  Andrew Perry of The Observer notes that within the dreamy, anthemic atmosphere of “Slow Cheetah,” the Chili Peppers transmute their funk and metal into a much mellower and softer style, whilst sacrificing little of their passion and energy.", "published": "Sat, 14 Mar 2009 15:06:28 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Slow Cheetah", "artist": {"url": "http://www.last.fm/music/Red+Hot+Chili+Peppers", "mbid": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "name": "Red Hot Chili Peppers"}, "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/_/Slow+Cheetah", "listeners": "417633", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/red%20hot%20chili%20peppers", "name": "red hot chili peppers"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}]}, "mbid": "4c2d89ba-b7e7-4996-9e8b-89463b7c0c6b", "duration": "319000", "playcount": "2140347", "id": "50952410"}}