{"track": {"album": {"@attr": {"position": "14"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Bruce+Springsteen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91266097.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91266097.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91266097.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91266097.png", "size": "extralarge"}], "artist": "Bruce Springsteen", "mbid": "ce73ebd3-5ae0-35a0-93e8-187bcc7fa47a"}, "wiki": {"content": "&quot;Streets of Philadelphia&quot; is an Academy Award and Grammy-winning song written and performed by American singer Bruce Springsteen for the 1993 film Philadelphia.\n \n In early 1993, Philadelphia director Jonathan Demme asked Springsteen to write a song for the in-progress film, and in June 1993, after the conclusion of the &quot;Other Band&quot; Tour, Springsteen did so. It was recorded with Springsteen supplying almost all of the instrumentation, with bass and background vocals from &quot;Other Band&quot; member Tommy Simms. Additional saxophone and vocal parts by Ornette Coleman and &quot;Little&quot; Jimmy Scott, respectively, were recorded but never used.\n \n Released in early 1994 as the main single from the film's original soundtrack, it became a huge success for Springsteen all over Europe and North America.\n \n The song would achieve greater popularity in Europe than it would in the United States. While it peaked at #9 in the Billboard Hot 100 chart, it would become a number-one single in Germany and France. It would also peak at #2 in the United Kingdom, becoming Springsteen's highest charting hit in that country. It also peaked at #4 in Australia. &quot;Streets of Philadelphia&quot; ranks as his most recent top ten hit.\n \n The song was also included in the album All Time Greatest Movie Songs, released by Sony in 1999.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Streets of Philadelphia&quot; is an Academy Award and Grammy-winning song written and performed by American singer Bruce Springsteen for the 1993 film Philadelphia.  In early 1993, Philadelphia director Jonathan Demme asked Springsteen to write a song for the in-progress film, and in June 1993, after the conclusion of the &quot;Other Band&quot; Tour, Springsteen did so. It was recorded with Springsteen supplying almost all of the instrumentation, with bass and background vocals from &quot;Other Band&quot; member Tommy Simms.", "published": "Tue, 2 Dec 2008 16:27:53 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Streets of Philadelphia", "artist": {"url": "http://www.last.fm/music/Bruce+Springsteen", "mbid": "70248960-cb53-4ea4-943a-edb18f7d336f", "name": "Bruce Springsteen"}, "url": "http://www.last.fm/music/Bruce+Springsteen/_/Streets+of+Philadelphia", "listeners": "362064", "comments": ["Great song", "Never saw the movie, but the song certainly is memorable.", "going to see him tonight 23/7/13 in Cardiff ..... B    R    U    C   E", "na na na na na na na na", "<3", ":))", "° ♥ ♫¸¸.• ( ace ) •.¸¸ ♫ ♥ °", "one of those stop and listen tunes", "Awesome song, singer, and movie. This song always gives me chills. ♫ ♥ ♥ ♥ ♫", "great track from a great movie", "Masterpiece", "amazing", "Meu coração fica tão apertadinho quando ela toca. Sei lá, me transporta para um outro tempo.", "Sweet", "Timeless!", "ain't no angel gonna greet me,it's just you and i my friend", "Amazing song", "at night i hear the blood in my veins...", "the Best", "great one..."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/soundtrack", "name": "soundtrack"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}]}, "mbid": "", "duration": "251000", "playcount": "1915766", "id": "1005819"}}