{"track": {"album": {"@attr": {"position": "1"}, "title": "Get Behind Me Satan", "url": "http://www.last.fm/music/The+White+Stripes/Get+Behind+Me+Satan", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/74526074.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/74526074.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/74526074.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/74526074.png", "size": "extralarge"}], "artist": "The White Stripes", "mbid": "7b3c01ba-4297-4591-9024-7acc71e75dcb"}, "wiki": {"content": "&quot;Blue Orchid&quot; is the first track by the American alternative rock band The White Stripes from their album Get Behind Me Satan, and the first single to be released from the album.\n \n The recorded sound is produced by two guitars playing almost in unison, and each digitally combined with their own signal an octave lower. Live, the sound is produced by a bass-rich guitar tone, used in combination with a whammy pedal to create the heavily metallic sounding breaks of the song (&quot;How dare you, how old are you now anyway&quot; and &quot;get behind me, get behind me now anyway&quot;.)\n \n The single comes in three editions, each with different additional tracks. All three covers feature two people dressed up as The White Stripes, but are noticeably different people. The first CD and the 7&quot; feature the couple in the same order as Get Behind Me Satan, with 'Jack' on the right. The second CD version features 'Jack' on the left.\n \n In an NPR interview, Jack White referred to &quot;Blue Orchid&quot; as the song that saved the album. He has denied that the song relates to the ending of his relationship with Renée Zellweger.\n \n The video for &quot;Blue Orchid&quot; was on Yahoo!'s Top Twenty Scariest Music Videos of all Time, charting at number 13. It features Karen Elson, a model who would marry Jack White soon after the shoot. The video, which was directed by Floria Sigismondi, ends with a horse, its hooves raised in the air, about to stomp on Elson, but just before the hooves land on her, the video quickly goes black, ending.\n \n &quot;Blue Orchid&quot; has been remixed by High Contrast on the album Fabric Live 25, and is the first track on disc 2 of the album. It features the main guitar riff accompanied by a much more Drum and Bass inspired backing drum beat. The vocals from the song, &quot;You took a white orchid, you took a white orchid and turned it blue&quot; repeated at various points throughout the track.\n \n The song is used as the theme song for the Australian Radio Show Wil &amp; Lehmo on Triple M\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Blue Orchid&quot; is the first track by the American alternative rock band The White Stripes from their album Get Behind Me Satan, and the first single to be released from the album.  The recorded sound is produced by two guitars playing almost in unison, and each digitally combined with their own signal an octave lower. Live, the sound is produced by a bass-rich guitar tone, used in combination with a whammy pedal to create the heavily metallic sounding breaks of the song (&quot;How dare you, how old are you now anyway&quot; and &quot;get behind me, get behind me now anyway&quot;.) ", "published": "Sun, 30 May 2010 15:39:55 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Blue Orchid", "artist": {"url": "http://www.last.fm/music/The+White+Stripes", "mbid": "11ae9fbb-f3d7-4a47-936f-4c0a04d3b3b5", "name": "The White Stripes"}, "url": "http://www.last.fm/music/The+White+Stripes/_/Blue+Orchid", "listeners": "553313", "comments": ["get thee behind me satan !", "Great song", "fuckin GH5", "You got a erection, didn't you? [5]\r\nKKKKKKKKKKKKKKKKKKKKKKKKK", "You got a erection, didn't you? [4] I have always sung this way lol", "Blue Orchid LLIIIIIIIIIVVVVVEEEEE!! Greatest song to open that album! :)", "White stripes are sooooooooo under rated!!!", "so mind bending oh there steller babe", "You got a erection, didn't you? [3] LMFAO", "This song makes me drive my motocycle too fast... Whoooo...", "You got a erection, didn't you? [2] LOL!", "get behind now!", "You got a erection, didn't you?", "O Vídeo, a música, a banda, tudo incrível.", "kills", "@passport90...underrated. best song of them. Underrated, duude, this song has more scrobbles than most of the bands I listen to at the moment^^ Cheers", "i love that the White Stripes come on when i'm listening to The Doors or Led Zeppelin radio. its a nice new touch to them", "So glad they put the live version on here. So much more energy than the album.", "БЭСТ! =))", "O.O"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}]}, "mbid": "51f587f2-a65c-43bc-8ef3-df23e0f65f9a", "duration": "175000", "playcount": "3337014", "id": "17351712"}}