{"track": {"album": {"@attr": {"position": "3"}, "title": "A Beautiful Lie", "url": "http://www.last.fm/music/30+Seconds+to+Mars/A+Beautiful+Lie", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/34788339.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/34788339.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/34788339.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/34788339.png", "size": "extralarge"}], "artist": "30 Seconds to Mars", "mbid": "105b9bf5-015b-44ff-9a9c-d743f3d08206"}, "wiki": {"content": "&quot;The Kill&quot; (written along with the subtitle &quot;Bury Me&quot; in parenthesis on its single release, and with &quot;Rebirth&quot; on the remix's single released in the UK) is a song by 30 Seconds to Mars, the song was released as the second single from their second album, A Beautiful Lie.\n \n Jared Leto described the meaning of the song as, &quot;It's really about a relationship with yourself. It's about confronting your fear and confronting the truth about who you are.&quot; He has also said it is about &quot;confrontation as a crossroads&quot; — coming face-to-face with who you really are. In September 2007, &quot;The Kill&quot; was re-released again in the UK. It is currently available as a Compact Disc with a A Beautiful Lie poster and two stickers, and a special limited edition 7&quot; vinyl version. The song is played in 6/8 time, commonly found in ballroom songs and almost all waltzes.\n \n Being entirely based on the American film The Shining, several scenes are versions from the movie, such as when Shannon Leto enters Room 6277 and encounters the woman in the bathroom, when Matt Wachter being served drinks at the bar by an apparition while both films culminate in an elegant ballroom.\n \n As for the cinematography, Jared Leto has clearly adopted the split screen visual from working with Darren Aronofsky in Requiem for a Dream.\n \n The number 6277 is used for the room number because it spells out &quot;Mars&quot; on a telephone keypad. The number also makes an appearance in the video for &quot;From Yesterday&quot;.\n Scenes from the music video - Top: Jared Leto confronting himself. Bottom: The band perform their song to the 1920s-themed audience.\n \n The music video was selected as the second best video of 2006, falling short only to &quot;Savin' Me&quot; by Nickelback. And it was voted the 2nd greatest of the 21st century on Scuzz TV. It was also selected as the greatest rock video ever in the Kerrang Rock 100 on 27th June 2009.\n \n At 1:29, the papers that Jared Leto has been typing are briefly made visible and the words on them appear to read, over and over, &quot;This is who I really am.&quot; This is another allusion to The Shining, in which Jack Nicholson's character types up pages and pages of the same line, &quot;All work and no play makes Jack a dull boy&quot;, over and over in the same sense.\n \n Also, it is shown at 2:18, a negative of what appears to be the woman's corpse appears on the screen briefly. This image also reappears at 3:18. However, on YouTube, the version from Capitol Music doesn't show the corpse as a negative, but rather in its raw form, with blood. This may be to emphasize the song title because she looks as though she was only killed recently.\n \n When the press release info for &quot;The Kill&quot; video was released, Jared stated that the video was directed by an albino Danish man named Bartholomew Cubbins. This was intended as a joke as Cubbins is the main character of the Dr. Seuss book The 500 Hats of Bartholomew Cubbins, however airings of the video on music channels still list Cubbins as the director.\n \n The music video features the band exploring a hotel which they are care-taking. At the start, Jared Leto states that they have the hotel all to themselves for three days; although, later on, after the first chorus, it comes on the screen saying &quot;One Week Later&quot;, before showing the pages saying &quot;This is who I really am&quot;. In the extended version of the video the other band members complain that they have been at the hotel longer than expected and have canceled shows because of Jared's peculiar behavior, explaining the discrepancy.\n \n A letter from the hotel owner tells the band to &quot;Enjoy your stay and please stay out of Room 6277.&quot; The band does not heed the warning and opens Room 6277. Following the opening of the door, each band member begins to experience the effects of the room. Each member experiences the effects differently, but one thing remains constant for each individual — they encounter a tuxedoed version of themselves. Several other apparitions then take up residence in the hotel, dispelling the promise Jared made in the beginning of the video that the band will have the hotel all to themselves and that &quot;there's not gonna be a single fucking soul&quot;. The video reaches its climax when the tuxedoed bandmates are shown performing the song in the hotel's ballroom in front of an elegantly-dressed crowd dancing with themselves.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;The Kill&quot; (written along with the subtitle &quot;Bury Me&quot; in parenthesis on its single release, and with &quot;Rebirth&quot; on the remix's single released in the UK) is a song by 30 Seconds to Mars, the song was released as the second single from their second album, A Beautiful Lie.  Jared Leto described the meaning of the song as, &quot;It's really about a relationship with yourself. It's about confronting your fear and confronting the truth about who you are.&quot; He has also said it is about &quot;confrontation as a crossroads&quot; — coming face-to-face with who you really are.", "published": "Sat, 24 Oct 2009 15:35:46 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "The Kill", "artist": {"url": "http://www.last.fm/music/30+Seconds+to+Mars", "mbid": "b898f22d-1d89-4d19-8581-8f7bd9ddb0a6", "name": "30 Seconds to Mars"}, "url": "http://www.last.fm/music/30+Seconds+to+Mars/_/The+Kill", "listeners": "748800", "comments": ["♥", "Leto scream is best !! [2]", "luv  'em!!", "What if I wanted to fight?", "Look in my eyes, you’re killing me, killing me. All I wanted was you.", "what would you do? ♥", "what if i wanted to break?", "minha <3", "♥", "Woah. I never knew this was 30 seconds to mars....", "Lol, when the song first came out, I thought he sang \"Marry me, marry me...\"  [2]\r\n\r\nI guess wishful thinking?", "Leto scream is best !!", "I'm not running from you.", "what would you do?", "pure perfection", "I love this song so much! I sing along everytime", "cannot wait to VyRT! December Foist!", "Love it!", "Lol Cryhoc, I agree. XD", "Been so long...love this one"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/30%20seconds%20to%20mars", "name": "30 seconds to mars"}, {"url": "http://www.last.fm/tag/emo", "name": "emo"}]}, "mbid": "5297b353-dc1b-40bb-9bb3-c0a6b4d19701", "duration": "233000", "playcount": "7776606", "id": "18848978"}}