{"track": {"album": {"@attr": {"position": "10"}, "title": "Absolution", "url": "http://www.last.fm/music/Muse/Absolution", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/61418461.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/61418461.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/61418461.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/61418461.png", "size": "extralarge"}], "artist": "Muse", "mbid": "6ff10d60-8e80-4f51-9037-2932b5f49f5a"}, "wiki": {"content": "&quot;Butterflies and Hurricanes&quot; was released on Absolution in 2004. The song concerns itself with the &quot;butterfly effect,&quot; describing how individuals can change the world forever just as the turbulence generated by a butterfly's wings may create tiny changes in the atmosphere ultimately redirecting the path of a hurricane. The song is notable for its Rachmaninoff-style virtuoso piano solo that begins quietly with what may be likened to the flapping of thousands of tiny butterfly wings, and ends with the majestic cascading sounds of diminished 7ths flowing all the way up and down the piano keyboard.\n \n There are several versions of &quot;Butterflies and Hurricanes&quot;. For the original studio recording, introduction, verse and choruses were played on keyboard. The band later reworked the song for guitar during the Absolution tour, including an extended guitar solo before the piano interlude (and a bass filler to cover Matt Bellamy's transition from guitar to keyboard). The single version contains both guitar and keyboard, but loses the guitar solo, and the interlude is shorter, reducing the song from 5:01 to 4:48. The vinyl single includes a full-length version with guitars. Finally, the radio edit of the single goes further by omitting the entire piano interlude, bringing the song down to 4:10.\n \n The promotional video comprises footage of &quot;Butterflies and Hurricanes&quot; being played at different venues along the Absolution tour with colourful effects added, and images of the Colosseum in Rome.\n \n &quot;Butterflies and Hurricanes&quot; was later covered with full orchestral accompaniment by pop pianist William Joseph on his 2004 album Within.\n \n The song was dedicated to Dominic Howard's father, who died shortly after the band's performance at Glastonbury Festival.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Butterflies and Hurricanes&quot; was released on Absolution in 2004. The song concerns itself with the &quot;butterfly effect,&quot; describing how individuals can change the world forever just as the turbulence generated by a butterfly's wings may create tiny changes in the atmosphere ultimately redirecting the path of a hurricane. The song is notable for its Rachmaninoff-style virtuoso piano solo that begins quietly with what may be likened to the flapping of thousands of tiny butterfly wings...", "published": "Sun, 25 Jan 2009 01:39:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Butterflies and Hurricanes", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Butterflies+and+Hurricanes", "listeners": "654857", "comments": ["Just blows me away every time I hear it ....", "Noooooo!!!!!! The song froze......", "But then I'd be hitting the heart button on the incorrect tag. I'll do it on the correct tag, Butterflies & Hurricanes.", "Who cares about the typography? Simply hit the \"HEART\" button! :)))", "It's \"&\" not \"and\" [5]", "Everyone click on \"Is Butterflies And Hurricanes misspelt? Is Muse the wrong artist for this track? Suggest a correction\" on the right and correct it to \"Butterflies & Hurricanes\" as that's what the spelling is on the actual album!", "that piano! awwwwsome", "It's \"&\" not \"and\" [4]", "WRONG TAG.", "It's \"&\" not \"and\" [3]", "It's \"&\" not \"and\" [2]", "Thanks to Nocturana's radio - Paul.", "N33D 4 5P33D", "Single version is such perfect *_*", "I'm really lost to what muse is doing these days. This track wasn't surpased.", "FU last.fm! It's \"&\" not \"and\".", "♥", "Best, you've got to be the best, you've got to catch them all!", "Butterflies & Hurricanes", "dat piano interlude"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/progressive%20rock", "name": "progressive rock"}]}, "mbid": "5ac5e1f4-d6ad-442d-bdf5-f6485e8f58a0", "duration": "301000", "playcount": "4894329", "id": "2722975"}}