{"track": {"album": {"@attr": {"position": "15"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Neil+Young/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91780559.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91780559.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91780559.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91780559.png", "size": "extralarge"}], "artist": "Neil Young", "mbid": "361e6603-780f-39fc-afac-980604ca931d"}, "wiki": {"content": "The song was first performed live on February 21, 1989 in Seattle with Young's band The Restless.\n \n The book Shakey by Jimmy McDonough claims the song originated when Young was on tour in the late 1980s. He and Frank &quot;Poncho&quot; Sampedro saw newspaper photos of the Ayatollah Khomeini's body being carried to his grave as mourners were burning American flags in the street. Sampedro commented, &quot;Whatever we do, we shouldn't go near the Mideast. It's probably better we just keep on rockin' in the free world.&quot; Young asked if Sampedro intended to use this idea as the basis of a song and when Sampedro said no, Young said that he would do so instead. However Khomeini's death occurred months after the first live performance of the song.\n \n The lyrics criticize the George H. W. Bush administration and the social problems of contemporary American life, directly referencing Bush's famous &quot;thousand points of light&quot; remark from his 1989 inaugural address. \n \n An edited version of the song accompanies the end credits of Michael Moore's Fahrenheit 9/11; the phrase &quot;That's one more kid that’ll never go to school / Never get to fall in love, never get to be cool,&quot; which originally referenced the second verse's abandoned child, now appears to reference a US soldier killed in Iraq.\n \n The song is rated number 214 on Rolling Stone's 500 Greatest Songs of All Time\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The song was first performed live on February 21, 1989 in Seattle with Young's band The Restless.  The book Shakey by Jimmy McDonough claims the song originated when Young was on tour in the late 1980s. He and Frank &quot;Poncho&quot; Sampedro saw newspaper photos of the Ayatollah Khomeini's body being carried to his grave as mourners were burning American flags in the street. Sampedro commented, &quot;Whatever we do, we shouldn't go near the Mideast.", "published": "Wed, 26 Oct 2011 19:54:18 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Rockin' in the Free World", "artist": {"url": "http://www.last.fm/music/Neil+Young", "mbid": "053e3289-1cab-4b44-9535-9ab1beb3b207", "name": "Neil Young"}, "url": "http://www.last.fm/music/Neil+Young/_/Rockin%27+in+the+Free+World", "listeners": "179064", "comments": ["MICHAEL MOORE PUT THIS TRACK TO AN IMPACTFUL USE AT THE END OF FARENHEIT 911.", "Neil Young, Rocks!  Has lots of classics.", "cool>2", "Neil Young's dad is in the Hockey Hall of Fame.", "Yeah right", "cool", "Providing the edge to CS&N.", "Good rocking song, although the lyrics are pretty trite.", "great , one of my fav :)))", "Love this bass line. Love it.", "Anthemic brilliance", "keep rockin mate", "This man is a God amongst us !", "This cheers me up more than i already am to begin with. KEEP ON ROCKING!", "Ooh yeah: https://www.youtube.com/watch?v=hvtdbfI1sqQ", "Great", "Man, this is good!", "Great song ♥", "SOMEBODY SEND ME A CHEESEBURGER---AND A NEW ROLING STONE.!", "<3"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/political", "name": "political"}, {"url": "http://www.last.fm/tag/canadian", "name": "canadian"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}]}, "mbid": "6231af8a-1570-446e-909d-51eb851e3f61", "duration": "280000", "playcount": "771611", "id": "1219963"}}