{"track": {"album": {"@attr": {"position": "2"}, "title": "Hot Fuss", "url": "http://www.last.fm/music/The+Killers/Hot+Fuss", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/68101062.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/68101062.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/68101062.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/68101062.png", "size": "extralarge"}], "artist": "The Killers", "mbid": "8ce105a8-5695-3603-84c9-a1d03d0d06da"}, "wiki": {"content": "&quot;Mr. Brightside&quot; is the debut single by Las Vegas-based rock band The Killers. The song is featured on the group's debut album Hot Fuss and was written by Brandon Flowers and Dave Keuning.\n It was named &quot;Song of the Decade&quot; by UK radio stations Absolute Radio and XFM, and in April 2010 Last.fm revealed that it was the most listened to track since the launch of the online music service, with over 12.2 million plays &quot;scrobbled&quot;. In October 2010, it was voted ninth in the Greatest Guitar Riffs of the 21st Century so far by Total Guitar magazine. It is The Killers' best-selling song in the US where it has sold over 3 million copies.\n \n \n \n History\n \n Lyrically &quot;Mr. Brightside&quot; depicts the jealousy and paranoia of a male who suspects his significant other is deliberately cheating on him. The song is inspired by an unfaithful ex-girlfriend of frontman Brandon Flowers. Dave Keuning composed the verses to this song before meeting Flowers, Flowers wrote lyrics and composed the chorus after hearing Dave's ideas. In the November of the year 2001, the group had recorded &quot;Mr. Brightside&quot; along with three other demos including &quot;Desperate&quot;, &quot;Replaceable&quot;, and &quot;Under the Gun&quot; at Mike Sak's Kill the Messenger Studio in Henderson, Nevada. They handed out this demo for free during their shows in the year 2002.\n &quot;Mr. Brightside&quot; became a popular song within the Las Vegas music scene with one reviewer calling it a &quot;feel-good anthem that ranks as one of the best local tracks in a long time.&quot; After signing with UK indie label Lizard King Records, the track was sent to radio as a buzz single and it received frequent spins by influential BBC Radio 1 DJ's Zane Lowe and Steve Lamacq as well as being playlisted by XFM. In a glowing review, NME said the song was filled with &quot;ambition, sex, and noise&quot;.\n The earliest demo of the song can be found on YouTube, Mark Stoermer and Ronnie Vannucci were not members of the band when this demo was recorded. Bass is played by Dave Keuning and drums by Matt Norcross. A later demo featuring all band members can also be found,[8] as well as the first official version.\n A remix of the song by Stuart Price was featured on The Killers' 2007 B-side and rarities compilation Sawdust. During the tour for Brandon Flowers' solo record, he performed the remix version with Stuart Price during his show at Brixton Academy and has since performed it on his tour as the show closer, again in the remix form.\n \n \n \n \n \n B-side\t&quot;Smile Like You Mean It&quot;\n &quot;On Top&quot;\n &quot;Who Let You Go?&quot;\n &quot;Change Your Mind&quot;\n Released\tDecember 1, 2003\n Format\t7&quot;, CD\n Recorded\t2001 at Kill the Messenger Studio, Henderson, Nevada and 2003 at Cornerstone Studios, Berkeley, California.\n Genre\tPost-punk revival, New Wave, indie rock\n Length\t3:42\n Label\tIsland, Lizard King\n Writer(s)\tBrandon Flowers, Dave Keuning\n Producer\tThe Killers\n Certification\tGold – ABPD Brazil\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Mr. Brightside&quot; is the debut single by Las Vegas-based rock band The Killers. The song is featured on the group's debut album Hot Fuss and was written by Brandon Flowers and Dave Keuning.\n It was named &quot;Song of the Decade&quot; by UK radio stations Absolute Radio and XFM, and in April 2010 Last.fm revealed that it was the most listened to track since the launch of the online music service, with over 12.2 million plays &quot;scrobbled&quot;.", "published": "Wed, 17 Jul 2013 02:04:42 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Mr. Brightside", "artist": {"url": "http://www.last.fm/music/The+Killers", "mbid": "24b4aee8-32ed-4163-98f7-55bae67411ae", "name": "The Killers"}, "url": "http://www.last.fm/music/The+Killers/_/Mr.+Brightside", "listeners": "1571446", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}]}, "mbid": "64bbfd8f-1c54-425f-8871-ad457f020d28", "duration": "223000", "playcount": "13520477", "id": "3349571"}}