{"track": {"album": {"@attr": {"position": "2"}, "title": "Led Zeppelin", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90391351.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90391351.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90391351.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90391351.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "913e4310-e710-4f8d-8c33-41befd7591f1"}, "wiki": {"content": "&quot;Babe I'm Gonna Leave You&quot; is a traditional folk song written by <strong>Anne Bredon</strong> in the late 1950s. It was recorded by <a href=\"http://www.last.fm/music/Joan+Baez\" class=\"bbcode_artist\">Joan Baez</a> and released on her 1963 album Joan Baez in Concert, Part 1, and also by the English rock band Led Zeppelin, being included on their 1969 debut album <strong>Led Zeppelin</strong>.\n \n The band was inspired to cover the song after hearing Baez's version. Both guitarist Jimmy Page and singer Robert Plant were big fans of Baez. Baez's original album had indicated that the song was a traditional number, and Led Zeppelin followed suit by crediting the song as &quot;Trad., arr. Page&quot;. In the 1980s, Bredon was made aware of Led Zeppelin's version of the song. Since 1990 the Led Zeppelin version has been credited to Anne Bredon/Jimmy Page &amp; Robert Plant, and Bredon received a substantial back-payment in royalties.\n \n This was the number Page played to Plant at their first meeting together, which took place at Page's riverside home at Pangbourne in late July 1968. It is often stated that the song evolved when Plant played to Page the guitar arrangement which eventually found its way onto the album. In an interview he gave with Guitar World magazine in 1998, Page refuted this story, noting that he had worked out the arrangement long before he met Plant, told him he would like it on the album, and that Plant at that time did not even play the guitar.\n \n It is rumoured that Page recorded another version of the song, with Steve Winwood, in 1968, which was never released.\n \n At the 1:43 mark of Led Zeppelin's version of &quot;Babe I'm Gonna Leave You&quot;, it is possible to hear a very faint trace of Plant singing, &quot;I can hear it calling me&quot; just before he sings the same line in full volume. It is as if he &quot;hears it calling him.&quot; This &quot;ghost&quot; is the vocal bleed from Plant's scratch vocal, and it appears on the drum tracks, which were recorded live with the full band.\n \n The band only played this song live at Led Zeppelin concerts on their 1969 concert tours, but Page and Plant brought it back for their 1998 reunion in a 9-minute version. When he played this song live, Page tended to use a fuzzbox. Led Zeppelin cite their best performance of the song to be at Copenhagen, Denmark, late 1968, during which Jimmy played the song with heavy fuzz.\n \n A live, filmed performance of &quot;Babe I'm Gonna Leave You&quot;, from Led Zeppelin's gig on Danmarks Radio at Gladsaxe, Denmark, on March 17, 1969, is featured on the Led Zeppelin DVD (2003).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Babe I'm Gonna Leave You&quot; is a traditional folk song written by Anne Bredon in the late 1950s. It was recorded by <a href=\"http://www.last.fm/music/Joan+Baez\" class=\"bbcode_artist\">Joan Baez</a> and released on her 1963 album Joan Baez in Concert, Part 1, and also by the English rock band Led Zeppelin, being included on their 1969 debut album Led Zeppelin.  The band was inspired to cover the song after hearing Baez's version. Both guitarist Jimmy Page and singer Robert Plant were big fans of Baez. Baez's original album had indicated that the song was a traditional number, and Led Zeppelin followed suit by crediting the song as &quot;Trad.", "published": "Tue, 17 Nov 2009 00:41:51 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Babe I'm Gonna Leave You", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Babe+I%27m+Gonna+Leave+You", "listeners": "523129", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/led%20zeppelin", "name": "led zeppelin"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "683ab72f-bc21-453d-abbf-a5f7518881a7", "duration": "401000", "playcount": "3277445", "id": "12715"}}