{"track": {"album": {"@attr": {"position": "12"}, "title": "Cross Road", "url": "http://www.last.fm/music/Bon+Jovi/Cross+Road", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/85817391.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/85817391.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/85817391.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/85817391.png", "size": "extralarge"}], "artist": "Bon Jovi", "mbid": "96427302-21bc-4e99-be86-75228b0e3b72"}, "wiki": {"content": "&quot;I'll Be There for You&quot; is a song by American hard rock band Bon Jovi from their 1988 album New Jersey, was written by Jon Bon Jovi and Richie Sambora. The single of the song was ranked number one on the Billboard Hot 100 and #5 on the Mainstream rock charts.\n \n Originally released on the 1988 album New Jersey, it became the band's third single from the album when it was released as a single in 1989. As the band (and hard rock music) was at its peak popularity at this time, the song quickly climbed to the number one position on the Billboard Hot 100, becoming their fourth and final number one single. The song has remained as one of Bon Jovi's signature songs and a classic in the power ballad genre. The song was also a peek into a more mature sound heard on their following albums Keep the Faith and These Days.\n \n The video for the song features the band performing on a dark stage with an almost monochromatic blue color due to the stage lighting, with close-ups of each member, most notably lead singer Jon Bon Jovi and guitarist Richie Sambora. The video footage then switches midway to black-and-white footage from a Bon Jovi concert at the old Wembley Arena in London, England.\n \n Homebound Train, the B-side to I'll Be There for You, is notable for being one of the band's heaviest songs, and also for the brief back-and-forth keyboard and harmonica solos leading up to the guitar solo. It is a heavy metal song opposed to its A-side that is a Power Ballad/Love Ballad. When played during The Circle Tour, it was sung by Richie Sambora.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;I'll Be There for You&quot; is a song by American hard rock band Bon Jovi from their 1988 album New Jersey, was written by Jon Bon Jovi and Richie Sambora. The single of the song was ranked number one on the Billboard Hot 100 and #5 on the Mainstream rock charts.  Originally released on the 1988 album New Jersey, it became the band's third single from the album when it was released as a single in 1989.", "published": "Wed, 30 May 2012 22:24:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "I'll Be There For You", "artist": {"url": "http://www.last.fm/music/Bon+Jovi", "mbid": "5dcdb5eb-cb72-4e6e-9e63-b7bace604965", "name": "Bon Jovi"}, "url": "http://www.last.fm/music/Bon+Jovi/_/I%27ll+Be+There+For+You", "listeners": "204849", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/bon%20jovi", "name": "bon jovi"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "6996b84f-a163-4a06-a3b9-4da041f318be", "duration": "416000", "playcount": "954148", "id": "1001619"}}