{"track": {"album": {"@attr": {"position": "17"}, "title": "Nimrod", "url": "http://www.last.fm/music/Green+Day/Nimrod", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/58617345.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/58617345.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/58617345.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/58617345.png", "size": "extralarge"}], "artist": "Green Day", "mbid": "1b6cef46-0e0e-3966-b1a0-b9244bb03fd9"}, "wiki": {"content": "&quot;Good Riddance (Time of Your Life)&quot;, also called &quot;Time of Your Life (Good Riddance)&quot; or more commonly &quot;Time of Your Life&quot;, is a popular song by the American rock band Green Day. Although written by lead singer Billie Joe Armstrong just after the release of their 1994 hit album Dookie, the song was not released until their third major-label album Nimrod in 1997 although an alternate version did appear as a B-side to the 1995 German import single for &quot;Brain Stew/Jaded&quot;.\n \n \n Writing and composition\n \n In comparison to previous Green Day material, &quot;Good Riddance (Time of Your Life)&quot; features more mellow, contemplative lyrics with acoustic music. Band member Mike Dirnt went on to state that the release of this song was probably the &quot;most punk&quot; thing they could have done. The song is more commonly promoted on the radio as &quot;Time of Your Life&quot;, and it became a Billboard Rock chart-topper and an international hit, and was the only song from Nimrod that was a crossover success when released in single form.\n \n The song began life as an entirely different version as a B-side to the Insomniac album. This alternate version featured strummed chords instead of the usual sound and lacked the orchestra strings found on the more well known version. This early version can be found on the &quot;Brain Stew&quot; single.\n \n Billie Joe Armstrong in an interview in Guitar Legends magazine, May 2005:\n         &quot;At the time I wrote Good Riddance, I was breaking up with a girl that was moving to Ecuador, and I was trying to be as understanding about it as I could. I wrote the song as kind of a bon voyage. I was trying not to be bitter, but I think it came out a little bit bitter anyway... I thought that calling the song &quot;Time of Your Life&quot; was just a little too level-headed for me, so I had to come up with something different&quot;\n \n On the album version, at the beginning, Billie Joe Armstrong makes a mistake (the 3rd and 4th strings of the open G/D chord are played instead of the 2nd and 3rd), tries again, repeats the mistake, and in anger swears in a barely audible voice. This mistake was recorded on purpose and included in the song to provide comic relief, as it is considered one of their more serious songs.\n \n Appeal\n \n The song reached a massive audience in one night, when it was used during the special two part &quot;Clip Show&quot; of the extremely popular show Seinfeld in 1998. The song played during a montage of clips from the show.\n \n Billie Joe plays an electric acoustic version of the song as their traditional show-closer for live Green Day concerts, including their live performance on Bullet in a Bible.\n \n The song features on their greatest hits compilation International Superhits!.\n \n The song appeared on the Triple J Hottest 100 of All Time, 2009 at 75, as voted by the Australian public.\n \n \n Music video\n \n The music video was directed by Mark Kohr, and features Billie Joe Armstrong playing an acoustic guitar in a bedroom interjected with scenes depicting various people undergoing every-day-things. Band members Mike Dirnt and Tré Cool make cameo appearances in the video as a person getting gas (Dirnt), and an injured bike rider (Cool). Also when the video came out, both names of the songs were swapped and were known as &quot;Time of Your Life (Good Riddance)&quot;, this name was also used on the single cover.\n \n In 1998 Green Day won their first MTV Video Music Award for Best Alternative Video for &quot;Good Riddance (Time of Your Life)&quot; and they were also nominated for Viewer's Choice.\n \n The video can be found on their music video compilation DVD, International Supervideos!.\n \n Good Riddance (Time of Your Life) was voted #37 on the VH1 Classic's countdown VH1's Classic 100 Greatest Songs of the 90's\n \n \n Released - December 23, 1997\n Format - CD\n Recorded - 1997\n Genre - Acoustic rock, soft rock\n Length - 2:35\n Label - Reprise\n Producer - Rob Cavallo, Green Day\n Certification - Gold (RIAA)\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Good Riddance (Time of Your Life)&quot;, also called &quot;Time of Your Life (Good Riddance)&quot; or more commonly &quot;Time of Your Life&quot;, is a popular song by the American rock band Green Day. Although written by lead singer Billie Joe Armstrong just after the release of their 1994 hit album Dookie, the song was not released until their third major-label album Nimrod in 1997 although an alternate version did appear as a B-side to the 1995 German import single for &quot;Brain Stew/Jaded&quot;.  \n Writing and composition  ", "published": "Wed, 3 Mar 2010 21:17:02 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Good Riddance (Time of Your Life)", "artist": {"url": "http://www.last.fm/music/Green+Day", "mbid": "084308bd-1654-436f-ba03-df6697104e19", "name": "Green Day"}, "url": "http://www.last.fm/music/Green+Day/_/Good+Riddance+(Time+of+Your+Life)", "listeners": "671449", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/punk%20rock", "name": "punk rock"}, {"url": "http://www.last.fm/tag/acoustic", "name": "acoustic"}, {"url": "http://www.last.fm/tag/punk", "name": "punk"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "705776ca-e5c6-4444-963c-fddfe8e2d55e", "duration": "154000", "playcount": "4615649", "id": "1001772"}}