{"track": {"album": {"@attr": {"position": "1"}, "title": "Nevermind", "url": "http://www.last.fm/music/Nirvana/Nevermind", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83456717.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83456717.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83456717.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83456717.png", "size": "extralarge"}], "artist": "Nirvana", "mbid": "e4520f1b-80fc-4bb8-9f45-0d98ac3c152f"}, "wiki": {"content": "Frequently cited as one of the most important songs in the history of rock music, Nirvana's 1991 single &quot;Smells Like Teen Spirit&quot; almost single handedly popularized alternative rock and simultaneously brought the era of hair metal and pop metal to an end. \n \n Often cited as an anthem for Generation X, the chord progression for this song is strikingly similar to that of <a title=\"Boston &ndash; More Than a Feeling\" href=\"http://www.last.fm/music/Boston/_/More+Than+a+Feeling\" class=\"bbcode_track\">More Than a Feeling</a> by <a href=\"http://www.last.fm/music/Boston\" class=\"bbcode_artist\">Boston</a>, a fact which Kurt Cobain openly acknowledged. \n \n Kurt Cobain said that this song was an attempt to write a song in the style of alternative rock band <a href=\"http://www.last.fm/music/Pixies\" class=\"bbcode_artist\">Pixies</a>, which he was a devotee of. This song features characteristic &quot;Pixies dynamics&quot;, in that it alternates between soft, quiet sections (in the verses) and loud, heavy sections (in the chorus). Kathleen Hanna, the lead singer of the group Bikini Kill, gave Cobain the idea for the title when she spray painted &quot;Kurt Smells Like Teen Spirit&quot; on his bedroom wall after a night of drinking and spraying graffiti around the Seattle area. In his pre-Courtney Love days, Cobain went out with Bikini Kill lead singer Tobi Vail, but she dumped him. Vail wore Teen Spirit deodorant, and Hanna was implying that Cobain was marked with her scent.Cobain didn't know it when he wrote the song, but Teen Spirit is a brand of deodorant marketed to young girls. Kurt thought Hanna was complimenting him on his rebellious spirit. Sales of Teen Spirit deodorant shot up when this became a hit, even though it is never mentioned in the lyrics.The video was inspired by the movie and song Rock And Roll High School by the Ramones. At the end of the video, when the band and the teenagers smash the set, it is real. The band and the teenagers had began getting mad after being on set for over 8 hours, and one of the teenagers asked if everyone could destroy the set. The producer said yes, so they destroyed it.The group hated the video, but everyone else loved it. The concept was &quot;Pep Rally from Hell.&quot; The cheerleaders were strippers.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Frequently cited as one of the most important songs in the history of rock music, Nirvana's 1991 single &quot;Smells Like Teen Spirit&quot; almost single handedly popularized alternative rock and simultaneously brought the era of hair metal and pop metal to an end.   Often cited as an anthem for Generation X, the chord progression for this song is strikingly similar to that of <a title=\"Boston &ndash; More Than a Feeling\" href=\"http://www.last.fm/music/Boston/_/More+Than+a+Feeling\" class=\"bbcode_track\">More Than a Feeling</a> by <a href=\"http://www.last.fm/music/Boston\" class=\"bbcode_artist\">Boston</a>, a fact which Kurt Cobain openly acknowledged.   ", "published": "Wed, 21 Nov 2012 03:41:27 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Smells Like Teen Spirit", "artist": {"url": "http://www.last.fm/music/Nirvana", "mbid": "5b11f4ce-a62d-471e-81fc-a69a8278c7da", "name": "Nirvana"}, "url": "http://www.last.fm/music/Nirvana/_/Smells+Like+Teen+Spirit", "listeners": "1678807", "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/nirvana", "name": "nirvana"}]}, "mbid": "730fa054-d585-4a04-bd0f-5f48cc9c291c", "duration": "302000", "playcount": "11985802", "id": "9975"}}