{"track": {"album": {"@attr": {"position": "2"}, "title": "The Future Starts Here: The Essential Doors Hits", "url": "http://www.last.fm/music/The+Doors/The+Future+Starts+Here:+The+Essential+Doors+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87574361.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87574361.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87574361.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87574361.png", "size": "extralarge"}], "artist": "The Doors", "mbid": "2d4a66b0-c436-4f44-b3d4-29e6e8db8d8c"}, "wiki": {"content": "&quot;Light My Fire&quot; is a song originally performed by The Doors which was recorded in August 1966 and released in January 1967. It spent three weeks at number one on the Billboard's Hot 100, and one week on the Cashbox Top 100. It was re-released in 1968, peaking at number 87. The song was largely written by Robby Krieger, and credited to the entire band. \n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=220\" rel=\"nofollow\">Light My Fire Songfacts</a>, this was the last song Jim Morrison performed live. It was a show at The Warehouse in New Orleans.\n \n A live version was released in 1983 on their album Alive, She Cried, the first of several live or compilation albums released in subsequent decades to include the song.\n \n The song is #35 on Rolling Stone's list of the 500 Greatest Songs of All Time. It was also included in the Songs of the Century list and was ranked number 7 in VH1's 100 Greatest Songs of All Time list.\n \n José Feliciano's cover version won a 1969 Grammy Award for Best Male Pop Vocal Performance, the same year he won another Grammy for Best New Artist.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Light My Fire&quot; is a song originally performed by The Doors which was recorded in August 1966 and released in January 1967. It spent three weeks at number one on the Billboard's Hot 100, and one week on the Cashbox Top 100. It was re-released in 1968, peaking at number 87. The song was largely written by Robby Krieger, and credited to the entire band.   According to the <a href=\"http://www.songfacts.com/detail.php?id=220\" rel=\"nofollow\">Light My Fire Songfacts</a>, this was the last song Jim Morrison performed live. It was a show at The Warehouse in New Orleans.  ", "published": "Tue, 21 Dec 2010 18:10:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Light My Fire", "artist": {"url": "http://www.last.fm/music/The+Doors", "mbid": "9efff43b-3b29-4082-824e-bc82f646f93d", "name": "The Doors"}, "url": "http://www.last.fm/music/The+Doors/_/Light+My+Fire", "listeners": "830523", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/psychedelic%20rock", "name": "psychedelic rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/psychedelic", "name": "psychedelic"}]}, "mbid": "77026339-0a17-4dc7-8777-9a75d4de53cb", "duration": "429000", "playcount": "4566876", "id": "8768"}}