{"track": {"album": {"@attr": {"position": "1"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Bruce+Springsteen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91266097.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91266097.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91266097.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91266097.png", "size": "extralarge"}], "artist": "Bruce Springsteen", "mbid": "ce73ebd3-5ae0-35a0-93e8-187bcc7fa47a"}, "wiki": {"content": "Born to Run is the signature song of the American singer songwriter Bruce Springsteen, and the title song of his album Born to Run. Written in a small house in Long Branch, New Jersey in early 1974, the song was Bruce Springsteen's last-ditch effort to make it big. The prior year, Springsteen had released two albums to critical acclaim but with little commercial success. The lyrics to the song are appropriately epic for his last-ditch, all-or-nothing shot at the stars, yet they remain rooted in the universal desperation of adolescence: We gotta get out while we're young, 'cause tramps like us, baby we were born to run.\n \n Written in the first person, the song is a love letter to a girl named Wendy (Wendy let me in I wanna be your friend I wanna guard your dreams and visions...; I wanna die with you Wendy on the streets tonight/in an everlasting kiss!), for whom the motorcycle-riding protagonist certainly has enough passion to love, but perhaps not the patience. However, Springsteen has noted that it has a much simpler core: getting out of Asbury Park.\n \n In recording the song, Springsteen first earned his noted reputation for perfectionism, laying down as many as eleven guitar tracks to get the sound just right. The recording process and alternate ideas for the song's arrangement are described in the Wings For Wheels documentary DVD included in the 2005 reissue Born to Run 30th Anniversary Edition package.\n \n The track was recorded at 914 Sound Studios in Blauvelt, New York amidst touring breaks during 1974, with final recording done on August 6, well in advance of the rest of the album, and featured Ernest &quot;Boom&quot; Carter on the drums and David Sancious on keyboards; they would be replaced by Max Weinberg and Roy Bittan for the rest of the album and in the ongoing E Street Band (which was still uncredited on Springsteen's records at the time). The song was also recorded with only Springsteen and Mike Appel as producers; it would be later in the following year, when work on the album bogged down, that Jon Landau was brought in as an additional producer.\n \n In his 1996 book Songs, Springsteen relates that while the beginning of the song was written on guitar around the opening riff, the song's writing was finished on piano, the instrument that most of the Born to Run album was composed on.\n \n In the period prior to the release of Born to Run Springsteen was becoming well-known (especially in his native northeast) for his epic live shows. &quot;Born to Run&quot; joined his concert repertoire well before the release of the album, being performed in concert by May 1974 if not earlier.\n \n The first recording of the song was made by Allan Clarke of the British group The Hollies, although its release was delayed, only appearing after Springsteen's own now-famous version.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Born to Run is the signature song of the American singer songwriter Bruce Springsteen, and the title song of his album Born to Run. Written in a small house in Long Branch, New Jersey in early 1974, the song was Bruce Springsteen's last-ditch effort to make it big. The prior year, Springsteen had released two albums to critical acclaim but with little commercial success. The lyrics to the song are appropriately epic for his last-ditch, all-or-nothing shot at the stars, yet they remain rooted in the universal desperation of adolescence: We gotta get out while we're young...", "published": "Sat, 7 Mar 2009 12:21:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Born to Run", "artist": {"url": "http://www.last.fm/music/Bruce+Springsteen", "mbid": "70248960-cb53-4ea4-943a-edb18f7d336f", "name": "Bruce Springsteen"}, "url": "http://www.last.fm/music/Bruce+Springsteen/_/Born+to+Run", "listeners": "457831", "comments": ["'cause tramps like us, baby we were born to run!!", "The perfect song.", "Miss ya Big Man...", "Classique", "The original and best.", "I enjoy how the song comes to a full stop two thirds into the song, then kicks into third gear and blasts into the third verse.", "still get goosebumps every time....", "Nice!", "\"Its a death trap we gotta get out while were young\" - They wanted to make this the state song for Jersey - oh yeah that encourages tourism!", "Let me in, I wanna be your friend, I want to guard your dreams and visions, just wrap your legs 'round these velvet rims and strap your hands across my engines. Together we could break this trap, we'll run till we drop, baby we'll never go back, oh-oh, Will you walk with me out on the wire?", "Boss", "epic sax guy", "Spectorian as fuck", "a great track,...........................", "This song is the ultimate drive song and it is the pure definition of Springsteen", "almost can see and smell urban new jersey in the heat of summer and just hanging out with cars and girls and dreams---never experienced first hand but thats what it sounds like", "greatest tune to hit the highway with no destination in mind", "Only the BOSS could pull this off. Great tune. Although Frankie Goes to Hollywood's cover is very moving too.", "this song makes me feel A L I V E", "Boss !"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/bruce%20springsteen", "name": "bruce springsteen"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}]}, "mbid": "", "duration": "266000", "playcount": "2136147", "id": "1005805"}}