{"track": {"album": {"@attr": {"position": "1"}, "title": "The Resistance", "url": "http://www.last.fm/music/Muse/The+Resistance", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/65553108.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/65553108.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/65553108.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/65553108.png", "size": "extralarge"}], "artist": "Muse", "mbid": ""}, "wiki": {"content": "&quot;Uprising&quot; is a song by British rock band Muse, featured on their fifth studio album The Resistance. Written by lead vocalist and guitarist Matthew Bellamy, the song was released as the lead single from the album on 7 September, 2009. The song remained at the #1 position on the Billboard Alternative Songs chart for 17 nonconsecutive weeks, and has become the band's most successful song in the United States. The song was mixed by Mark 'Spike' Stent. It was also the last UK single to top an American chart for the 2000s, according to the December 30, 2009 Nielsen BDS alternative chart, and also the first UK single to top an American chart for the 2010s.\n \n The title &quot;Uprising&quot; was first revealed on 3 July 2009, when the album's track listing was released sporadically on the band's Twitter page; the song was unveiled as the opening track of the album, preceding the title track &quot;Resistance&quot;. In a pre-release review, French media source JudeBox described the song as follows:\n \n “ Matt Bellamy's voice is deeper than usual. In terms of lyrics, this is the usual Muse: conspiracies, apocalypse, he announces a gathering, speaks of victory and that &quot;they will not control us.&quot; The sound, still very dense and heavy is accompanied by passages of synths. The overall structure is rather straightforward. [Translated from French] ” \n \n Various sources have noted the synthesizer melody in the song's introduction sounds similar to the guitar riff in &quot;White Wedding&quot; by Billy Idol. The song's drums, clapping rhythm, synthesizer melody and patch, and general feel deeply resembles The Timelords/KLF's track &quot;Doctorin' the Tardis&quot;, an homage to the long-running BBC series Doctor Who which itself uses the riff from Garry Glitter's &quot;Rock and Roll&quot;. The guitar riff also is very similar to the chorus of Blondie's &quot;Call Me&quot;.\n \n While &quot;United States of Eurasia&quot; was initially thought by the Muse fan community to be the first single due for release, Muse revealed, via their Twitter page, that it would in fact be &quot;Uprising&quot;. It was revealed in July 2009 that the band would perform at the 2009 MTV Video Music Awards. They played at the theatre across the street from where the VMAs were held, and were introduced by Gerard Butler. On July 28, 2009 Zane Lowe played a 32 second sample on BBC Radio 1 ahead of its first play in full on August 3, 2009. After being released to radio in the United States, the single reached #1 on the Billboard Hot Alternative Songs chart on September 9, 2009, becoming Muse's 6th Top 10 single and first #1 on that chart, eventually spending 17 weeks at #1, becoming the second the longest running #1 song ever on the chart. It became their first Billboard Hot 100 single (and Top 40 single), peaking at #37, achieving this with virtually no pop radio airplay, instead relying on iTunes sales and alternative rock radio airplay. The song peaked at #9 on the UK Singles Chart and is the band's fourth top 10 single on that chart.\n \n &quot;Uprising&quot; won the Best Single award at the 2010 Music Producers Guild Awards in London.\n \n &quot;Uprising&quot; is often played on Network Ten's AFL broadcasts. \n It is frequently played at Sydney Roosters home matches in 2010. \n It is also featured in the trailer for the 2010 film Knight &amp; Day and in promos for the March 30, 2010 return of V.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Uprising&quot; is a song by British rock band Muse, featured on their fifth studio album The Resistance. Written by lead vocalist and guitarist Matthew Bellamy, the song was released as the lead single from the album on 7 September, 2009. The song remained at the #1 position on the Billboard Alternative Songs chart for 17 nonconsecutive weeks, and has become the band's most successful song in the United States. The song was mixed by Mark 'Spike' Stent.", "published": "Sun, 9 May 2010 04:33:42 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Uprising", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Uprising", "listeners": "732987", "comments": ["a masterpiece", "Good song", "Doctor Who AND Marilyn Manson. SPECTACULAR [2]", "They'll not control us, an obsessed by control will say that. Whoo!", "beast song", "Ooooh.  Doctor Who  AND  Marilyn Manson.\r\nSPEC.\r\nTACULAR.", "TAKE THE POWER BACK!", "This reminds me of Dr. Who's theme [3]", "The intro sounds like Marilyn Manson (!) (?)", "so epic!", "Such Angst!!", "THEYYYYYYYYYY WILLLLLLL NOTTTT FORRRRRRRRRRRRRRCE UUUUUUUUUUUS\r\n\r\nhis voice is like... inhumanely good and attractive", "Fantastic track!", "*cough* rip off *cough*", "it's The Doctor!! doctor who?", "We Will Be Victorious :D", "This reminds me of Dr. Who's theme [2] not only do I love this song for its Whovian scifi-ness but the political meaning to the song is FUCKING ACE. What a brilliant song.", "This reminds me of Dr. Who's theme.", "One of the best and most original bands to come out in years!", "New photo. Vote up if you like it http://www.last.fm/music/Muse/+images/71215290"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "8c81cd5e-75c2-4751-996a-16463c028fb9", "duration": "248000", "playcount": "7030618", "id": "325385167"}}