{"track": {"album": {"@attr": {"position": "13"}, "title": "Rolled Gold +", "url": "http://www.last.fm/music/The+Rolling+Stones/Rolled+Gold+%252B", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/50670591.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/50670591.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/50670591.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/50670591.png", "size": "extralarge"}], "artist": "The Rolling Stones", "mbid": ""}, "wiki": {"content": "&quot;You Can't Always Get What You Want&quot; is a song by the Rolling Stones released on their 1969 album Let It Bleed. Written by Mick Jagger and Keith Richards, it was named as the 100th greatest song of all time by Rolling Stone (magazine) in its 2004 list of &quot;500 Greatest Songs of All Time.&quot;\n &quot;You Can't Always Get What You Want&quot; was recorded on November 16 and November 17, 1968 at London's Olympic Sound Studios. It features the London Bach Choir powerfully opening the song under the stewardship of Javier Sanchez Broto, highlighting throughout, and bringing it to an uproarious conclusion. Jimmy Miller, the Rolling Stones' producer at the time, plays drums on this song instead of Charlie Watts. Al Kooper plays piano, organ and horn while Rocky Dijon plays congas and maracas. Nanette Workman sings backup vocals, but she is credited as &quot;Nanette Newman&quot;.\n \n Of the song, Jagger said in 2003, &quot;'You Can't Always Get What You Want' was something I just played on the acoustic guitar - one of those bedroom songs. It proved to be quite difficult to record because Charlie couldn't play the groove and so Jimmy Miller had to play the drums. I'd also had this idea of having a choir, probably a gospel choir, on the track, but there wasn't one around at that point. Jack Nitzsche, or somebody, said that we could get the London Bach Choir and we said, 'That will be a laugh.'&quot;[1]\n \n In his review of the song, Richie Unterberger says, &quot;If you buy John Lennon's observation that the Rolling Stones were apt to copy the Beatles' innovations within a few months or so, &quot;You Can't Always Get What You Want&quot; is the Rolling Stones' counterpart to 'Hey Jude.'&quot; Jagger said in 1969, &quot;I liked the way the Beatles did that with 'Hey Jude'. The orchestra was not just to cover everything up - it was something extra. We may do something like that on the next album.&quot;[2]\n \n The three verses (along with the varied theme in the 4th verse) address the major topics of the 1960s: love, politics, and drugs. Each verse captures the essence of the initial optimism and eventual disillusion, followed by the resigned pragmatism in the chorus.\n \n Unterberger concludes of the song, &quot;Much has been made of the lyrics reflecting the end of the overlong party that was the 1960s, as a snapshot of Swinging London burning out. That's a valid interpretation, but it should also be pointed out that there's also an uplifting and reassuring quality to the melody and performance. This is particularly true of the key lyrical hook, when we are reminded that we can't always get what we want, but we'll get what we need.&quot;\n \n Release and aftermath\n Though popular on modern classic rock radio stations, &quot;You Can't Always Get What You Want&quot; was not released as a single, but rather as the B-Side to &quot;Honky Tonk Women&quot;, albeit in an edited form (4:49). One of the Stones' most popular recordings, it has since appeared on the compilations Hot Rocks, Singles Collection and Forty Licks.\n \n &quot;You Can't Always Get What You Want&quot; is very popular at Stones shows due to the sing-along chorus, and is played at almost every show (where it is custom for Jagger to change the lyrics from &quot;my favourite flavour, cherry red&quot; to the question &quot;What's your favourite flavour?&quot; to which the audience replies &quot;Cherry red&quot;). Live recordings appear on the albums Love You Live, Flashpoint, Live Licks, and The Rolling Stones Rock and Roll Circus.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;You Can't Always Get What You Want&quot; is a song by the Rolling Stones released on their 1969 album Let It Bleed. Written by Mick Jagger and Keith Richards, it was named as the 100th greatest song of all time by Rolling Stone (magazine) in its 2004 list of &quot;500 Greatest Songs of All Time.&quot;\n &quot;You Can't Always Get What You Want&quot; was recorded on November 16 and November 17, 1968 at London's Olympic Sound Studios. It features the London Bach Choir powerfully opening the song under the stewardship of Javier Sanchez Broto, highlighting throughout, and bringing it to an uproarious conclusion.", "published": "Sun, 2 May 2010 09:26:02 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "You Can't Always Get What You Want", "artist": {"url": "http://www.last.fm/music/The+Rolling+Stones", "mbid": "b071f9fa-14b0-4217-8e97-eb41da73f598", "name": "The Rolling Stones"}, "url": "http://www.last.fm/music/The+Rolling+Stones/_/You+Can%27t+Always+Get+What+You+Want", "listeners": "569212", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/the%20rolling%20stones", "name": "the rolling stones"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "a5a3082c-c929-46dd-9d7c-71fcf1833b76", "duration": "264000", "playcount": "2542321", "id": "1013541"}}