{"track": {"album": {"@attr": {"position": "6"}, "title": "Physical Graffiti", "url": "http://www.last.fm/music/Led+Zeppelin/Physical+Graffiti", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90394981.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90394981.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90394981.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90394981.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "40d746fc-ceab-353c-9a8f-263e2ab6622c"}, "wiki": {"content": "&quot;Kashmir&quot; is a song by the English rock band Led Zeppelin from their sixth album Physical Graffiti (1975). It was written by Jimmy Page and Robert Plant (with contributions from John Bonham) over a period of three years, with the lyrics dating back to 1973.\n \n &quot;Kashmir&quot; is considered to be one of Led Zeppelin's most successful songs; all four band members have agreed that it is to date one of their best musical achievements.\n \n John Paul Jones suggested that it showcases all of the elements that made up the Led Zeppelin sound. During a television interview in January 2008, Plant named &quot;Kashmir&quot; as his first choice of all Led Zeppelin songs that he would perform, commenting &quot;I'm most proud of that one&quot;.\n Page has indicated he thinks that the song is one of the band's best compositions.\n \n The song centres around a signature chord progression guitar riff, which first appeared on Page's home-studio work tapes.\n It was initially a tuning, an extension of a guitar-cycle that Page had been working on for years. \n This was the same cycle that produced &quot;Black Mountain Side,&quot; &quot;White Summer&quot; and the unreleased track, &quot;Swan-song.&quot;\n As bass player and keyboardist John Paul Jones had been late for the recording sessions, Page used the time to work on the riff with drummer John Bonham. \n The two demoed it late in 1973.\n Plant later added the middle section and in early 1974 Jones added all the string parts.\n The guitar was played in an alternative guitar tuning: the strings are tuned to 'Open Dsus4' or DADGAD. \n Bonham's drums feature a phasing effect courtesy of an early Eventide phaser supplied by engineer Ron Nevison.\n Plant has stated that Bonham's drumming is the key to the song: &quot;It was what he didn't do that made it work&quot;.\n The song also includes many distinctive musical patterns of classical Moroccan, Indian and Middle Eastern music. \n Orchestral brass and strings with electric guitar and mellotron strings are used in the song. \n This is one of the few Led Zeppelin songs to use outside musicians. \n Session players were brought in for the string and horn sections.\n According to Jones, &quot;the secret of successful keyboard string parts is to play only the parts that a real string section would play. \n That is, one line for the First Violins, one line for Second Violins, one for Violas, one for Cellos, one for Basses. Some divided parts [two or more notes to a line] are allowed, but keep them to a minimum. Think melodically&quot;.\n \n Originally called &quot;Driving to Kashmir&quot;, the lyrics to the song were written by Plant in 1973 while driving from Goulimine to Tantan in the Sahara Desert, Morocco, immediately after Led Zeppelin's 1973 US Tour.\n This was despite the fact that the song is named for Kashmir, a region in the northernmost part of the Indian subcontinent.\n \n As Plant explained to rock journalist Cameron Crowe:\n “\tThe whole inspiration came from the fact that the road went on and on and on. It was a single-track road which neatly cut through the desert. Two miles to the East and West were ridges of sandrock. It basically looked like you were driving down a channel, this dilapidated road, and there was seemingly no end to it. 'Oh, let the sun beat down upon my face, stars to fill my dreams...' It's one of my favourites...that, 'All My Love' and 'In the Light' and two or three others really were the finest moments. But 'Kashmir' in particular. It was so positive, lyrically.\n \n In an interview he gave to William S. Burroughs in 1975, Page mentioned that at the time the song was composed, none of the band members had even been to Kashmir.\n \n The song runs for 8:28, a length that radio stations usually consider too long to play. However, upon its release radio stations had no problem playing &quot;Kashmir,&quot; especially after seeing &quot;Stairway to Heaven&quot;, which was almost as long, do so well. (Original LP releases of Physical Graffiti incorrectly list the song's length as 9:41.)\n \n &quot;Kashmir&quot; was played live at almost every Led Zeppelin concert from its debut in 1975. One live version, from Led Zeppelin's performance at Knebworth in 1979, is featured on disc 2 of the Led Zeppelin DVD. \n This performance came from the band's first show at the venue, on 4 August. &quot;Kashmir&quot; was also performed at Led Zeppelin's reunion show at the O2 Arena, London on December 10, 2007.\n \n Led Zeppelin expert Dave Lewis describes &quot;Kashmir&quot; as:\n “\tUnquestionably the most startling and impressive track on Physical Graffiti, and arguably the most progressive and original track that Led Zeppelin ever recorded. 'Kashmir' went a long way towards establishing their credibility with otherwise sceptical rock critics. Many would regard this track as the finest example of the sheer majesty of Zeppelin's special chemistry.\n \n The song was ranked the 140th greatest song of all time on Rolling stone magazine's list of the 500 greatest songs of all time in 2004.\n \n References\n \n \n ^ Led Zeppelin: The Definitive Biography by Ritchie Yorke\n ^ a b c d e f g Liner notes by Cameron Crowe for The Complete Studio Recordings.\n ^ Untitled Document\n ^ Dave Schulps, Interview with Jimmy Page, Trouser Press, October 1977.\n ^ a b c d e Dave Lewis (1994), The Complete Guide to the Music of Led Zeppelin, Omnibus Press, ISBN 0-7119-3528-9.\n ^ Guitar World, May 2005\n ^ John Paul Jones' Mellotron\n ^ Gilmore, Mikal (August 10, 2006). &quot;The Long Shadow of Led Zeppelin&quot;. Rolling Stone (1006). Retrieved on 9 December 2007.\n ^ William S. Burroughs, Rock Magic: Jimmy Page, Led Zeppelin, and a Search for the Elusive Stairway to Heaven, Crawdaddy!, June 1975.\n ^ <a href=\"http://www.rollingstone.com/news/story/6595985/kashmir\" rel=\"nofollow\">http://www.rollingstone.com/news/story/6595985/kashmir</a>\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Kashmir&quot; is a song by the English rock band Led Zeppelin from their sixth album Physical Graffiti (1975). It was written by Jimmy Page and Robert Plant (with contributions from John Bonham) over a period of three years, with the lyrics dating back to 1973.  &quot;Kashmir&quot; is considered to be one of Led Zeppelin's most successful songs; all four band members have agreed that it is to date one of their best musical achievements.  ", "published": "Tue, 21 Apr 2009 09:54:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Kashmir", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Kashmir", "listeners": "565979", "comments": ["GREAT", "I've never head a song so powerful in it's delivery and subtitles. And Yes, I've heard it all.", "One of the greatest songs in the history of music.[2]", "De las mejores de Led Zeppelin (2)", "Sweet.", "De las mejores de Led Zeppelin.", "Dramatic Music - the kind that plays when the bogeymen/zombies are about to make an appearance :P", "May I please have a cigarette now !!!!", "Wow.................!", ":-)) Amazing!!!!! ♥♥♥", "In 'Fast times at Ridgemont High', remember the advice given to \"Rat\" on his date?  Play Led Zep, first side of the fourth album, so you can score.  Then he played this with the girl in the car!!!!!!", "Timeless classic", "My favourite song by them! Outstanding piece of music.", "Lembra a minha infância. Meu pai sempre ouvia esse disco...", "This is without a doubt the pinnacle of Led Zeppelin's career.", "Best planet under the album.", "<3", "Just great song. It needs no words.", "My favorite Zeppelin song <3", "Com certeza uma das melhores músicas da história do Rock. sz"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/led%20zeppelin", "name": "led zeppelin"}]}, "mbid": "ac84d9aa-d360-4c46-9c0e-a816b767cd50", "duration": "508000", "playcount": "3250753", "id": "1048013"}}