{"track": {"album": {"@attr": {"position": "2"}, "title": "1984", "url": "http://www.last.fm/music/Van+Halen/1984", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/85296157.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/85296157.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/85296157.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/85296157.png", "size": "extralarge"}], "artist": "Van Halen", "mbid": "2e7e7dde-c0d1-338d-b84e-cae44fc09720"}, "wiki": {"content": "&quot;Jump!&quot; is a song recorded by the rock group Van Halen. It is the only single the group released in their career to reach #1 on the U.S. Billboard Hot 100. It was released in 1984 as the second track on the album 1984. The song breaks the mold of earlier Van Halen songs, mainly in its rolling synth line (played on an Oberheim OB-X), although the song contains the standard Eddie Van Halen guitar solo, which Eddie claims as his favorite solo he ever wrote.\n \n &quot;Jump&quot; may be Van Halen's most popular and instantly recognizable composition, perhaps because its sound embodies the key aspects of both of the two genres of popular music most associated with the 1980s in America: synth-driven pop and &quot;arena&quot;-style metal. Its synthesized brass introduction is one of popular music's most recognizable musical introductions. The song changed the future and style of Van Halen from being a predominantly hard rock band to one of more radio-oriented popular music.\n \n This stylistic change was further cemented when it seemed to create severe tensions between Eddie Van Halen and David Lee Roth. Roth, it has been claimed, wanted the band to avoid using synthesizers and focus more on traditional hard rock. This conflict eventually ended in Roth's departure from the band. In the 1995 Rolling Stone cover story on/interview with Eddie Van Halen (RS #705, dated April 6) the circumstances surrounding Roth's leaving are discussed. In this interview Eddie claims that the main reason for the split was that Roth and Templeman both disliked the fact that he had built his own studio and was able to work on music away from their influence. He said that &quot;the first thing I did up here was &quot;Jump&quot; and they [Roth and Templeman] didn't like it. I said 'take it or leave it', I was getting sick of their ideas of what was commercial ... At first [Roth's solo EP] Crazy From the Heat was great because Roth laid off me a bit. Little did I know he was testing the waters. Then he called me up and asked me to go to his house and said he was going to make a Crazy From the Heat movie. He had some deal that fell through. But at the time I was depressed. I cried, then I called my brother and told him the motherfucker quit.&quot;\n \n Nevertheless, Roth and Templeman did work on &quot;Jump&quot; at Eddie's disputed new studio, with Roth providing the lyrics and the vocal melody.\n \n Ted Templeman recalls that &quot;'Jump' was recorded at Ed's studio. [Engineer] Donn [Landee] and Ed put the track down alone in the middle of the night. We recut it once in one take for sonic reasons. Dave wrote the lyrics that afternoon in the backseat of his Mercury convertible. We finished all vocals that afternoon and mixed it that evening&quot;.\n \n The song thereafter secured its place among rock music's most popular songs, and is now considered by some to be one of the most influential rock songs of all time.\n \n Live performances of &quot;Jump&quot; is preceded by Eddie's synthesizer solo &quot;1984&quot;. During the reunion tour with Roth, the two songs have been used for the band's encore. Roth often waved a large red flag during the synth section while the stage was still coated in dark cover lights.\n \n The music video for &quot;Jump&quot; was directed by David Lee Roth. It is a straightforward concept, much like many of the hard rock videos of the time. It shows the band performing at a mock concert and performing the song. It was nominated for three MTV Video Music Awards, and won &quot;best stage performance&quot; for the video.\n \n The version of the song used for the video differs slightly from the album version. During the keyboard solo prior to the final refrain, David Lee Roth is heard (and seen) yelling out. He did this during the band's mock performance for the video's filming, and it is believed that afterwards he overdubbed this yell especially for the video version since it is not present in the song to begin with.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Jump!&quot; is a song recorded by the rock group Van Halen. It is the only single the group released in their career to reach #1 on the U.S. Billboard Hot 100. It was released in 1984 as the second track on the album 1984. The song breaks the mold of earlier Van Halen songs, mainly in its rolling synth line (played on an Oberheim OB-X), although the song contains the standard Eddie Van Halen guitar solo, which Eddie claims as his favorite solo he ever wrote.  ", "published": "Mon, 27 Jul 2009 19:26:02 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Jump", "artist": {"url": "http://www.last.fm/music/Van+Halen", "mbid": "b665b768-0d83-4363-950c-31ed39317c15", "name": "Van Halen"}, "url": "http://www.last.fm/music/Van+Halen/_/Jump", "listeners": "545866", "comments": ["Dan, I disagree with you, man! Great vid and song!!! What memories!!", "Check out this bonkers ukulele version: http://www.youtube.com/watch?v=T8jpwJs5Szw&feature=c4-overview&list=UU7-qFbaRHtjDdWzBBu1adog", "The worst VH song ever... dull and overrated", "The best one! Jump, jump, jump!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Many memories indeed this song and album were released New Years Day 1984 and every song and video were smash hits the album ended up selling ten million copies but then at the peak of their success DLR left the band.", "Jump ;-)", "Forever a classic!", "So many memories.. :)", "love this song....", "On December 31, 2013 they should play this live on the brink of 2014, 30 years after the year 1984 X2", "I love this song and always stop what I'm doing if the video comes on TV.  David Lee Roth was something of a looker back in the day!", "JUMP", "JUMP! :D", "win.", "Nice!", "Красиво и сильно...", "Great song.", "Great song", "great track,...............", "don't jump Sammy ! you might break a hip!! J.K. i like Sammy just not on this song!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/van%20halen", "name": "van halen"}]}, "mbid": "ae616f13-1d3a-4afb-8646-41661e2d142d", "duration": "242000", "playcount": "2415425", "id": "1047770"}}