{"track": {"album": {"@attr": {"position": "4"}, "title": "Americana", "url": "http://www.last.fm/music/The+Offspring/Americana", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/39108805.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/39108805.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/39108805.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/39108805.png", "size": "extralarge"}], "artist": "The Offspring", "mbid": "d1d925e6-b05f-3301-ac98-4b7f951fea0d"}, "wiki": {"content": "&quot;Pretty Fly (For a White Guy)&quot; is a punk rock song by The Offspring. It is the fourth track from their fifth studio album Americana (1998) and was released as the first single from the album. It achieved significant pop and alternative radio play and popularity, peaking at number 53 on the US charts and at number 5 on the U.S. Billboard Hot Mainstream Rock Tracks. The song reached the charts in over 15 countries and peaked at #1 in nine of these, including Australia and the United Kingdom, making it one of the most commercially successful singles released by the band.\n \n The song appears as the seventh track on their Greatest Hits (2005).\n \n Beginning with a sample of the pseudo-German nonsense phrase &quot;Gunter glieben glauchen globen&quot; from Def Leppard's song &quot;Rock of Ages,&quot; chanted as a replacement for the traditional &quot;1, 2, 3, 4&quot; to start the recording, the song ridicules a &quot;wannabe gangsta&quot; (or &quot;wangster&quot;) who is immersed in hip-hop culture not because he truly loves or understands it, but because it is trendy, makes him feel tough (&quot;friends say he's tryin' too hard, and he's not quite hip/but in his own mind, he's the - he's the dopest trip&quot;) and makes it seem that he can get all the girls (&quot;and all the girls say I'm pretty fly - for a white guy&quot;). The song openly mocks the middle-class suburban youths who listen to rap music for this reason. The female vocals are performed by Nika Futterman.\n \n In the video, directed by McG, the &quot;white guy&quot; drives through town in his lowrider and tries to act cool in front of people, playing with car's hydraulic system and interrupting a break dance session to dance. He is then carried by girls watching it to a pool party and thrown into the pool. These scenes are cut by the band's playing. The video ends with the &quot;white guy&quot; returning home and accidentally scaring his little sister wearing a fairy costume because of his appearance.\n \n Noodles has stated that it was one of his favorite videos to make.\n \n Guy Cohen cameos as the &quot;white guy&quot; driving by in his lowrider at the end of the &quot;Why Don't You Get a Job?&quot; video.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Pretty Fly (For a White Guy)&quot; is a punk rock song by The Offspring. It is the fourth track from their fifth studio album Americana (1998) and was released as the first single from the album. It achieved significant pop and alternative radio play and popularity, peaking at number 53 on the US charts and at number 5 on the U.S. Billboard Hot Mainstream Rock Tracks. The song reached the charts in over 15 countries and peaked at #1 in nine of these, including Australia and the United Kingdom, making it one of the most commercially successful singles released by the band. ", "published": "Fri, 17 Feb 2012 00:55:21 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Pretty Fly (For a White Guy)", "artist": {"url": "http://www.last.fm/music/The+Offspring", "mbid": "23a03e33-a603-404e-bcbf-2c00159d7067", "name": "The Offspring"}, "url": "http://www.last.fm/music/The+Offspring/_/Pretty+Fly+(For+a+White+Guy)", "listeners": "642794", "comments": ["gunter glieben glauchen globen", "I was expecting Def Leppard, not this shit", "my life :|", "clasico de una banda mitica como THE OFFSPRING, X FIN EN CHILE", "skip", "immer wieder GEIL", "childhood <3", "Un, dos, tres, cuatro, cinco, cinco, seis... :D [8]", "\"Everything he lacks, he makes up in denial.\" classic ♥", "\"He asked for a thirteen but they drew a thirty-one.\" This :D", "•*¨*•.¸¸❤¸¸.•*¨*•", "too mainstream for me", "They say I'm pretty fly (for a Russian Guy)", "Ahh Middle School.", "I digged this song when I was a kid.\r\nIt's worth mentioning I had no idea what it was about.", "I remember being 7 and trying to figure this shit out.", "Love this song I lol every time i hear it :D", "muito foda !!!!!!!!!!!!!!!!!!\nOffspring yeaahhhh !!\n\n=]", "my youth...  ♫ ♩ ♬ ♭ ♫♪", "This totally reminds me of Crazy Taxi (though I forgot what song really was on it). \r\nGood times."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/punk%20rock", "name": "punk rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/punk", "name": "punk"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}]}, "mbid": "b15efb7c-93a6-45f1-be00-7c6567144048", "duration": "188000", "playcount": "3260586", "id": "1018163"}}