{"track": {"album": {"@attr": {"position": "5"}, "title": "A Rush of Blood to the Head", "url": "http://www.last.fm/music/Coldplay/A+Rush+of+Blood+to+the+Head", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88463753.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88463753.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88463753.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88463753.png", "size": "extralarge"}], "artist": "Coldplay", "mbid": "53e93362-49f6-322f-8ae4-15a416c83209"}, "wiki": {"content": "&quot;Clocks&quot; emerged in conception during the late stages into the production of Coldplay's second album, A Rush of Blood to the Head. The band's vocalist, Chris Martin, came in studio late one night. A riff popped  up in Martin's mind and wrote it on the  piano. Martin presented the riff to the band's guitarist, Jonny Buckland, who then added guitar chords on the basic track.\n \n During the writing of &quot;Clocks&quot;, the band had already made 10 songs for the album. With this, they thought it was too late for the song's inclusion in the album. So, they recorded a demo version of the track and saved it with other unfinished tracks, labeling it &quot;Songs for #3&quot;; the band considered these tracks for their third album, X&amp;Y.\n \n Although the band left &quot;Clocks&quot; unfinished, a friend of Martin heard of it and convinced him to finish the track. Marked by its lyrics which speak of urgency, Martin's friend pointed out that its meaning would contradict Martin's idea of stashing the track.\n \n Persuaded by his friend, Martin assumed on further developing the track. Other band members supplemented their ideas on the main piano track; they added a bass figure and drums. The last song included in the album, Coldplay recorded the song very fast. By the time Martin recorded his vocals, a few people inside the studio felt the song &quot;is something special&quot;. According to Martin, &quot;Clocks&quot; was inspired by the English rock band Muse.\n __________________________________________\n MUSIC\n __________________________________________\n &quot;Clocks&quot; is a piano rock song. Its musicscape is built around a repeating piano riff, and features a minimalist soundscape of drums and bass. It also includes synthesizers and a sparse string arrangement.\n \n The song's lyrical themes include contrast, contradictions and urgency. Chris Martin sings of being in the state of &quot;helplessness ... in a dysfunctional relationship he doesn't necessarily want to escape&quot;. The lyrics are cryptic; the ending lines of the second verse emphasize contradiction of emotion: &quot;Come out upon my seas/Cursed missed opportunities/Am I a part of the cure/Or am I part of the disease?&quot;.The song's title also &quot;metaphorically alludes&quot; to its lyrics, &quot;pushing one to wonder about the world’s obsession with time while connecting it to the theory: make the best of it when we’re here, present and alive&quot;.\n \n This won the Grammy for 2003 Record Of The Year. In accepting the award, lead singer Chris Martin dedicated it to the late Johnny Cash and to US presidential candidate John Kerry, &quot;Who hopefully will be your president someday.&quot;\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Clocks&quot; emerged in conception during the late stages into the production of Coldplay's second album, A Rush of Blood to the Head. The band's vocalist, Chris Martin, came in studio late one night. A riff popped  up in Martin's mind and wrote it on the  piano. Martin presented the riff to the band's guitarist, Jonny Buckland, who then added guitar chords on the basic track.  During the writing of &quot;Clocks&quot;, the band had already made 10 songs for the album.", "published": "Mon, 29 Dec 2008 18:59:12 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Clocks", "artist": {"url": "http://www.last.fm/music/Coldplay", "mbid": "cc197bad-dc9c-440d-a5b5-d52ba2e14234", "name": "Coldplay"}, "url": "http://www.last.fm/music/Coldplay/_/Clocks", "listeners": "1429769", "comments": ["naysayers! go play with your pacifier.", "Do inferno ao céu com essa música.", "Best song ever written. [2]", "Terrible Remix gets skipped", "Best song ever written.", "chill rock!", "Music of the sea", "Like the song, but not with the totally unnecessary trance drums added to it... yuck.", "The chill type of music tonight called for :)", "Just what this song needed, a fucking trance remix.", "<3", "Beautiful.", "wow this is an awesome song!", "Great song", "I love this song.", "10 years of clocks and still a tune a decade later :)", "unless you've seen this live with the green laser lights you'll never quite fully understand how beautiful this song is", "^_^", "I like to dance with this song when i go to beach....", "Sounds like Orbital, if Orbital did power ballads. Still, I'm not sure if that's a bad thing. The lyrics are meaningless, vaguely spiritual babble, but the piano line is so pretty that I'm not sure that I mind."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/coldplay", "name": "coldplay"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/britpop", "name": "britpop"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}]}, "mbid": "bbf6b876-abc4-4730-9fc9-cbd1027e3f9e", "duration": "251000", "playcount": "10113889", "id": "1006121"}}