{"track": {"album": {"@attr": {"position": "7"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Bruce+Springsteen/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91266097.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91266097.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91266097.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91266097.png", "size": "extralarge"}], "artist": "Bruce Springsteen", "mbid": "ce73ebd3-5ae0-35a0-93e8-187bcc7fa47a"}, "wiki": {"content": "&quot;Dancing in the Dark&quot; is a 1984 song, written and performed by American rock singer Bruce Springsteen. According to the <a href=\"http://www.songfacts.com/detail.php?id=962\" rel=\"nofollow\">Dancing in the Dark Songfacts</a>, Springsteen wrote this after his manager, Jon Landau, demanded a hit single from the album. After a brief altercation, he complied and wrote this that same night. Adding up-tempo synthesizer riffs and some syncopation to his sound for the first time, it became his biggest hit and, as the first single released from Born in the U.S.A., started it off to becoming the best-selling album of Springsteen's career.\n \n &quot;Dancing in the Dark&quot; was the last song written and recorded for Born in the U.S.A. Springsteen's producer and manager Jon Landau liked the album but wanted a sure-fire first single, one that was fresh and directly relevant to Springsteen's current state of mind (as much of Born in the U.S.A. had been written two years earlier). Landau and Springsteen got into an argument, but later on Springsteen wrote &quot;Dancing in the Dark&quot;, and his irked mood from the day's argument combined with the frustrations at trying to complete the album quickly poured out into the lyrics.\n \n Released as a single prior to the album's release, the song spent four weeks at #2 on the U.S. Billboard Hot 100 chart (his highest charting song to date) in June–July 1984 (it was kept off the #1 spot by Duran Duran's &quot;The Reflex&quot; and that year's song of the summer, Prince's &quot;When Doves Cry&quot;). It did reach #1 on the Cash Box Top 100 Singles chart. It was also the first of a record-tying seven top 10 hit singles to be released from Born in the U.S.A. &quot;Dancing in the Dark&quot; also held the #1 spot for six weeks on Billboard's Top Tracks chart.\n \n Although the song only peaked at #5 in Australia, it remained on the charts for most of 1984 and was that country's highest selling single of the year. It spent a total of 64 weeks in the Top 100.[citation needed]\n \n In the UK, &quot;Dancing in the Dark&quot; originally reached number 28 in the UK Singles Chart when released in May 1984. However, the song was re-released in January 1985 and subsequently reached number 4 in the charts, becoming the 27th best-selling single of the year.\n \n The recording also won Springsteen his first Grammy Award, picking up the prize for Best Rock Vocal Performance in 1985. It also won the MTV Video Music Award for Best Stage Performance. In the 1985 Rolling Stone readers poll, &quot;Dancing in the Dark&quot; was voted &quot;Song of the Year&quot;. The track has since gone on to earn further recognition and is as such listed one of The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll.\n \n The Brian DePalma-directed video, set at a live performance, is perhaps best remembered for the appearance of Courteney Cox as a fan who is invited on stage by Springsteen, and dances with him. Cox was subsequently cast in Misfits of Science and Family Ties, and would later go on to be one of the stars of NBC's hit sit-com Friends. Although Cox had previously appeared in television commercials and had other roles, it is thought that her part in the video played a large role in launching her career.\n \n The video was filmed in June 1984 at the St. Paul Civic Center in St. Paul, Minnesota, before and during the initial show of the Born in the U.S.A. Tour. The completed video was first aired on MTV on July 10, 1984. It received heavy airplay on MTV, and thus helped introduce Springsteen's music to a new, younger, and wider audience.\n \n In a first for Springsteen in an effort to gain dance and club play for his music, and more non-whites in his audience, remix maestro Arthur Baker created the 12-inch &quot;Blaster Mix&quot; of &quot;Dancing in the Dark&quot;, wherein he completely reworked the album version. Overdubbed were tom-toms, dulcimers, glockenspiel, assorted backing vocals, bass and horn sythesizer parts, and gunshot sounds. Springsteen's vocal part was chopped up, double-tracked, echoed and repeated, with certain lines such as &quot;You sit around getting older&quot; and &quot;Heeey, baby!&quot; made even more prominent. The remix was released on July 2, 1984.\n \n The result generated a lot of media buzz for Springsteen, as well as actual club play; the remix went to #7 on the Billboard Hot Dance Music/Club Play chart, and had the most sales of any 12-inch single in the United States in 1984. However, many of Springsteen's hard-core rock fans, who had been suspicious of the new sound of &quot;Dancing in the Dark&quot; to begin with, despised the remix. Baker was subsequently quoted in angry response: &quot;I got really offended. What is so different? It has a fucking glockenspiel, which Bruce has used before, background vocals ... it's no different. See, if any of those mixes had come out before, with no one knowing the other version, no one would have said a word.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Dancing in the Dark&quot; is a 1984 song, written and performed by American rock singer Bruce Springsteen. According to the <a href=\"http://www.songfacts.com/detail.php?id=962\" rel=\"nofollow\">Dancing in the Dark Songfacts</a>, Springsteen wrote this after his manager, Jon Landau, demanded a hit single from the album. After a brief altercation, he complied and wrote this that same night. Adding up-tempo synthesizer riffs and some syncopation to his sound for the first time, it became his biggest hit and, as the first single released from Born in the U.S.A., started it off to becoming the best-selling album of Springsteen's career. ", "published": "Wed, 30 May 2012 14:30:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Dancing in the Dark", "artist": {"url": "http://www.last.fm/music/Bruce+Springsteen", "mbid": "70248960-cb53-4ea4-943a-edb18f7d336f", "name": "Bruce Springsteen"}, "url": "http://www.last.fm/music/Bruce+Springsteen/_/Dancing+in+the+Dark", "listeners": "390739", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/bruce%20springsteen", "name": "bruce springsteen"}, {"url": "http://www.last.fm/tag/singer-songwriter", "name": "singer-songwriter"}]}, "mbid": "be5bcdae-351a-4811-8a9c-6cf337b247cc", "duration": "241000", "playcount": "1892095", "id": "1005787"}}