{"track": {"album": {"@attr": {"position": "4"}, "title": "The Wall (disc 1)", "url": "http://www.last.fm/music/Pink+Floyd/The+Wall+(disc+1)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78432364.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78432364.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78432364.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78432364.png", "size": "extralarge"}], "artist": "Pink Floyd", "mbid": ""}, "wiki": {"content": "The Happiest Days of Our Lives is a song by the British progressive rock band Pink Floyd. It was released on The Wall album in 1979.\n \n The song is approximately 1 minute, 52 seconds in length, beginning with 24 seconds of a helicopter approaching followed by shouting from the schoolmaster. When Kate Bush tried to add a similar helicopter to the fadeout of her single &quot;Experiment IV&quot;, her recording engineers were unable to duplicate the overwhelming sound, so she asked Roger Waters for the original tape, and he obliged as long as it was mentioned in the credits. After that the sound effects abruptly cut out for the lyrical portion. Throughout the most of the song, the lead instrument is the bass guitar with an added delay effect and during the bridge to &quot;Another Brick in the Wall, Part II&quot;, there are intense drums and backing vocals. Due to the smooth transition from this song to Another Brick In The Wall Pt. II, many people think this song is part of Another Brick.\n \n On the album, &quot;The Happiest Days of Our Lives&quot; segues into &quot;Another Brick in the Wall, Part II&quot; with a loud, high-pitched scream by Roger Waters (this sound is later reprised on Run Like Hell). Because of this segue, many radio stations play one right after the other.\n \n In the film based on the album, the sound at the beginning of the song is depicted as coming from a train entering a large tunnel, rather than a helicopter heard on the album. According to Gerald Scarfe, there was supposed to be a puppet of the teacher at the end of the tunnel in the film. Alan Parker made shots of it, but it didn't work out, so they used Alex McAvoy, who played the teacher, to do the scene instead. Before the cut in the middle for the Schoolmaster to mock Pink, somewhat quiet hysterical laughter is heard, extremely similar to the Schoolmaster's voice.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The Happiest Days of Our Lives is a song by the British progressive rock band Pink Floyd. It was released on The Wall album in 1979.  The song is approximately 1 minute, 52 seconds in length, beginning with 24 seconds of a helicopter approaching followed by shouting from the schoolmaster. When Kate Bush tried to add a similar helicopter to the fadeout of her single &quot;Experiment IV&quot;, her recording engineers were unable to duplicate the overwhelming sound, so she asked Roger Waters for the original tape, and he obliged as long as it was mentioned in the credits.", "published": "Wed, 18 Mar 2009 17:37:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "The Happiest Days of Our Lives", "artist": {"url": "http://www.last.fm/music/Pink+Floyd", "mbid": "83d91898-7763-47d7-b03b-b92132375c47", "name": "Pink Floyd"}, "url": "http://www.last.fm/music/Pink+Floyd/_/The+Happiest+Days+of+Our+Lives", "listeners": "484241", "comments": ["I don't understand how people can listen to Another Brick in the Wall, part II without this song! [93]", "oh come on, it's a concept album yes, and many of the songs are linked together but there's really no need to ALWAYS listen to them together. If there were I'm sure most of you would just have 'The Wall' as a single track in your library to ensure that you never listened out of order and out of context. But that would be stupid since the vast majority of the songs on the album will work out of the album and separately.", "I don't understand how people can listen to Another Brick in the Wall, part II without this song! [92]", "I don't understand how people can listen to Another Brick in the Wall, part II without this song! [90]", "YOU!", "Listen to Wish You Were Here on Spotify to unlock Pink Floyd's entire catalogue! One million plays required to unlock Pink Floyd's entire catalogue!", "One must issue a law prohibiting the listen of separate tracks from The Wall, so that we could only access all tracks one by one without interruption.", "this song shouldnt really be seperated from the wall part 1 n 2, come at me.", "Perfect!", "Я не понимаю, как люди могут слушать Еще один кирпич в стене, часть II без этой песни! [90]", "I don't understand how people can listen to Another Brick in the Wall, part II without this song! [89]", "In reply to the_arcanus. The general population does not grasp the meaning of what a concept album. The concept has to be considered as a whole, not just one song.", "আমাদের লাইভস অফ হ্যাপিয়েস্ট দিন", "I don't understand how people can listen to Another Brick in the Wall, part II without this song! [88] \r\nI don't understand how people can listen to any song from \"The Wall\" separated from the album [3]", "YOU, YES YOU, IM STILL WATCHIN!", "very good", "I don't understand how people can listen to any song from \"The Wall\" separated from the album [2]", "I don't understand how people can listen to any song from \"The Wall\" separated from the album.", "I don't understand how people can listen to Another Brick in the Wall, part II without this song! [87]", "\" Another Brick in the Wall, part II is just rubbish. \" - quote by an idiot"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/progressive%20rock", "name": "progressive rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/psychedelic%20rock", "name": "psychedelic rock"}, {"url": "http://www.last.fm/tag/pink%20floyd", "name": "pink floyd"}]}, "mbid": "c9764f29-a308-4580-9cfa-cb16cf2c7a94", "duration": "111000", "playcount": "2896203", "id": "1006458"}}