{"track": {"album": {"@attr": {"position": "15"}, "title": "Electric Ladyland", "url": "http://www.last.fm/music/Jimi+Hendrix/Electric+Ladyland", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69943766.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69943766.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69943766.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69943766.png", "size": "extralarge"}], "artist": "Jimi Hendrix", "mbid": ""}, "wiki": {"content": "This track is a cover of the Bob Dylan song &quot;All Along The Watchtower&quot;. However many do not realise this due to the popularity of Hendrix's version.\n \n The Jimi Hendrix Experience began to record their cover version of Dylan's &quot;All Along The Watchtower&quot; on January 21, 1968, at Olympic Studios in London. According to engineer Andy Johns, Jimi Hendrix had been given a tape of Dylan’s recording by publicist Michael Goldstein, who worked for Dylan’s manager Albert Grossman. &quot;(Hendrix) came in with these Dylan tapes and we all heard them for the first time in the studio”, recalled Johns.  According to Hendrix’s regular engineer Eddie Kramer, the guitarist cut a large number of takes on the first day, shouting chord changes at Dave Mason who had appeared at the session and played guitar. Halfway through the session, bass player Noel Redding became dissatisfied with the proceedings and left. Mason then took over on bass. According to Kramer, the final bass part was played by Hendrix himself.[10] Kramer and Chas Chandler mixed the first version of &quot;All Along The Watchtower&quot; on January 26th, but Hendrix was quickly dissatisfied with the result and went on re-recording and overdubbing guitar parts during June, July, and August at the Record Plant studio in New York. Engineer Tony Bongiovi has described Hendrix becoming increasingly dissatisfied as the song progressed, overdubbing more and more guitar parts, moving the master tape from a four-track to a twelve-track to a sixteen-track machine. Bongiovi recalled, &quot;Recording these new ideas meant he would have to erase something. In the weeks prior to the mixing, we had already recorded a number of overdubs, wiping track after track. [Hendrix] kept saying, ‘I think I hear it a little bit differently.’” The finished version was released on the album Electric Ladyland in September 1968. The single reached number five in the British charts, and number 20 on the Billboard (magazine) chart. The song also had the #5 spot on Guitar World's 100 Greatest Guitar Solos.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "This track is a cover of the Bob Dylan song &quot;All Along The Watchtower&quot;. However many do not realise this due to the popularity of Hendrix's version.  The Jimi Hendrix Experience began to record their cover version of Dylan's &quot;All Along The Watchtower&quot; on January 21, 1968, at Olympic Studios in London. According to engineer Andy Johns, Jimi Hendrix had been given a tape of Dylan’s recording by publicist Michael Goldstein, who worked for Dylan’s manager Albert Grossman. &quot;(Hendrix) came in with these Dylan tapes and we all heard them for the first time in the studio”, recalled Johns.", "published": "Mon, 8 Jun 2009 05:22:37 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "All Along the Watchtower", "artist": {"url": "http://www.last.fm/music/Jimi+Hendrix", "mbid": "06fb1c8b-566e-4cb2-985b-b467c90781d4", "name": "Jimi Hendrix"}, "url": "http://www.last.fm/music/Jimi+Hendrix/_/All+Along+the+Watchtower", "listeners": "684072", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/psychedelic", "name": "psychedelic"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}]}, "mbid": "cb780c9d-c2c1-4439-b077-6c6f64564b94", "duration": "241000", "playcount": "3802507", "id": "11067"}}