{"track": {"album": {"@attr": {"position": "13"}, "title": "Stadium Arcadium", "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/Stadium+Arcadium", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/66662762.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/66662762.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/66662762.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/66662762.png", "size": "extralarge"}], "artist": "Red Hot Chili Peppers", "mbid": "3d2e2240-17b8-30f0-999e-63c630d1db30"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Wet Sand", "artist": {"url": "http://www.last.fm/music/Red+Hot+Chili+Peppers", "mbid": "8bfac288-ccc5-448d-9573-c33ea2aa5c30", "name": "Red Hot Chili Peppers"}, "url": "http://www.last.fm/music/Red+Hot+Chili+Peppers/_/Wet+Sand", "listeners": "391448", "comments": ["\"the travesties that we have seen are treating me like benzedrine / automatic laughter from a pro\" -- lines like this are why i have the utmost respect for kiedis as a poet. everything about this song is good. genius structure, lyrics, and sound from start to finish. this song is darkly romantic, spiritual, and (not to sound cliche) soul-searching. it's so simple and complex; as blatant as mainlining and still as subtle and implicit as a prayer. my favorite rhcp track ever.", "the solo shows how great Frusciante is, not cause he's the fastest - cause he knows what to play when... [2]", "Best song of Stadium Arcadium according me [3] I'd put it up in their top five best songs", "In my sight this is one of the best songs ever written. This bass is turning me on and the bridge part is legendary, the solo shows how great Frusciante is, not cause he's the fastest - cause he knows what to play when...", "♥___♥", "great grooving !!!!!!!!!!", "I just noticed the remarkable resemblance between the ending of this song compared to the ending of Bold as Love by Jimi Hendrix. That's why it sounds so great!", "What  a song. Certainly my absolute RHCP favourite.", "John is the best.", "Eu estou apostando que quando nós colidirmos o Universo irá mudar-se para dentro do abismo. ♥", "thaaat solo *___*", "This song gives me goosebumbs whenever I hear it!", "Startin chords are equal to Beatles' I wanna hold your hand. Anyway, this song is genious too!", "I've always thought that John put his personal story in this solo: it's like he was able to turn his life events and experiences into notes... So beautiful and sad at the same time, I can't describe how many feelings it gives me.", "That's so sad, but I have to say it again. Well fuck you, Red Hot Chili Peppers, it's the most fucking beautiful song ever written, and it makes me wanna fucking die at the same time. Again. [2]", "Meu remédio pra dor de cabeça. Basta ouvir e logo passa...", "•*¨*•.¸¸❤¸¸.•*¨*", "one of the best", "♥", "This is one of those mild jimmy songs"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/red%20hot%20chili%20peppers", "name": "red hot chili peppers"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}]}, "mbid": "cc7e77ef-fd6e-462c-98b7-957a156cc146", "duration": "309000", "playcount": "2240439", "id": "43380110"}}