{"track": {"album": {"@attr": {"position": "1"}, "title": "Black Holes and Revelations", "url": "http://www.last.fm/music/Muse/Black+Holes+and+Revelations", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88400305.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88400305.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88400305.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88400305.png", "size": "extralarge"}], "artist": "Muse", "mbid": "de6dc138-8b53-4b35-8c96-c10c0871923b"}, "wiki": {"content": "Take a Bow calls on world leaders to take responsibility for their actions. Muse move through three musical stages: starting off as a classical piece before moving into a techno mid-section and a heavy &quot;apocalyptic rock&quot; ending. Initially described &quot;a looping epic which morphs into a gothic fairytale&quot;.  The chord structure moves in fourths upwards, by using the augmented fifth in between to move.\n \n Initially called &quot;Hex&quot;, &quot;Take a Bow&quot; was originally going to be at the end of the album. Two months later, Chris indicated it could become the opening track. Put first on the album because it ends in the key of B which is the key of the second track. .\n \n Wolstenholme: We wrote it at the end of the Absolution sessions, and it sounds similar [to Absolution tracks]. It has evolved a lot since then, but it’s principle remains the same: a change of periodic agreements which are at the brink of exploding. Its structure is mathematical, the main idea being a formula with neither chorus nor verse. Dom’s never played like that, with very jazzy rhythms, slow ones, followed by more chaotic bits integrated into the whole.\n \n Take a Bow was often played as a piano interlude between Citizen Erased and Space Dementia on the Absolution tour. It was also used in a cinematic trailer for the film <em>Watchmen</em>.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Take a Bow calls on world leaders to take responsibility for their actions. Muse move through three musical stages: starting off as a classical piece before moving into a techno mid-section and a heavy &quot;apocalyptic rock&quot; ending. Initially described &quot;a looping epic which morphs into a gothic fairytale&quot;.  The chord structure moves in fourths upwards, by using the augmented fifth in between to move.  ", "published": "Fri, 9 Oct 2009 04:58:48 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Take a Bow", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Take+a+Bow", "listeners": "627515", "comments": ["That build-up, THAT FUCKING BUILD-UP [9]", "@hello1994 - ''Am I the only one here who hear Pink Floyd in this song?'' \r\nPersonally I hear Queen and the Flash Gordon soundtrack more than Pink Floyd I'm afraid", "sounds like curved air the start of song.", "That build-up, THAT FUCKING BUILD-UP [8]", "You will burn in hell for your sins...", "This song is on God's iPod [4]", "chills everytime.", "This song is on God's iPod [3]", "I love this song is political as hell in an era where protest songs were stifled. Plus you can headbang to it.", "Great lyrics.", "@hello1994 - ''Am I the only one here who hear Pink Floyd in this song?'' - yes you are, although many people will no doubt start to post shit saying that muse is much like pink floyd, but as a true music and pink floyd fan I say in short - NOTHING EVEN REMOTELY SIMILAR. to compare floyd to muse is a travesty. muse suck big time", "This song gives me chills. From the intro to the amazing climax. Every. Fucking. Time.", "This song is on God's iPod [2]", "BURN IN HELL, YOU WILL BURN IN HELL, FOR YOUR SIIIIIIIIIIINS. CLASSIC.", "That build-up, THAT FUCKING BUILD-UP <3! [6]", "medonho", "This song made the Watchmen trailer 10x cooler. [2]", "Am I the only one here who hear  Pink Floyd in this song?", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK ”", "The awesomeness of this music is above my level of comprehension."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/progressive%20rock", "name": "progressive rock"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}]}, "mbid": "cccc851d-9214-4d24-9df6-e45f62664dbc", "duration": "275000", "playcount": "4478659", "id": "52644909"}}