{"track": {"album": {"@attr": {"position": "7"}, "title": "Back in Black", "url": "http://www.last.fm/music/AC%2FDC/Back+in+Black", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/81981459.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/81981459.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/81981459.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/81981459.jpg", "size": "extralarge"}], "artist": "AC/DC", "mbid": "fa659e31-96b9-4540-af58-437dd786f693"}, "wiki": {"content": "&quot;You Shook Me All Night Long&quot; is one of AC/DC's signature songs from their most successful album, Back in Black. The song also reappeared on their later album Who Made Who. It is one of the band's top 40 singles, reaching number 35 on the Billboard Hot 100 pop singles chart in 1980. The single was re-released internationally in 1986 following the release of the album Who Made Who.\n \n &quot;You Shook Me All Night Long&quot; placed at No. 10 on VH1's list of &quot;The 100 Greatest Songs of the 80s&quot;. It was also No. 1 on VH1's &quot;Top Ten AC/DC Songs&quot;. In the song, the lead singer Brian Johnson relates the story of a night with a beautiful woman. Guitar World placed &quot;You Shook Me All Night Long&quot; number 80 on their &quot;100 Greatest Guitar Solos&quot; list.\n \n The re-released single in 1986 contains the B-side(s): B1. &quot;She's Got Balls&quot; (Live, Bondi Lifesave '77); B2. &quot;You Shook Me All Night Long&quot; (Live '83 - 12&quot; maxi-single only).\n \n The song has also become a staple of AC/DC concerts, almost never being excluded from the setlist,[1] and it has also been considered their signature song, competing with &quot;Back in Black &quot; and &quot;Highway to Hell&quot; for the title.\n \n There are at least two live versions of this song that have been officially released. One of them is on the band's album Live, the other is on the soundtrack to the Howard Stern movie Private Parts.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;You Shook Me All Night Long&quot; is one of AC/DC's signature songs from their most successful album, Back in Black. The song also reappeared on their later album Who Made Who. It is one of the band's top 40 singles, reaching number 35 on the Billboard Hot 100 pop singles chart in 1980. The single was re-released internationally in 1986 following the release of the album Who Made Who.  &quot;You Shook Me All Night Long&quot; placed at No. 10 on VH1's list of &quot;The 100 Greatest Songs of the 80s&quot;.", "published": "Tue, 21 Apr 2009 12:09:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "You Shook Me All Night Long", "artist": {"url": "http://www.last.fm/music/AC%2FDC", "mbid": "66c662b6-6e2f-4930-8610-912e24c63ed1", "name": "AC/DC"}, "url": "http://www.last.fm/music/AC%2FDC/_/You+Shook+Me+All+Night+Long", "listeners": "639384", "comments": ["You shook me all night long i really like this band what a classic song thou :)", "I always think it's funny that I used to listen to this son all the time when I was younger and didn't get how sexual it was when I was that young. It's just a great song, simply put.", "live", "And last.fm gives me a live version...of course", "I've got to shake it everytime this plays;) Love it♥♥", "Crank it up !", "one of my favorite AC/DC songs with brian johnson", "Celine Dion music.", "Well, Brian wasted his best line here. He never really surpassed \"She told me to come, but I was already there\".", "My favorite AC/DC song", "All night loooooong !!!", "Nice!", "better version :) thanx lastfm !!!", "arrrrrrrrrrrrrrrrrrrrrggghhhh", "there is nothing like AC/DC live concerts, please come back soon", "What a sucky version - not my fav", "Dance music for drunk girls at weddings, yea buddy!", "Rock Gods", "Such a classic", "Yeah you, shook me all night long."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/acdc", "name": "acdc"}]}, "mbid": "", "duration": "210000", "playcount": "4673556", "id": "1054897"}}