{"track": {"album": {"@attr": {"position": "4"}, "title": "Black Holes and Revelations", "url": "http://www.last.fm/music/Muse/Black+Holes+and+Revelations", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88400305.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88400305.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88400305.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88400305.png", "size": "extralarge"}], "artist": "Muse", "mbid": "de6dc138-8b53-4b35-8c96-c10c0871923b"}, "wiki": {"content": "&quot;Map of the Problematique&quot; is a song by English alternative rock band Muse, released on their 2006 fourth studio album, Black Holes and Revelations. It was released as the fifth single from the album on 18 June 2007 as a digital download only. The release date followed the two concerts Muse performed at Wembley Stadium on June 16 and June 17. The song has been closely compared to &quot;Enjoy the Silence&quot; by Depeche Mode due to its similar chord progression and arrangement. Muse frontman Matthew Bellamy has also cited Depeche Mode as inspiration for the song in interviews.\n \n The title is a reference to a book called The Limits to Growth (1972) and the Club of Rome think-tank who would create a &quot;map of the problematique&quot; detailing the &quot;global problematique&quot; - a set of likely challenges the world might face in the near future. The Limits to Growth correctly predicted the economic crisis of 2008. In addition, the opening lyric, &quot;fear and panic in the air&quot; may be a reference to Mars, in that the red planet's two moons are named Phobos and Deimos, who were the Greek gods of Fear and Panic. Such a connection would fit in with numerous references to Mars in the album. It bears similarity with the music of Depeche Mode, especially Enjoy the Silence, and is a rare track in musical terms as it does not use the dominant chord ever in the riff: C minor, E flat major, A flat major, F minor.\n \n &quot;Map of the Problematique&quot; was used in trailers for Children of Men (2006). Also used in the commercial for Prison Break. A short clip of the song was also used during the BBC's coverage of Rugby Sevens World Series.\n \n &quot;Map of the Problematique&quot; originated from rehearsals before the recording of Black Holes and Revelations, and was one of the later songs the band started work on. It was originally played on synthesisers before being transferred to guitar, giving it a much darker sound, although initially the intention was to keep it as keyboard-orientated as possible. The rhythm section was recorded after the guitar tracks. This was different to anything the band had done before, according to Chris Wolstenholme, &quot;because the whole theme of the song was based more on the sound and creation of this sound&quot;.\n \n In very early live performances of the song, Matt Bellamy replaced the first three lines of the second verse with the following:\n \n    See a future on the run Running away And our judgement has begun\n  \n For performances of the song during the recent The Resistance Tour, Bellamy slightly adjusted the lyrics again. Instead of the second instance of\n \n    Since I met you\n  \n Bellamy now sings\n \n    Since I lost you\n  \n This is likely due to the fact that Matt and Gaia Polloni broke up during the tour.\n \n The song reached number 18 in the UK singles chart in its first week of release, and was more successful than &quot;Invincible&quot;, the previous single.\n \n The song was used in numerous television adverts through 2006 and 2007, including British science fiction television series Primeval, TV spots for the 2006 film Children of Men, and during Live Earth. It has also been featured on Top Gear during Season 8, Episode 7 and Season 10, Episode 5 and, in the UK, samples were played on golfing events either before advertisements or when it moves on to another part of the event, and was used in numerous episodes of Masterchef. &quot;Map of the Problematique&quot; was also used as an entry song into the last episode of Doctor Who Confidential in the fourth series, entitled &quot;Journey's End&quot;. RAI International television of Italy also uses it as an introduction to the news programme Italia Chiama Italia. The song was rated at #82 in Q Magazine's 100 lost tracks of 2006 list.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Map of the Problematique&quot; is a song by English alternative rock band Muse, released on their 2006 fourth studio album, Black Holes and Revelations. It was released as the fifth single from the album on 18 June 2007 as a digital download only. The release date followed the two concerts Muse performed at Wembley Stadium on June 16 and June 17. The song has been closely compared to &quot;Enjoy the Silence&quot; by Depeche Mode due to its similar chord progression and arrangement. Muse frontman Matthew Bellamy has also cited Depeche Mode as inspiration for the song in interviews. ", "published": "Sun, 9 May 2010 05:21:07 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Map of the Problematique", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Map+of+the+Problematique", "listeners": "681732", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}]}, "mbid": "ce887034-7aaa-4681-9fa8-e7101245a376", "duration": "258000", "playcount": "6493285", "id": "54089489"}}