{"track": {"album": {"@attr": {"position": "4"}, "title": "Only by the Night", "url": "http://www.last.fm/music/Kings+of+Leon/Only+by+the+Night", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/81102241.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/81102241.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/81102241.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/81102241.png", "size": "extralarge"}], "artist": "Kings of Leon", "mbid": "b57a5aff-1300-463a-bea4-6babde050ae0"}, "wiki": {"content": "&quot;Use Somebody&quot; is the second single from Only by the Night, the fourth studio album by Kings of Leon, released on December 8, 2008.The music video was premiered exclusively on the band's MySpace page on November 4, 2008.\n \n On Sunday, December 7, 2008, Caleb from Kings of Leon said that at about the same time in 2007 when they were touring, they had a fall out, while in Glasgow before their concert on Monday, December 3, 2007. This is when he said &quot;Use Somebody&quot; was written, he credited the writing of the song to the City of Glasgow and the audience at the SECC on that night.\n \n The single received heavy airplay in Scandinavia, such as in Finland and Sweden, as well as the Republic of Ireland, UK and Australia, where it has remained at number one on the Official Airplay Chart for six consecutive weeks. It was a huge success in the U.S., where it topped multiple airplay formats, and reached #4 on the Hot 100 and the top of the Pop Songs chart.\n \n &quot;Use Somebody&quot; debuted in the UK Singles Chart at #29 via download sales alone on September 28, 2008, the same date as its parent album, just six days after the album's release and two weeks after the #1 single &quot;Sex on Fire&quot; charted. Despite falling to #50 over the next month, on November 23 the single became Kings of Leon's fifth single to enter the UK Top 20, charting at #17 and rising to #15 the following week. On December 7, 2008, the day before its physical release, it marked only the band's second UK Top 10 single, climbing to #10. The following week (its first week of physical release), it looked to have continued the band's surge to success. As the follow up to Sex on Fire, it became their second UK Top 3 single, peaking at #2. It remained in the UK Top 10 for 13 non-consecutive weeks and spent an unbroken 40 weeks on the Top 75, only dropping out due to the surge in sales of Michael Jackson titles immediately after his death. However, a week later it was back, and has now spent 60 weeks on the Top 75 (just two behind Sex on Fire and making it the 6th longest runner of all time), and 62 on the Top 100. To date, the single has sold over 700,000 copies in the UK, and Kings of Leon have become the first and only act to place two singles on the chart for an entire year, and currently the only act to have 2 songs in the top ten of the UK's longest running songs of all time.\n \n In the United States, &quot;Use Somebody&quot; has become a huge hit, and the band's mainstream breakthrough. It has peaked at #4 on the Hot 100, giving the band their first top five hit there. On U.S. radio, the song was a multi-format smash, becoming just the fourth song in history to top the Mainstream Top 40, Adult Top 40, Alternative Songs, and Triple A charts. The three prior being &quot;Slide&quot; by the Goo Goo Dolls, &quot;Every Morning&quot; by Sugar Ray, and &quot;Boulevard of Broken Dreams&quot; by Green day. The song first reached #1 on the Billboard Hot Modern Rock Tracks chart (now called the &quot;Alternative&quot; chart), their second of three consecutive singles to top that chart. &quot;Use Somebody&quot; also reached #1 on the Adult Top 40 Chart, and later topped the Mainstream Top 40 as well. &quot;Use Somebody&quot; has also found great digital success, so far selling over 2,512,122 digital downloads in the United States.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=12986\" rel=\"nofollow\">Use Somebody Songfacts</a>, Caleb Followill Caleb wrote this song as an apology to his bandmates after a drunken fight. He came up with the tune by speeding up  <a href=\"http://www.last.fm/music/Joe+Cocker\" class=\"bbcode_artist\">Joe Cocker</a> and  <a href=\"http://www.last.fm/music/Jennifer+Warne\" class=\"bbcode_artist\">Jennifer Warne</a> 's Oscar-winning theme song to 1983 movie <em>An Officer and a Gentleman</em>  during a soundcheck in Scotland.\n \n The song has received generally positive reviews from music critics. Mikael Wood of Entertainment Weekly called &quot;Use Somebody&quot; a highlight of the album, describing the song as &quot;a too-cool hipster's cry for comfort.&quot; Nick Levine of Digital Spy said &quot;with its Springsteen-style 'oooah-woooah's, gathering storm of guitars and lusty, longing vocals from Caleb Followill, it's nearly as infectious as 'Sex on Fire.'&quot; Gavin Haynes of NME praised the song as &quot;easily the best 80s power ballad of 2008,&quot; but cautioned that the band &quot;may be in danger of mistaking bluster for brilliance.&quot;\n \n Cover versions:\n Margaret Durante released a version of this song to country radio as a single.\n \n American band Paramore and British musician Bat For Lashes have both covered the song on BBC Radio 1's Live Lounge.\n \n On their Dark Horse Tour, Nickelback performed a cover of the song live, and guitarist Ryan Peake sang lead vocals instead of Chad Kroeger.\n \n Pixie Lott, VV Brown and Friendly Fires have performed cover versions of the song, of which Pixie Lott's version peaked at number 52 in the UK Singles Chart, due to it being a B-side to her number 1 single &quot;Mama Do (Uh Oh Uh Oh)&quot;\n \n Tiki Taane formerly of Salmonella Dub performed a live acoustic version on Triple J's morning show, for their weekly segment 'like a version'.\n Brazilian band NX Zero covered the song on the TV show The Edgard Show on Multishow.\n \n Former American Idol contestant, Brooke White, covered the song for her sophomore album, High Hopes &amp; Heartbreak with a more folk sound.\n \n \n In their UK tour with fellow Clubland artist Darren Styles, Liverpudlian dance troupe Ultrabeat recorded a version of the song, which is rumoured to appear on their second album\n \n Kelly Clarkson covered the song, mashing it with an Alanis Morissette song 'That I Would Be Good' on her 2009 tour.\n \n A hip-hop version was crafted, featuring Houston rapper Trae.\n \n Laura Jansen covered the song on her album &quot;Bells.&quot;\n \n Steve Appleton covers a version of this song.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Use Somebody&quot; is the second single from Only by the Night, the fourth studio album by Kings of Leon, released on December 8, 2008.The music video was premiered exclusively on the band's MySpace page on November 4, 2008.  On Sunday, December 7, 2008, Caleb from Kings of Leon said that at about the same time in 2007 when they were touring, they had a fall out, while in Glasgow before their concert on Monday, December 3, 2007. This is when he said &quot;Use Somebody&quot; was written, he credited the writing of the song to the City of Glasgow and the audience at the SECC on that night. ", "published": "Sat, 12 Feb 2011 16:47:34 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Use Somebody", "artist": {"url": "http://www.last.fm/music/Kings+of+Leon", "mbid": "6ffb8ea9-2370-44d8-b678-e9237bbd347b", "name": "Kings of Leon"}, "url": "http://www.last.fm/music/Kings+of+Leon/_/Use+Somebody", "listeners": "1119049", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}, {"url": "http://www.last.fm/tag/southern%20rock", "name": "southern rock"}]}, "mbid": "", "duration": "231000", "playcount": "9956151", "id": "215185958"}}