{"track": {"album": {"@attr": {"position": "2"}, "title": "Hullabaloo (Disc 2)", "url": "http://www.last.fm/music/Muse/Hullabaloo+(Disc+2)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/33872571.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/33872571.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/33872571.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/33872571.png", "size": "extralarge"}], "artist": "Muse", "mbid": ""}, "wiki": {"content": "Matt Bellamy has said the song was inspired by a dream he had in which he was in desert and there were giant blades swinging from the sky.\n \n The first time Micro Cuts was played live, it featured different lyrics in place of &quot;Micro waves me insane, A blade cuts in your brain&quot; and the chorus. Early live versions featured an extended outro that featured parts of the song Execution Commentary, as well as extra lyrics.\n \n The descending vocals towards the end of the song have been played intermittently through time. During early 2001 it wasn't sung at all, and post 2002 it wasn't usually sung, although one example of the descending vocals post-2002 was at The Mercy Lounge in 2004. In the latter half of the 2005 tour, the post-final-chorus section was used as an outro to Stockholm Syndrome on at least two occasions.\n \n Micro Cuts made a return to set lists during the 2007 European tour. The first performance of 2007 featured a largely clean guitar (without effects), while further performances feature a &quot;new effect&quot;, which mimics the layering on the album recording. The descending vocals have not returned, while vocals have been clean so far. After the final chorus and before the final decent, Bellamy has used the chaos pad to create a sound similar to the Kaoss pad solo and outro used with live Supermassive Black Hole performances. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Matt Bellamy has said the song was inspired by a dream he had in which he was in desert and there were giant blades swinging from the sky.  The first time Micro Cuts was played live, it featured different lyrics in place of &quot;Micro waves me insane, A blade cuts in your brain&quot; and the chorus. Early live versions featured an extended outro that featured parts of the song Execution Commentary, as well as extra lyrics.  ", "published": "Mon, 22 Dec 2008 16:06:43 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Micro Cuts", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Micro+Cuts", "listeners": "448148", "comments": ["I would like to sing this song when I will be very drunk, it would be awful :D", "hilarious", "For me, Muse peaked at this moment on Origin of Symmetry - Citizen Erased followed by Micro Cuts. Immense. [3]", "haarp version is not the best! check out montreux jazz festival 2002 EPICNESS!", "i love this", "The best Muse song of them all (and that's saying a lot).", "Hullaballoo version > every other single version ever in the history of humankind", "If they ever make an album or song as original as this again, I'll eat my right arm.", "For me, Muse peaked at this moment on Origin of Symmetry - Citizen Erased followed by Micro Cuts. Immense. [2]", "Needs more falsetto. [2]", "Needs more falsetto.", "You’ve scrobbled this track 45 times. You first scrobbled it on 5 Nov 2010.\n You love this track. - not bad", "THIS!!!!!!!", "Mindblowing outro. RATM-ish.", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS.ITS SO FREAKY BUT IT WILL ACTUALLY WORK", "why can't they still make songs like this??", "For me, Muse peaked at this moment on Origin of Symmetry - Citizen Erased followed by Micro Cuts. Immense.", "Bass riff at the end is so good.\nI love this song", "Nah, Montreux Jazz Festival's the best. HAARP is up there though.", "HAARP version is the best, no doubt. [2]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "d021a4f4-62f7-4727-95aa-deab1169181e", "duration": "218000", "playcount": "3135473", "id": "1005168"}}