{"track": {"album": {"@attr": {"position": "1"}, "title": "A Beautiful Lie", "url": "http://www.last.fm/music/30+Seconds+to+Mars/A+Beautiful+Lie", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/34788339.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/34788339.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/34788339.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/34788339.png", "size": "extralarge"}], "artist": "30 Seconds to Mars", "mbid": "105b9bf5-015b-44ff-9a9c-d743f3d08206"}, "wiki": {"content": "&quot;Attack&quot; is a song by 30 Seconds to Mars. The song is released as the band's first single from their second album, A Beautiful Lie.\n \n The single &quot;Attack&quot; was at first not supposed to be on the record, but after Jared played it acoustically to the producer as a joke, the producer said it was their strongest song and it had to be their first single from their second album.\n \n The song was released as a purchasable download for the music video game series Rock Band on Christmas 2007.\n \n A live version of the song has been made available for download on iTunes.\n \n The video for the song was filmed in an abandoned hotel in Hollywood where the crew encountered prostitutes and drug addicts squatting prior to filming. The video found minor success on Fuse, mtvU, and MTV2. The video is purportedly the first to contain a person having surgery live. In the video Jared Leto is the main bandmember shown. In fact, aside from brief silhouettes, the other band members are not shown at all. Despite the personal note to the lyrics of &quot;Attack&quot;, the video takes on a sexual air.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Attack&quot; is a song by 30 Seconds to Mars. The song is released as the band's first single from their second album, A Beautiful Lie.  The single &quot;Attack&quot; was at first not supposed to be on the record, but after Jared played it acoustically to the producer as a joke, the producer said it was their strongest song and it had to be their first single from their second album.  The song was released as a purchasable download for the music video game series Rock Band on Christmas 2007.  A live version of the song has been made available for download on iTunes. ", "published": "Sat, 24 Oct 2009 15:33:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Attack", "artist": {"url": "http://www.last.fm/music/30+Seconds+to+Mars", "mbid": "b898f22d-1d89-4d19-8581-8f7bd9ddb0a6", "name": "30 Seconds to Mars"}, "url": "http://www.last.fm/music/30+Seconds+to+Mars/_/Attack", "listeners": "556726", "comments": ["Your promises, they look like lies... Your honesty, like a back that hides a knife. (:", "<3", "Love, love. ;w;", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [15]", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [14]", "pohet - okay, I'm damn sorry. I think I just listened to indie pop bullshit for too long. Oasis are so indie pop yeah yeah", "amazing son - and one of the BEST bands ever. to those who say 'worst band ever', after looking at your profiles - you listen to crap like mumford and sons, imagine dragons etc - indie pop bullshit. you guys too afraid to listen to real emotion with real energy and POWER?! - go listen to your cry babies - and leave real music up to true artist..", "Their only song I like. And yes, WORST. BAND. EVER. [2]", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [13]", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [12]", "THE BEST! ❤", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [11]", "Love this song", ":)", "MUSIC •*¨*•.¸¸❤¸¸.•*¨*•♫♪", "v(^u^)v Love the song!!♥", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [10] I love Jared so much ♥", "love it!", "A new day is coming and I am finally free ♥", "I'LL ATTACK I'LL ATTACK I'LL AA-WHOOOAAAAAAAAA <3 [9]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/30%20seconds%20to%20mars", "name": "30 seconds to mars"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/emo", "name": "emo"}]}, "mbid": "dc667ceb-dca5-4a8c-a604-9e524fcabc3e", "duration": "188000", "playcount": "4598635", "id": "16187639"}}