{"track": {"album": {"@attr": {"position": "11"}, "title": "Black Holes and Revelations", "url": "http://www.last.fm/music/Muse/Black+Holes+and+Revelations", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88400305.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88400305.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88400305.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88400305.png", "size": "extralarge"}], "artist": "Muse", "mbid": "de6dc138-8b53-4b35-8c96-c10c0871923b"}, "wiki": {"content": "&quot;Knights of Cydonia&quot; is a song by English rock band Muse and is the closing track on the British release of their 2006 album Black Holes and Revelations. The song's title comes in part from the region of Mars named Cydonia, famous for the &quot;face on mars&quot;. The radio edit version was first aired on KROQ radio on 6 June 2006, and released to other radio stations in the United States on 12 June 2006. The song was released as the third single from Black Holes &amp; Revelations in the UK on 27 November 2006, debuting at #10 in the UK Singles Chart (see 2006 in British music). It also hit the #10 spot on the Billboard Modern Rock Tracks chart in the United States, becoming their third top-ten hit on that chart. The song was described by BBC Radio 1 DJ Annie Mac on 27 October 2006 as ‘six minutes and seven seconds of pure genius’. In 2007, Eve of Summer recorded a remix. The song is also featured in the video game Guitar Hero III: Legends of Rock. It was also played on NBC during the 2008 summer olympics in Beijing right after Michael Phelps won his eighth gold medal and broke Mark Spitz's record of &quot;number of gold medals won in one Olympics&quot;.\n \n The first live performance of &quot;Knights of Cydonia&quot; took place at a BBC Radio 1 event, Radio 1's Big Weekend, held at Camperdown Park in Dundee on 2006-05-13. Also performed at this event were &quot;Supermassive Black Hole&quot; and &quot;Starlight&quot;, the first two singles from Black Holes and Revelations. Live performances of &quot;Knights of Cydonia&quot; feature Bellamy's intro falsetto much more loudly and clearly than its studio counterpart. Recent live performances have featured Bellamy playing an extra guitar part during the solo at the end of song, as well as the coda of &quot;Space Dementia&quot; played as a finale.\n \n On January 26, 2008, &quot;Knights of Cydonia&quot; was announced as the number-one song in Australia's 2007 Triple J Hottest 100. The song was also ranked #18 in the Triple J Hottest 100 of All Time, 2009. It was also ranked #53 on Rhapsody's list of the Top 100 Tracks of the Decade.\n \n In the intro is a citation of the five tone musical phrase from the film Close Encounters of the Third Kind. The song features vocals from both Bellamy's higher and lower ranges layered and both synthesised and live trumpet parts. The guitar sound in the song was inspired by the 1962 number one hit &quot;Telstar&quot; by The Tornados (George Bellamy, Matt Bellamy's father, was the band's rhythm guitarist). The song, taken in entirety, also bears a striking resemblance to George Bellamy's composition &quot;Ridin' the Wind&quot;.\n \n The song's meaning is to teach people to stand up for themselves and make their own destiny.\n \n Bellamy has stated that on the album in general he tried to create a vision of what is occurring in the song. For example, the bassline has a galloping rhythm depicting someone riding a horse.\n \n The KOC video was shot over five days: three days in Romania; one day in London; and one day in Red Rock, California; it was made available on July 11, 2006. It was filmed and edited as a thematic smörgåsbord: a spaghetti western film with post-apocalyptic influence, complete with beginning and end credits, livened with the occasional kung-fu cowboy or metal-clad maiden astride a unicorn. At the end of the video one can see Roman numerals MCMLXXXI which translates as 1981. However, in the introduction the numerals MCLMXXXI are seen,[6] which despite claims that it could equal 2081 (MMLXXXI) or 1881 (MDCCCLXXXI), is not a valid roman numeral.\n \n The video was directed by Joseph Kahn, and stars British actor Russ Bain as the protagonist (The Man With No Name), Richard Brake as the antagonist (Sheriff Baron Klaus Rottingham), and Cassandra Bell as the love interest (Princess Shane Kuriyami). Throughout the video, the actors mouth out the lyrics, such as Russ Bain ramshackled in town square mouthing ‘No one's going to take me alive’, and Cassandra Bell at the gallows ‘You and I must fight for our rights’. In both instances, the mouthed words occur after the song lyrics and complete before the song moves on to the next line. The band appears in some scenes as holograms, and there are also some scenes featuring lead singer Bellamy. Also, when it shows the population of the town Cydonia it is shown as &quot;143&quot;, a common symbol for &quot;I love you&quot;, although it is unknown whether this is just a random number, or it was put there for a reason by the director or band.\n \n A very brief scene in which Bain has sex with his love interest was edited out of the video for presentation on television. The complete, uncensored version is available for viewing at the director's website, and on YouTube. In the scene where Bain has sex, the camera crew can be intentionally seen in the mirror left of the bed.\n \n A remix of the song was released as Future Funk Squad vs. Muse - &quot;Knights Of Cydonia&quot; (Breaks Mix).\n \n There is also an unlicensed remix which was released on the Crisp Biscuit label, entitled &quot;Knights of Itchy Town&quot;.\n \n A remix by Simian Mobile Disco titled Knights of Cydonia (Simian Mobile Disco Remix) is also included on Muse's Invincible EP, released in 2007. The song, however, utilises very few elements of the original song.\n \n Oakland hip hop group Zion I released a notable remix of the song in 2008.\n \n 'Knights of Cydonia&quot; entered the UK Singles Chart the week of 2006-12-04 at #10.\n \n Prior to its entry in the Singles Chart, &quot;Knights of Cydonia&quot; had been active in the Downloads Chart, and sat at #41 the same week that the physical release debuted at #10 in the Singles Chart. Three weeks earlier, the song sat at #104 in the Downloads Chart marking a substantial jump in that time period.\n \n The song was the winner of Triple J's annual Hottest 100 countdown for 2007, and later was voted #18 in 2009's Hottest 100 of All Time countdown, where it was the second-highest ranked song from the 21st century.\n \n The song is used on the advertisements of Whale Wars on Animal Planet. \n The song was featured in the 2007 music video game, Guitar Hero III: Legends of Rock. \n Knights of Cydonia is also the first song to play on NME Radio that kicked off on 24 June 2008 as voted by the readers of the channels counterpart magazine. \n Knights of Cydonia was played during Australia's coverage of the 2008 Olympics on channel 7. \n The song was used by the WGI ensemble Rhythm X as a closer to their 2010 show &quot;Inspired&quot;. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Knights of Cydonia&quot; is a song by English rock band Muse and is the closing track on the British release of their 2006 album Black Holes and Revelations. The song's title comes in part from the region of Mars named Cydonia, famous for the &quot;face on mars&quot;. The radio edit version was first aired on KROQ radio on 6 June 2006, and released to other radio stations in the United States on 12 June 2006. The song was released as the third single from Black Holes &amp; Revelations in the UK on 27 November 2006, debuting at #10 in the UK Singles Chart (see 2006 in British music).", "published": "Sun, 9 May 2010 05:15:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Knights of Cydonia", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Knights+of+Cydonia", "listeners": "917375", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/epic", "name": "epic"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}]}, "mbid": "e428744b-48d4-41e8-90bd-9b8677ea0e69", "duration": "367000", "playcount": "7828291", "id": "52031054"}}