{"track": {"album": {"@attr": {"position": "4"}, "title": "Led Zeppelin IV", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin+IV", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78946605.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78946605.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78946605.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78946605.png", "size": "extralarge"}], "artist": "Led Zeppelin", "mbid": "103a462d-a9f2-4f05-9490-3d8fe506c8a6"}, "wiki": {"content": "&quot;Stairway to Heaven&quot; is a song by the English rock band Led Zeppelin. It was composed by guitarist Jimmy Page and vocalist Robert Plant for the band's fourth studio album, Led Zeppelin IV. It is the most requested and most played song on FM radio stations in the United States, despite never having been released as a single there. In November 2007, through download sales promoting their recent Mothership release, the song hit #37 on the UK Singles Chart  and #13 on the New Zealand Singles Chart. It was voted #3 in 2000 by VH1 on their list of the 100 Greatest Rock Songs.\n \n According to music journalist Stephen Davis, although the song was released in 1971, it took until 1973 before the song's popularity ascended to truly &quot;anthemic&quot; status.\n \n &quot;Stairway to Heaven&quot; continues to top radio lists of the greatest rock songs, as well as topping a recent Guitar World poll. On the 20th anniversary of the original release of the song, it was announced via U.S. radio sources that the song had logged up an estimated 2,874,000 radio plays - back to back, that would run for 44 years solid. As of 2000, the song had been broadcast on radio over three million times. It is also the biggest-selling single piece of sheet music clocking up an average of 15,000 copies yearly. In total, over one million copies have been sold.\n \n The song's length precluded its release in full form as a single. Despite pressure from Atlantic Records the band would not authorize the editing of the song for single release, making &quot;Stairway to Heaven&quot; one of the most well-known and popular rock songs never to have been released as a single. It did, however, appear as a promotional disc in the United States, pressed as a 7:55 track on each side; on an Australian acoustic EP, and in the 1990s as a 20th anniversary promo book.\n \n The group's recording of this song also appeared as the sole Led Zeppelin track in the 1977 Atlantic Records 2-LP promotional sampler album, We've Got Your Music, marking the very first time that Led Zeppelin's &quot;Stairway To Heaven&quot; made its official debut appearance in an American-released various artists compilation collection.\n \n In 2004, Rolling Stone magazine put it at number 31 on their list of the 500 Greatest Songs of All Time. In in a January 29, 2009, article, Guitar World magazine rated Jimmy Page's guitar solo at number one in the publication's 100 Greatest Guitar Solos in Rock and Roll History.\n \n Critics of rock and roll songs (and of Led Zeppelin in particular) have alleged that a backmasked message is recorded into &quot;Stairway to Heaven.&quot; The message, which allegedly occurs during the middle section of the song (&quot;If there's a bustle in your hedgerow, don't be alarmed now...&quot;), is purported to contain Satanic references:\n \n     Oh here's to my sweet Satan.\n     The one whose little path would make me sad, whose power is Satan.\n     He will give those with him 666.\n     There was a little tool shed where he made us suffer, sad Satan.\n \n     – Most popular version of the lyrics to Stairway to Heaven played backwards\n \n The controversy originated from a prominent Baptist, who, in 1982, preached on the radio that &quot;Stairway to Heaven&quot; contained subliminal backward messages. This theory was later primarily advanced by Michael Mills, Jacob Aranza, and Jeff Godwin, who offered detailed analyses asserting the existence of hidden meanings within both the &quot;backwards&quot; and actual lyrics. In 1982, the Consumer Protection and Toxic Materials Committee of the California State Assembly held a hearing on backmasking in popular music, during which &quot;Stairway to Heaven&quot; was played backwards. William Yarroll, a self-identified neuroscientist, also claimed that &quot;Stairway to Heaven&quot; contained a message when played backwards. Various versions of the alleged message exist.\n \n The band itself has for the most part ignored such claims; for years the only comment came from Swan Song Records which issued the statement: &quot;Our turntables only play in one direction—forwards&quot;. Led Zeppelin audio engineer Eddie Kramer confirmed this, calling the allegations &quot;totally and utterly ridiculous. Why would they want to spend so much studio time doing something so dumb?&quot; Robert Plant expressed frustration with the accusations in an interview: &quot;To me it's very sad, because 'Stairway to Heaven' was written with every best intention, and as far as reversing tapes and putting messages on the end, that's not my idea of making music.&quot;\n \n An informal experiment by scientist Simon Singh suggested that listeners only hear the message after prompting.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Stairway to Heaven&quot; is a song by the English rock band Led Zeppelin. It was composed by guitarist Jimmy Page and vocalist Robert Plant for the band's fourth studio album, Led Zeppelin IV. It is the most requested and most played song on FM radio stations in the United States, despite never having been released as a single there. In November 2007, through download sales promoting their recent Mothership release, the song hit #37 on the UK Singles Chart  and #13 on the New Zealand Singles Chart. It was voted #3 in 2000 by VH1 on their list of the 100 Greatest Rock Songs. ", "published": "Wed, 3 Jun 2009 19:17:28 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Stairway to Heaven", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Stairway+to+Heaven", "listeners": "1002400", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/led%20zeppelin", "name": "led zeppelin"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "e6b3916e-668a-42b7-b0fa-76452d233971", "duration": "480000", "playcount": "8193018", "id": "12729"}}