{"track": {"album": {"@attr": {"position": "3"}, "title": "Absolution", "url": "http://www.last.fm/music/Muse/Absolution", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/61418461.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/61418461.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/61418461.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/61418461.png", "size": "extralarge"}], "artist": "Muse", "mbid": "6ff10d60-8e80-4f51-9037-2932b5f49f5a"}, "wiki": {"content": "&quot;Time Is Running Out&quot; is a song by English alternative rock band Muse, and is the third track on their third album, Absolution. It was released as the lead single from the album on September 8, 2003, in the United Kingdom and other countries. The single proved to be the band's breakthrough hit on alternative rock radio in the United States - hitting number nine on the Billboard Modern Rock Tracks chart. It was also the band's first Top 10 hit in the UK, peaking at number eight, besting the number eleven peak of &quot;Plug In Baby&quot;.\n \n This song is notable for Chris Wolstenholme's groovy synth-bass riff that was inspired by Michael Jackson.\n \n The video depicts a number of military officials seated at a round table performing actions simultaneously, moving to the beat of the song, as Muse play the song on the table, with the officials apparently oblivious to Muse's presence. Eventually, the officers begin to start dancing on the table, seeming to go insane. They eventually end up crawling. It is partially based on Dr. Strangelove or: How I Learned to Stop Worrying and Love the Bomb.\n \n Time Is Running Out was featured on the FLYING-DOG Soundtrack \n The song has been featured in an episode of Entourage entitled &quot;The Boys Are Back in Town&quot; and in 2008, the song was featured on Torchwood Declassified, to represent the deaths of two main characters. \n In 2006, the song was featured in the trailer for the film Running Scared and was also used in promotional spots of the Turner Classic Movies channel. \n In 2005, The Feeling covered the song for Jo Whiley's Live Lounge on Radio One. They apparently did not know what the song was called or who it was by when they covered it. \n The song has been featured in the book Blue Bloods by Melissa De La Cruz. \n This song was used during a montage of Usain Bolt's 2008 Olympic performance on NBC. \n A string version by The Section Quartet[1] was played in an episode of Gossip Girl entitled &quot;New Haven Can Wait&quot; on October 14, 2008. \n The song was played during the late night Hollyoaks special &quot;Back From The Dead&quot;. \n The song was used during an Australian Beach Cricket game on Channel 9 after returning from a commercial break, and in doing so has become part of the elite class of songs that have been used as bumper music.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Time Is Running Out&quot; is a song by English alternative rock band Muse, and is the third track on their third album, Absolution. It was released as the lead single from the album on September 8, 2003, in the United Kingdom and other countries. The single proved to be the band's breakthrough hit on alternative rock radio in the United States - hitting number nine on the Billboard Modern Rock Tracks chart. It was also the band's first Top 10 hit in the UK, peaking at number eight, besting the number eleven peak of &quot;Plug In Baby&quot;. ", "published": "Sun, 9 May 2010 05:05:01 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Time Is Running Out", "artist": {"url": "http://www.last.fm/music/Muse", "mbid": "1695c115-bf3f-4014-9966-2b0c50179193", "name": "Muse"}, "url": "http://www.last.fm/music/Muse/_/Time+Is+Running+Out", "listeners": "1103040", "toptags": {"tag": [{"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/muse", "name": "muse"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}]}, "mbid": "ec65836d-7fea-4c15-89a3-009bd28638c8", "duration": "236000", "playcount": "9757601", "id": "2684402"}}