{"track": {"album": {"@attr": {"position": "9"}, "title": "1", "url": "http://www.last.fm/music/The+Beatles/1", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82140005.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82140005.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82140005.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82140005.png", "size": "extralarge"}], "artist": "The Beatles", "mbid": "91a07ae5-2790-3af8-b91e-1b1b2d272bd1"}, "wiki": {"content": "&quot;Ticket to Ride&quot; is a song by The Beatles from their 1965 album, Help!. It was recorded 15 February 1965 at Abbey Road Studios and released two months later. In 2004, this song was ranked number 384 on Rolling Stone magazine's list of the 500 greatest songs of all time.\n \n The song was written primarily by John Lennon (credited to Lennon/McCartney), with Paul McCartney's contributions in dispute. Lennon said that McCartney's contribution was limited to &quot;the way Ringo played the drums&quot;. McCartney said that was an incomplete response, and that &quot;we sat down and wrote it together... give him 60 percent of it... we sat down together and worked on that for a full three-hour songwriting session.&quot;  Lennon said the double-time ending section (with the lyric &quot;My baby don't care&quot;) was one of his &quot;favourite bits&quot; in the song. This song was also the first song by the band in which McCartney was featured on lead guitar.\n \n Lennon proudly claimed that it was the first heavy metal song given the droning bassline, repeating drums, and loaded guitar lines.\n \n While the song lyrics describe a girl &quot;riding out of the life of the narrator&quot;, the inspiration of the title phrase is unclear. McCartney said it was &quot;a British Railways ticket to the town of Ryde on the Isle of Wight&quot;, and Lennon said it described cards indicating a clean bill of health carried by Hamburg prostitutes in the 1960s. The Beatles played in Hamburg early in their musical career, and &quot;ride/riding&quot; was slang for having sex.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ticket to Ride&quot; is a song by The Beatles from their 1965 album, Help!. It was recorded 15 February 1965 at Abbey Road Studios and released two months later. In 2004, this song was ranked number 384 on Rolling Stone magazine's list of the 500 greatest songs of all time.  The song was written primarily by John Lennon (credited to Lennon/McCartney), with Paul McCartney's contributions in dispute. Lennon said that McCartney's contribution was limited to &quot;the way Ringo played the drums&quot;. McCartney said that was an incomplete response, and that &quot;we sat down and wrote it together.", "published": "Sun, 28 Feb 2010 06:20:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ticket to Ride", "artist": {"url": "http://www.last.fm/music/The+Beatles", "mbid": "b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d", "name": "The Beatles"}, "url": "http://www.last.fm/music/The+Beatles/_/Ticket+to+Ride", "listeners": "604283", "toptags": {"tag": [{"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/the%20beatles", "name": "the beatles"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}]}, "mbid": "ee78cac8-2e9d-4916-b933-aa552075899a", "duration": "190000", "playcount": "3247576", "id": "10410"}}