{"track": {"album": {"@attr": {"position": "14"}, "title": "Cross Road", "url": "http://www.last.fm/music/Bon+Jovi/Cross+Road", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/85817391.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/85817391.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/85817391.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/85817391.png", "size": "extralarge"}], "artist": "Bon Jovi", "mbid": "96427302-21bc-4e99-be86-75228b0e3b72"}, "wiki": {"content": "&quot;Runaway&quot; is a Bon Jovi song, written in 1980 and originally recorded in 1981 for the so called &quot;Power Station Demos&quot;. The recordings were primarily done by an ensemble simply known as Jon Bongiovi &amp; The Rest. Lead guitar on the original 1980's track was Bon Jovi's neighbour, Dave Sabo (a.k.a. The Snake), who would later form the group Skid Row. One night after a show, Richie Sambora found Bon Jovi backstage and told him that he should be the guitarist. Bon Jovi wrote him off and didn't think much of it but told him to learn the material and show up for rehearsal. Sambora was early and knew the material and Bon Jovi was impressed; in that moment, Sambora became the band's lead guitarist and a Bon Jovi was born.\n \n The track released in 1983 was recorded in 1982 by Jon Bon Jovi and a group of studio musicians known as &quot;The All Star Review,&quot; which included Hugh McDonald (bass), Tim Pierce (guitar) and Roy Bittan (keyboards). The keyboard intro was written by Mick Seeley, then of John Bongiovi and the Wild One's and later with Southside Johnny &amp; The Asbury Jukes.\n \n In 1983, local radio station WAPP 103.5FM &quot;The Apple&quot; had a contest, held in conjunction with St. John's University, to search for the best unsigned band. After the song won the contest, it became an instant hit in the summer of 1983.\n \n Runaway was later released as the first single from the album Bon Jovi. It hit the Top 40 on the Billboard Hot 100 at #39 in early-1984 and became the band's first Top 40 hit in US. It should also be noted that it is the only song from the bands' first two albums that is still performed live. In recent live performances, frontman and occasional rhythm guitarist Jon Bon Jovi has been known to do a short guitar solo near the end of the song, something which he has rarely (if ever) done before onstage.\n \n A dance/club remake of &quot;Runaway&quot; was released in July 2008 by &quot;DJ Freddy Retro featuring Jim Davis Jr.&quot; on Casa Records.\n \n The song was recently featured on a MasterCard commercial. Runaway was recently featured in Paul Blart: Mall Cop.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Runaway&quot; is a Bon Jovi song, written in 1980 and originally recorded in 1981 for the so called &quot;Power Station Demos&quot;. The recordings were primarily done by an ensemble simply known as Jon Bongiovi &amp; The Rest. Lead guitar on the original 1980's track was Bon Jovi's neighbour, Dave Sabo (a.k.a. The Snake), who would later form the group Skid Row. One night after a show, Richie Sambora found Bon Jovi backstage and told him that he should be the guitarist. Bon Jovi wrote him off and didn't think much of it but told him to learn the material and show up for rehearsal.", "published": "Tue, 28 Jul 2009 10:35:14 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Runaway", "artist": {"url": "http://www.last.fm/music/Bon+Jovi", "mbid": "5dcdb5eb-cb72-4e6e-9e63-b7bace604965", "name": "Bon Jovi"}, "url": "http://www.last.fm/music/Bon+Jovi/_/Runaway", "listeners": "235822", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/bon%20jovi", "name": "bon jovi"}]}, "mbid": "f2d50bc0-5092-448b-b928-a8aca2503807", "duration": "231000", "playcount": "1197932", "id": "1018412"}}