{"track": {"album": {"@attr": {"position": "4"}, "title": "Hot Fuss", "url": "http://www.last.fm/music/The+Killers/Hot+Fuss", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/68101062.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/68101062.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/68101062.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/68101062.png", "size": "extralarge"}], "artist": "The Killers", "mbid": "8ce105a8-5695-3603-84c9-a1d03d0d06da"}, "wiki": {"content": "&quot;Somebody Told Me&quot; is a song performed by The Killers. The song is featured on the group's debut album Hot Fuss and was written by Dave Keuning, Ronnie Vannucci Jr., Mark Stoermer and Brandon Flowers.\n \n Lead singer Brandon Flowers refers to this song as &quot;Our most Vegas-influenced song on the album. Sin city, The Strip. It's where I grew up and of course it affects the songs I write. This song has a lot of sexual energy.&quot;\n \n When The Killers first started out, their music was little noticed by music-buyers and the media, which is why &quot;Somebody Told Me&quot; has been released twice in slightly different forms. The first, with the pink background cover, is the rarer version of the single as it was their first release of it; due to poor sales not as many were produced. When re-released, the cover-art sported a blue background colour and is the more common version of the single.\n \n The single peaked at #51 on the US Billboard Hot 100. The re-issued, blue edition of the single peaked at #3 in the UK.\n \n In Australia, the song was ranked #4 on Triple J's Hottest 100 of 2004.\n \n In 2009 it was voted at Number 18 in UK radio station XFM's &quot;100 Greatest Songs of All Time.\n \n The music video for &quot;Somebody Told Me&quot;, directed by Brett Simon, simply shows The Killers performing their song in the moonlight of a desert location, with a giant LED screen displaying rolling, flashing images of their logo, as well as an alternate version of the video shot during the day, presumably in the same location. The concept is very similar to the video for &quot;Crystal&quot; by New Order, which features a fictional band called The Killers miming the New Order song in front of a large video screen flashing random colours and images. It was from this video that The Killers got their band name, so the similarities are likely an intentional homage.\n \n \n Billboard called the song &quot; wildly infectious,&quot; and &quot;as addictive as nickel slots.&quot; Blender said the single is a &quot;superb blaze of synthesizers and guitars that builds to the year's best one-liner: 'Somebody told me you had a boyfriend who looked like a girlfriend I had in February of last year.'&quot; Entertainment Weekly hailed the single as &quot;three smashingly punchy minutes of garage pop so tightly wound that singer Brandon Flowers seems to be accusing his girl of cheating on him with another woman, is the song worth downloading.&quot; Rolling Stone said the single was a &quot;nightclub anthem in the making&quot; and continued, &quot;the acid-tongued 'Somebody Told Me' blasts into outer space on a wave of synthesizers and singer Brandon Flowers' cheeky chorus.\n \n Richard Cheese and Lounge Against the Machine covered this song into a Lounge style on their 2005 album Aperitif for Destruction. He sings the song in a drunken manner and, near the end of the song, he apparently runs to the bathroom to puke. The song was also covered by Daniel Bedingfield as part of a Radio 1 Live Lounge session.\n \n It was also covered by Charlotte Church and Alesha Dixon on The Charlotte Church Show.\n \n &quot;Weird Al&quot; Yankovic also included this song in &quot;Polkarama&quot; from Straight Outta Lynwood.\n \n There is a parody of this song by ApologetiX called &quot;Somebody Sold Me.&quot;\n \n On 9 October 2009, JLS appeared on the BBC One chat show Friday Night with Jonathan Ross]], where they performed an acapella version of the song.\n \n     * The song is heard in the film Rocky Balboa when Rocky Jr. is in the bar and sees the computer simulated fight.\n     * The song is a playable song on the music video game Rock Revolution.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Somebody Told Me&quot; is a song performed by The Killers. The song is featured on the group's debut album Hot Fuss and was written by Dave Keuning, Ronnie Vannucci Jr., Mark Stoermer and Brandon Flowers.  Lead singer Brandon Flowers refers to this song as &quot;Our most Vegas-influenced song on the album. Sin city, The Strip. It's where I grew up and of course it affects the songs I write. This song has a lot of sexual energy.&quot;  ", "published": "Mon, 19 Oct 2009 14:10:11 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Somebody Told Me", "artist": {"url": "http://www.last.fm/music/The+Killers", "mbid": "24b4aee8-32ed-4163-98f7-55bae67411ae", "name": "The Killers"}, "url": "http://www.last.fm/music/The+Killers/_/Somebody+Told+Me", "listeners": "1396785", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/indie", "name": "indie"}, {"url": "http://www.last.fm/tag/indie%20rock", "name": "indie rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/the%20killers", "name": "the killers"}]}, "mbid": "f367b317-55f8-4860-8fd1-efe126b55d37", "duration": "198000", "playcount": "10026496", "id": "3168755"}}