{"track": {"album": {"@attr": {"position": "3"}, "title": "Songs for the Deaf", "url": "http://www.last.fm/music/Queens+of+the+Stone+Age/Songs+for+the+Deaf", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/59975609.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/59975609.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/59975609.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/59975609.png", "size": "extralarge"}], "artist": "Queens of the Stone Age", "mbid": "5ea5bad0-b187-40cd-ad87-c9649efe6040"}, "wiki": {"content": "&quot;No One Knows&quot; is a song by American hard rock band Queens of the Stone Age written by band members Josh Homme, Nick Oliveri and Mark Lanegan. It was the first single and second track from their third album, Songs for the Deaf, and was released on November 26, 2002. &quot;No One Knows&quot; was a chart success, becoming the band's only single to top the US Modern Rock charts. The song was also critically acclaimed, receiving a nomination for Best Hard Rock Performance at the 2003 Grammy Awards.\n \n According to Homme, &quot;No One Knows&quot; existed before the recording sessions for Songs for the Deaf:\n \n     We have patience with music, a year or five years down the road it may kind of rewrite itself and become what it's supposed to be. There's two songs on this record that are over five years old, you know? 'God is the Radio' and 'No One Knows'.\n \n The main guitar riff of the song originally appeared on the track &quot;Cold Sore Superstars&quot; from Can You See Under My Thumb? There You Are, the seventh volume of Homme side-project The Desert Sessions. Recording for Songs for the Deaf began in March 2002 at three studios across California. Though the liner notes credit Homme and Eric Valentine with producing the majority of the album – including &quot;No One Knows&quot; – Homme credits Valentine with merely recording the beginning of the album for contractual reasons, and departing the project to leave recording and producing duties to the band and Adam Kasper.\n \n The critical response to &quot;No One Knows&quot; was generally positive. In The Guardian review of the album, reviewer Dave Simpson, said of the song in his four star review of Songs for the Deaf &quot;No One Knows has killer riffs to spare&quot;. Playlouder were similarly enthused, calling the song &quot;soulful, like the last gasp of the hero in an old western&quot;. Eric Carr of Pitchfork called it an &quot;easy groove&quot; and &quot;four-to-the-floor slime of the highest quality&quot;.\n \n &quot;No One Knows&quot; was awarded the number one position on Australian national radio station Triple J's annual Hottest 100 2002, with four other Queens of the Stone Age tracks also charting. The March 2005 edition of Q magazine placed it at number 70 in its list of the 100 Greatest Guitar Tracks saying of the song &quot;Possibly the only full-on, legs akimbo guitar great to be based around a rhythm that goes oompah-oompah, here Josh Homme joined the ranks of the immortal&quot;. In September 2006, it was placed at number 13 on NME's list of the 50 Greatest Tracks Of The Decade. Rolling Stone placed &quot;No One Knows&quot; at number 97 on their list of the 100 Greatest Guitar Songs of All Time saying of the track &quot;QOTSA guitarist and overall mastermind Josh Homme found the sweet spot between hooky hard rock and the pulverizing metal he'd grown up playing&quot;. The song was listed at number eleven on the 2002 Pazz &amp; Jop list, a survey of several hundred music critics conducted by Robert Christgau. &quot;No One Knows&quot; was nomination for Best Hard Rock Performance at the 2003 Grammys and was the band's first, but they lost out on the award to Foo Fighters for &quot;All My Life&quot;.\n \n &quot;No One Knows&quot; was released as a single on November 26, 2002 and became the most successful single from Songs for the Deaf. The song's peak placings of number one, number five and number 51 on the US Modern Rock, US Mainstream Rock (where it lasted for twenty weeks) and the Billboard Hot 100 charts respectively remain the highest of the band's career. &quot;No One Knows&quot; is also the band's highest charting single on the Dutch Singles Chart, number 39, the Irish Singles Chart, number 26, and the UK Singles Chart, number 15.\n \n The music video for &quot;No One Knows&quot; was directed by Dean Karr and Michel Gondry; Gondry filmed the first half on June 26 and 27, 2002, with Karr taking over on July 15. Josh Homme has said Gondry was chosen because he &quot;did all those videos for Björk and we're huge fans of Björk, so we're excited&quot;.\n \n The video is split into two sections and switches between them throughout. The first sees band members Homme, Nick Oliveri and Mark Lanegan driving a truck at night, whereupon they hit a deer. When they get out to inspect, the deer proceeds to attack them before going on a rampage in their truck. The second section of the video is of Homme, Oliveri, Troy Van Leeuwen and Dave Grohl performing the song against a black background.\n \n &quot;No One Knows&quot; received heavy rotation on music video channels culminating in a nomination for the MTV2 Award at 2003 MTV Video Music Awards, where it lost out to AFI for &quot;Girl's Not Grey&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;No One Knows&quot; is a song by American hard rock band Queens of the Stone Age written by band members Josh Homme, Nick Oliveri and Mark Lanegan. It was the first single and second track from their third album, Songs for the Deaf, and was released on November 26, 2002. &quot;No One Knows&quot; was a chart success, becoming the band's only single to top the US Modern Rock charts. The song was also critically acclaimed, receiving a nomination for Best Hard Rock Performance at the 2003 Grammy Awards.  According to Homme, &quot;No One Knows&quot; existed before the recording sessions for Songs for the Deaf: ", "published": "Sat, 16 Apr 2011 01:28:18 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "No One Knows", "artist": {"url": "http://www.last.fm/music/Queens+of+the+Stone+Age", "mbid": "246aa41e-8a40-4018-a6d6-8fb646418c25", "name": "Queens of the Stone Age"}, "url": "http://www.last.fm/music/Queens+of+the+Stone+Age/_/No+One+Knows", "listeners": "856825", "comments": ["superestimada", "has to be one of the most fun songs to drum to ever", "Me gusta el comentario en español ^_^", "Absolute classic! But what is it about? No one knows!", "2:58 until he comes back in at 3:43 is fucking rad.", "awesomeNESS!!!", "MASTERPIECE !!!", "This is so good it is impossible to put it into words.", "Hell yes.", "Great song <3", "Awesome!", "This goes way back haha", "great drums AND great guitar!!!", ":3", "their greatest album so far [2]", "Possibly the best song of QOTSA from their greatest album so far.", "Songs for the Deaf is one of the greatest albums in 2002! Amazing", "Wow!", "bad ass song!!", "Dave Grohl~FTW!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/stoner%20rock", "name": "stoner rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}]}, "mbid": "f3a6b627-b383-47c9-8004-13b8d1fac14e", "duration": "279000", "playcount": "5395800", "id": "1010274"}}