{"track": {"album": {"@attr": {"position": "14"}, "title": "Abbey Road", "url": "http://www.last.fm/music/The+Beatles/Abbey+Road", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88060027.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88060027.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88060027.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88060027.png", "size": "extralarge"}], "artist": "The Beatles", "mbid": "9e53c190-5621-3848-8ae4-39ad9f7d9ace"}, "wiki": {"content": "The song was originally introduced during The White Album sessions; a demo from the Esher Sessions can be found on Anthology 3. Lennon would describe this song, along with &quot;Mean Mr. Mustard&quot;, in The Beatles Anthology as &quot;a bit of crap I wrote in India&quot;.\n \n The name 'Polythene Pam' came from the nickname of an early Beatles' fan from the Cavern Club days, named Pat Hodgett (now Dawson), who would often eat polythene. She became known as 'Polythene Pat'. She said in an interview, &quot;I used to eat polythene all the time. I'd tie it in knots and then eat it. Sometimes I even used to burn it and then eat it when it got cold.&quot;\n \n Structured as a limerick, the song is superficially about &quot;a mythical Liverpool scrubber dressed up in her jackboots and kilt&quot;, the kind of girl who &quot;makes the News of the World&quot;. The song is also sung in a very strong Liverpudlian &quot;Scouse&quot; accent. In actuality it was inspired by an evening that John spent with poet Royston Ellis and his girlfriend, Stephanie. The three wore bags made of &quot;polythene&quot;, a common British contraction of polyethylene, and slept in the same bed out of curiosity about kinky sex. Incidentally, John would later admit in the 1980 interview with Playboy that Ellis was the first person to introduce The Beatles to drugs when he showed them how to get high from the strips inside a Benzedrine inhaler. It was in this interview that John supplied the details of this event but refused to elaborate further.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The song was originally introduced during The White Album sessions; a demo from the Esher Sessions can be found on Anthology 3. Lennon would describe this song, along with &quot;Mean Mr. Mustard&quot;, in The Beatles Anthology as &quot;a bit of crap I wrote in India&quot;.  The name 'Polythene Pam' came from the nickname of an early Beatles' fan from the Cavern Club days, named Pat Hodgett (now Dawson), who would often eat polythene. She became known as 'Polythene Pat'.", "published": "Fri, 30 Oct 2009 20:47:47 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Polythene Pam", "artist": {"url": "http://www.last.fm/music/The+Beatles", "mbid": "b10bbbfc-cf9e-42e0-be17-e2c3e1d2600d", "name": "The Beatles"}, "url": "http://www.last.fm/music/The+Beatles/_/Polythene+Pam", "listeners": "419951", "comments": ["I remember reading Lennon being dismissive of this, but that was in his let's rubbish everything the Beatles did phase.\r\n\r\nhttp://www.beatlesbible.com/songs/polythene-pam/", "That guitar riff is one of the greatest things in musical history.", "What a perfect lil' ditty.", "how I wish it would be longer", "not exactly the abbey road version here---john solo i think", "babaaaaaaaaam !", "anyone else think this song sounds eerily like David Bowie?", "WTF..Weird version this time!", "Grreeat! XD", "I still think Green Day ripped this off.", "yeah yeah yeah...weird not hearing the segue to\"She came...window\"", "Amazing, wish it was longer", "Oh nice, this version sounds like it was done in the bathroom, with the cheapest guitar they could find!", "so strange to hear these out of context", "Harmonies are amazing.", "Though Scouse accent really flows out in this one!", "although punk was being done by the stooges and shit whatever", "the greatest. punk in 1969. tea towels on the toms!", "She's so good looking but she looks like a man :D", "THOSE DRUMS"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/the%20beatles", "name": "the beatles"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}]}, "mbid": "f3c9792f-c6aa-4b1e-9feb-ce75a30b1f34", "duration": "72000", "playcount": "2176039", "id": "1058093"}}