{"track": {"album": {"@attr": {"position": "1"}, "title": "Echoes, Silence, Patience & Grace", "url": "http://www.last.fm/music/Foo+Fighters/Echoes,+Silence,+Patience+&+Grace", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83693587.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83693587.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83693587.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83693587.png", "size": "extralarge"}], "artist": "Foo Fighters", "mbid": "fd262f0e-5a81-4945-9033-71127c7bc3d5"}, "wiki": {"content": "&quot;<a title=\"Foo Fighters &ndash; The Pretender\" href=\"http://www.last.fm/music/Foo+Fighters/_/The+Pretender\" class=\"bbcode_track\">The Pretender</a>&quot; is the first single from the <a href=\"http://www.last.fm/music/Foo+Fighters\" class=\"bbcode_artist\">Foo Fighters</a>' 2007 album <a title=\"Foo Fighters - Echoes, Silence, Patience &amp; Grace\" href=\"http://www.last.fm/music/Foo+Fighters/Echoes,+Silence,+Patience+&amp;+Grace\" class=\"bbcode_album\">Echoes, Silence, Patience &amp; Grace</a>.\n \n In a 2007 interview with XFM, frontman <a href=\"http://www.last.fm/music/Dave+Grohl\" class=\"bbcode_artist\">Dave Grohl</a> stopped short of explaining the meaning behind &quot;The Pretender,&quot; but alluded its roots go to current political unrest. Grohl noted:\n \n <em>That's the thing with lyrics, you never want to give away specifics, because it's nice for people to have their own idea or interpretation of the song. But, you know, everyone's been fucked over before and I think a lot of people feel fucked over right now and they're not getting what they were promised, and so something to do with that.</em>\n \n Grohl also told XFM &quot;The Pretender&quot; wasn't initially planned for the album and happened really quickly.\n \n <em>That song didn't happen until later on in the session. We didn't go into making the record with that song and it happened after we recorded a lot of stuff. Up until that point, I didn't know if we had a good opening song or not. So after we recorded it, I thought, 'oh this is perfect, we have the song to open the record,' and it just became everybody's favorite song. ... It's the type of song that I look forward to opening shows with and it came together really easily. We put that song together in, I don't know, a day, whereas a lot of the other songs we worked on for weeks.&quot;</em>\n \n \n <strong>MUSIC VIDEO</strong>\n The video was directed by Sam Brown. It is presented in letterbox format and heavily employs pans, zooms, and tracking shots. It consists of the band performing the song in an airplane hangar with many strip lights on the ceiling. Behind the band is a large red screen, which is thick and solid. The band is then faced by what appears to be a riot police officer, who stands behind a black line on the floor, around 30 feet or so from the band. He has the number 21 on his bullet-proof vest. As the song progresses, he is joined by more riot police officers, and a panning shot shows us that to his left, the numbers on the officers' vests descend all the way to &quot;01&quot;. Assuming that there are the same number of officers on the man's right side, it can be gathered that there are 41 officers overall. As the quieter bridge begins, the video slows down as the officers charge at the band. Just as the band repeats the song's louder chorus, the screen suddenly explodes and a red liquid erupts from the red screen overwhelming the police officers but affecting the band to a lesser extent. At the end of the video, Dave Grohl is shown slamming his guitar on the floor as he falls to his knees.\n \n <strong>RECEPTION</strong>\n This song was #47 on Rolling Stone's list of the 100 Best Songs of 2007.[3]The song was a 2008 Grammy Award nominee for Best Rock Song. It won the Grammy for Best Hard Rock Performance the same year. This song was also #94 on MTV Asia's list of Top 100 Hits of 2007.\n \n This album was the fourth consecutive Foo Fighters album to have a song reach the top of the U.S. Hot Modern Rock Tracks. &quot;The Pretender&quot; is one of Foo Fighters' most successful songs; only &quot;<a title=\"Foo Fighters &ndash; Learn to Fly\" href=\"http://www.last.fm/music/Foo+Fighters/_/Learn+to+Fly\" class=\"bbcode_track\">Learn to Fly</a>&quot; and &quot;<a title=\"Foo Fighters &ndash; Best of You\" href=\"http://www.last.fm/music/Foo+Fighters/_/Best+of+You\" class=\"bbcode_track\">Best of You</a>&quot; beat its position on the U.S. Billboard Hot 100. &quot;The Pretender&quot; was the most densely played alternative rock song of 2007. It holds the record for longest running #1 in the Modern Rock Tracks' history, with 18 weeks at #1[5]. It also spent 6 weeks at #1 on the Mainstream Rock Tracks. It made the Triple J's Hottest 100 in Australia placing in at number 6.\n \n <strong>MEDIA</strong>\n *The song was used for the opening of TBS's broadcast of the 2007 NLCS and possibly the 2007 ALCS.\n *The song was used in the ending sequence of &quot;Filthy Lucre&quot;, the 9th episode of the Showtime show Californication.\n *The song was featured in Tony Hawk's Proving Ground.\n *The song was used in the ending sequence for the sixth season premiere of CSI: Miami.\n *The song was used in a Sky One advert for Prison Break.\n *The song was included as downloadable content in Guitar Hero III.\n *A short clip of the video was used in a commercial for the iPod Touch.\n *Foo Fighters performed the song live, along with Learn to Fly, at the Spike Video Game Awards 2007.\n *The song was used frequently by Channel Nine during the 07-08 ODI Cricket season.\n *The song was used for the advert of the new series of Primeval on ITV1.\n *The beginning of the song is featured in the TV series Medium.\n *The song was used in the FIA Gala video to sum up the Formula 1 World Championship of 2007\n *The song was played at the 2007 MTV Video Music Awards.\n *At the 2008 Grammy Awards a version of the song was played with the My Grammy Moment orchestra (conducted &amp; arranged by <a href=\"http://www.last.fm/music/Led+Zeppelin\" class=\"bbcode_artist\">Led Zeppelin</a>'s <a href=\"http://www.last.fm/music/John+Paul+Jones\" class=\"bbcode_artist\">John Paul Jones</a>). The winner of the My Grammy Moment competition was Ann Marie Calhoun, who played a violin solo.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;<a title=\"Foo Fighters &ndash; The Pretender\" href=\"http://www.last.fm/music/Foo+Fighters/_/The+Pretender\" class=\"bbcode_track\">The Pretender</a>&quot; is the first single from the <a href=\"http://www.last.fm/music/Foo+Fighters\" class=\"bbcode_artist\">Foo Fighters</a>' 2007 album <a title=\"Foo Fighters - Echoes, Silence, Patience &amp; Grace\" href=\"http://www.last.fm/music/Foo+Fighters/Echoes,+Silence,+Patience+&amp;+Grace\" class=\"bbcode_album\">Echoes, Silence, Patience &amp; Grace</a>.  In a 2007 interview with XFM, frontman <a href=\"http://www.last.fm/music/Dave+Grohl\" class=\"bbcode_artist\">Dave Grohl</a> stopped short of explaining the meaning behind &quot;The Pretender,&quot; but alluded its roots go to current political unrest. Grohl noted:  That's the thing with lyrics, you never want to give away specifics, because it's nice for people to have their own idea or interpretation of the song.", "published": "Fri, 20 Nov 2009 00:40:28 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "The Pretender", "artist": {"url": "http://www.last.fm/music/Foo+Fighters", "mbid": "67f66c07-6e61-4026-ade5-7e782fad3a5d", "name": "Foo Fighters"}, "url": "http://www.last.fm/music/Foo+Fighters/_/The+Pretender", "listeners": "986348", "comments": ["Have to shout again! what a song!!!!", "Grohl is a top bloke", "klasse!", "great song.", "My favourite!", "Powerful jam, love this track, I listen to it when I practice Wing Chun.", "Foo Fighters are well known but I think they are lyrically and intrustmentally underrated. They are amaing! <3", "<3", "\\m/", "Das rockt!", "Tony Hawk *-*", "Dave Grohl is by far one of the coolest guys in the world. *___*", "I remember hearing this song on Tony Hawk's Proving Ground when I was 14 and absolutely loving it. Foo Fighters will always be my favourite band.", "You cant stay calm listening to this song [2]", "Beginning sounds like Stairway to Heaven! [2] |:", "you cant stay calm listening to this song ...", "so much energy", "•*¨*•.¸¸❤¸¸.•*¨*•", "this song is just perfection! loooove it.", "/:O"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/foo%20fighters", "name": "foo fighters"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}, {"url": "http://www.last.fm/tag/grunge", "name": "grunge"}]}, "mbid": "f808a32b-9285-431f-84da-959aa4463d1b", "duration": "268000", "playcount": "7712388", "id": "113745625"}}