{"track": {"album": {"@attr": {"position": "4"}, "title": "Sultans of Swing: The Very Best of Dire Straits", "url": "http://www.last.fm/music/Dire+Straits/Sultans+of+Swing:+The+Very+Best+of+Dire+Straits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88134159.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88134159.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88134159.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88134159.png", "size": "extralarge"}], "artist": "Dire Straits", "mbid": "f3c83b8e-7c50-4480-a9c4-d4a3844f5fc1"}, "wiki": {"content": "&quot;Tunnel of Love&quot; is a 1980 rock song by Dire Straits. It appears on the album Making Movies, and subsequently on the live albums Alchemy and Live at the BBC and the greatest hits albums Money for Nothing, Sultans of Swing: The Very Best of Dire Straits, and The Best of Dire Straits &amp; Mark Knopfler: Private Investigations.\n \n It reached the position of only #54 in the UK Singles Chart upon its single release in October 1981, despite being one of the band's most famous and popular songs. Two music videos exist for the song, one depicting Mark Knopfler, John Illsley and Pick Withers performing on a blank set, intercut with imagery and actors relevant to the lyrics, the other featuring a larger band arrangement and telling the story of a couple escaping a group of soldiers who chase them from a funfair.\n \n The Spanish City in the song was a fairground located in Whitley Bay, part of the North Sea coast to the north-east of Newcastle upon Tyne, one train stop along from Cullercoats as mentioned in the song. The term &quot;Rockaway&quot; references Rockaway Beach in New York City, the location of the Rockaways' Playland amusement park. In 1980s concerts, Dire Straits played the central theme of The Animals' &quot;Don't Let Me Be Misunderstood&quot; during an extended instrumental introduction to the song, as Knopfler talked about that group's hometown of Newcastle. Knopfler's outro solo has received numerous plaudits over the years and has many times been described[by whom?] as one of the most heartbreaking guitar solos in history.\n \n &quot;Tunnel of Love&quot; is one of only three Dire Straits songs not written by Mark Knopfler alone (the other two are &quot;Money for Nothing&quot; and &quot;What's The Matter Baby?&quot;). The song itself is entirely by Knopfler, but the opening instrumental is an arrangement of the &quot;Carousel Waltz&quot; from the Rodgers and Hammerstein musical Carousel.\n \n The song is referred to in the novel So Long, and Thanks for All the Fish by Douglas Adams.[2]: &quot;Mark Knopfler has an extraordinary ability to make a Schecter Custom Stratocaster hoot and sing like angels on a Saturday night, exhausted from being good all week and needing a stiff drink.&quot;\n It was also used during the film An Officer and a Gentleman.\n \n The song is sampled in John Legend's &quot;I Love, You Love&quot; on his 2008 Evolver album.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Tunnel of Love&quot; is a 1980 rock song by Dire Straits. It appears on the album Making Movies, and subsequently on the live albums Alchemy and Live at the BBC and the greatest hits albums Money for Nothing, Sultans of Swing: The Very Best of Dire Straits, and The Best of Dire Straits &amp; Mark Knopfler: Private Investigations.  It reached the position of only #54 in the UK Singles Chart upon its single release in October 1981, despite being one of the band's most famous and popular songs.", "published": "Fri, 18 Mar 2011 11:38:30 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Tunnel of Love", "artist": {"url": "http://www.last.fm/music/Dire+Straits", "mbid": "614e3804-7d34-41ba-857f-811bad7c2b7a", "name": "Dire Straits"}, "url": "http://www.last.fm/music/Dire+Straits/_/Tunnel+of+Love", "listeners": "249384", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/dire%20straits", "name": "dire straits"}, {"url": "http://www.last.fm/tag/guitar", "name": "guitar"}]}, "mbid": "fbecf00f-a8bd-41fe-8b39-70329d068fad", "duration": "488000", "playcount": "1315899", "id": "1006135"}}