{"track": {"album": {"@attr": {"position": "11"}, "title": "Animals (Dance CD)", "url": "http://www.last.fm/music/Minilogue/Animals+(Dance+CD)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/6790845.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/6790845.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/6790845.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/6790845.jpg", "size": "extralarge"}], "artist": "Minilogue", "mbid": ""}, "wiki": {"content": "  Sebastian Mullaert and Marcus Henriksson emerged from opposing backgrounds. In his youth Sebastian played a range of classical instruments, he even worked as a violin teacher in his teens. At 18 he discovered contemporary music and joined a band. Marcus used to be a fan of Front 242 and Kraftwerk, he was ravished by the repetitive beats of techno when the music exploded in the nineties. He started to organize parties of his own and became a well known DJ in southern Sweden. When Sebastian and Marcus met at a party, there was an immediate connection. With Sebastian's formal knowledge and Marcus experience with club music the two fitted together like a lock and its matching key. As Son Kite and Trimatic they became very successful in the trance scene, playing enthusiastically received live sets all over the world. With Minilogue they leave the boundaries of that genre - and actually of any genre. After having risen to the A-List of electronic producers, they still reside in the tiny city of Malmö. As boys from the countryside they enjoy the easy and humble life of a small town. At the same time Malmö has always been very important for the underground dance music scene of Sweden. Since techno and house have exploded in this country, Stockholm tends to ride the hypes and trends, while Malmö is fighting for the deeper and more minimal side of the music. That is why Sebastian and Marcus still feel strongly and passionate about Malmö as their musical home.\n \n   Minilogue have always been very interested in the visual aspect of their art, it is natural for them to create an visual image as well as an audible one. For many years they have thought of animals as the front for Minilogue. These animals do not actually exist as pets. They are mystic, imaginary creatures, merged together from different species. They function as symbols for Minilogue's approach to electronic music as a mix of different genres and styles. The production of the album was a notable effort: It took Marcus and Sebastian three years until they were entirely happy with every bit of &quot;Animals&quot;. In order to create something timeless, they quit working on the tracks from time to time and returned with virginal ears. The result couldn't be more striking: The dance tracks remain powerful and humble, the ambient tracks are subtle and bold at the same time. Minilogue's music is emotional jet not moody. While contemporary electronic producers tend to get lost in layers of sounds and reverb, &quot;Animals&quot; is spring-loaded and nimble. Tracks so humble, effective and elegant they stream unremittingly into the listeners ears. The music stretches out towards the horizon in a gesture of unmitigated desire: a desire for wideness, a desire for sound, a desire for the elementary beauty of techno.\n \n Bio taken from official band website. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "  Sebastian Mullaert and Marcus Henriksson emerged from opposing backgrounds. In his youth Sebastian played a range of classical instruments, he even worked as a violin teacher in his teens. At 18 he discovered contemporary music and joined a band. Marcus used to be a fan of Front 242 and Kraftwerk, he was ravished by the repetitive beats of techno when the music exploded in the nineties. He started to organize parties of his own and became a well known DJ in southern Sweden. When Sebastian and Marcus met at a party, there was an immediate connection.", "published": "Wed, 30 Jul 2008 20:02:39 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Animals", "artist": {"url": "http://www.last.fm/music/Minilogue", "mbid": "56a70482-5528-4bef-8da2-a33cf098ce9b", "name": "Minilogue"}, "url": "http://www.last.fm/music/Minilogue/_/Animals", "listeners": "22425", "comments": [":D", "excelente", "von wegen fettes teil.........., ach so, der song alles etwas klarer................++++++++++++++", ",-,", ":-)))", "ganz großes Tennis", "Nutty fun.", "SVERIGE ...", "Danke Dormstadt2009....", "DER HAMMER!", "=)", "fresh, quirky, lively and skitterish. Has a light, upbeat charm thats contagious. feels good. grazie.", "conducive to toetapping", "epic:)", "hu hu huchhhh", "mmh. :)", "animals mein lieblingsalbum", "conducive to toetapping", "j'aime !", "der oberhammer...ich liebe es!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/minimal", "name": "minimal"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/techno", "name": "techno"}, {"url": "http://www.last.fm/tag/electronica", "name": "electronica"}, {"url": "http://www.last.fm/tag/minimal%20techno", "name": "minimal techno"}]}, "mbid": "53873c2e-fa80-4dc4-b3aa-c988c866e557", "duration": "434000", "playcount": "64392", "id": "186573273"}}