{"track": {"album": {"@attr": {"position": "5"}, "title": "Multila", "url": "http://www.last.fm/music/Vladislav+Delay/Multila", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/75246570.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/75246570.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/75246570.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/75246570.png", "size": "extralarge"}], "artist": "Vladislav Delay", "mbid": "2d5d4fc8-493f-4314-8e49-ba46ecc7c20a"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Karha", "artist": {"url": "http://www.last.fm/music/Vladislav+Delay", "mbid": "039cafb3-4f3d-44a9-b956-7705323f025b", "name": "Vladislav Delay"}, "url": "http://www.last.fm/music/Vladislav+Delay/_/Karha", "listeners": "10599", "comments": ["love this tune.", "Certain of the clicks are as deliberate as the non-repetitive time signatures (listen to the CD and vinyl with the right equipment and don't forget that Pole mastered this album).  Ripatti started with huge dub pieces in laptop free time -- he's a trained percussionist -- and moved slowly and reluctantly into microhouse and music with straighter beats.  I've loved him from the beginning (1995).", "Accidentally (or not), the clicks give this arrangement another dimension: the sense of subliminal disorder. It's what intrigued me to it in the first place. Mind you, I've never heard of this cat until falling upon this joint. Also intrigued by atmospheric synths and the underlying noises as well as the very filtered and almost unnoticeable drum beat that's blended beautifully. Sparked a few membranes, enjoyed this one a lot!", "No clicks on the proper version. Go get the album!", "\"madhatt3r111 wrote: the clicks are unnerving. Sounds like it was ripped poorly from the cd (jitters). The track is wonderful, otherwise\". ....   damn yeah the clicks are super annoying. is it just on the track here on lastfm? way too many chumps upload crap quality", "headphones recommended.", "Der beste Track von ihm. Die Artefakte hätten nicht sein müssen. Naja, ICH hab ja das Original, was beschwere ich mich. Jetzt gehe ich Kaviar essen. Ich meine: einen Keks.", "deep", "amazing!  great track", "Memories slipping away with the tide. A faint recollection of what was once considered true and real. A rhythm born anew in the scent of what is to come.", "Vladislav Delay's oceanic dubscapes are for me a fascinating conflation and variation on Miles Davis' 70s work and King Tubby's dubs.", "MUY DUB, PREFIERO MAS LA VERTIENTE AL ESTILO LUOMO, SU OTRO ALIAS .", "this is thehe kind of textures for my daily forcefeeding"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/minimal", "name": "minimal"}, {"url": "http://www.last.fm/tag/ambient", "name": "ambient"}, {"url": "http://www.last.fm/tag/my%20electronic%20music", "name": "my electronic music"}, {"url": "http://www.last.fm/tag/kataster", "name": "kataster"}, {"url": "http://www.last.fm/tag/forget%20about%20it%20all", "name": "forget about it all"}]}, "mbid": "75e54549-d8a0-4733-aa99-d8fd0737de9f", "duration": "709000", "playcount": "25712", "id": "1104764"}}