{"track": {"album": {"@attr": {"position": "1"}, "title": "Passages", "url": "http://www.last.fm/music/Ravi+Shankar+and+Philip+Glass/Passages", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/55862355.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/55862355.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/55862355.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/55862355.png", "size": "extralarge"}], "artist": "Ravi Shankar and Philip Glass", "mbid": ""}, "wiki": {"content": "<strong>Offering</strong>\n \n After a slow introduction saxophone plays the <em>Shankar</em> raga melody, subsequently enriched by the two other saxes. A long middle section in quicker tempo treats the material more freely in several parts, concluded with a shorter recapitulation of the opening theme.\n \n <strong>Review by Martin Perlich</strong>\n This historic collaboration brings full circle a process which began when promising young American musician Philip Glass met Indian master Ravi Shankar in Paris in 1965. That week Glass, studying with the great Nadia Bulanger, was earning pocket money doing notation and conducting a recording session for the soundtrack of Conrad Rook's film &quot;Chappacqua.&quot; The score's composer, Ravi Shankar, was directing his ensemble from the sitar.\n \n Ravi recalls, &quot;From the very first moment I saw such interest from him - he was a young man then - and he started asking me questions about ragas and talas and started writing down the whole score, and for the seven days he asked me so many questions. And seeing how interested he was I told him everything I could in that short time.&quot;\n \n &quot;It was possible to graduate from a major Western conservatory, in my case Juilliard, &quot; remembers Glass, &quot;without exposure to music from outside the Western tradition. World music was completely unknown in the mid-60's.&quot;\n \n &quot;What the young Glass heard which lay beyond his conservatory hermeticity was RHYTHM, long out of fashion in the world of American academic post-Webernism, with its almost exclusive concern for harmonic organization. Indian music is based on melody, which would get you laughed at Princeton or Columbia, and rhythm, which, despite Stravinsky's efforts in works like &quot;Le Sacre du Printemps&quot; or &quot;Les Noces&quot; was considered &quot;incidental&quot; to constructing 12-tone rows and other serious contrapuntal matters.\n \n So for someone to play for the budding composer an expressive, vital, respect-worthy music — based on 4,000 years of refining the interaction between the two forgotten elements of Western music — must have been mildly astonishing at the very least. He realized that one could construct music on a rhythmic, as opposed to a harmonic, base.\n \n Also, unlike most of the composers Glass had met up till that time, Ravi Shankar was a player, a composer/performer, whose authority arose from intimate hands-on contact with the music itself, and the other musicians, with whom he regularly shared a vibrating column of air. Glass became a student of Shankar's, Philip Glass today acknowledges &quot;I owe a lot to Ravi; he was one of my teachers. &quot;\n \n The movement Philip Glass helped to create was called &quot;Minimalism,&quot; and the founding Minimalists are all fine performers. Whatever differences they may have had in the mid-60's, what they had in common was the dynamic re-assertion of the primacy of rhythm.\n \n They chose different sources: Steve Reich was drawn by African drumming and Balinese gamelan (as well as Be-bop); Terry Riley by Northern Indian vocal techniques under the guidance of the legendary Pandit Pran Nath, as well as blues and jazz improvisation; and in the next generation, John Adams points to rock and roll as well as the early Minimalists, as his seminal influences.\n \n Pandit Ravi Shankar went to collaborations with Sir Yehudi Menuhin, Jean-Pierre Rampal and the much-publicized master/pupil relationship with Beatle George Harrison that served to introduce Indian music (and its inherent spirituality) to a generation of rock fans. Film scores such as the legendary Apu trilogy, &quot;Charly&quot; and &quot;Gandhi&quot; as well as additional cross-cultural excursions into other musical traditions, have enriched his palette, all the while he has remained pre-eminent in the classical Indian music which traces its history to at least 2,000 B.C.\n \n Philip Glass, in part through re-emphasizing the role of rhythm in his music (influenced by non-Western forms including Indian Raga) has created a uniquely affective music for opera [Einstein on the Beach (1976), Satyagraha (1982), Akhnaten (1984), The Making of the Representative for Planet 8 (1988) and Hydrogen Jukebox based on the poetry of Allen Ginsberg (1990)], film (Koyaanisqatsi, Mishima and The Thin Blue Line), ballet and concert hall.\n \n Peter Baumann, founder of Private Music (who had been a member of the Minimalist / Rock band Tangerine Dream and an admirer of all of the above), responded enthusiastically when the record company's President/CEO, Ron Goldstein, suggested in the summer of 1989, that they bring the now-famous Philip Glass back into musical contact with the ever expanding world of Ravi Shankar.\n \n Unlike previous Shankar &quot;collaborations&quot; (actually elaborate sessions with masters of other musical traditions joining Ravi to &quot;jam&quot; on his own music) the Glass encounter was rare instance of classical music reciprocity, each composer presenting thematic material to the other as raw material from which these finished pieces were fashioned. Passages contains four such co-ventures: two Glass compositions on themes by Shankar (Shankar / Glass); two Shankar compositions on themes by Glass (Glass / Shankar) as well as one piece from each composer completely of his own devising.\n \n <strong>CREDITS:</strong>\n Original music composed by Ravi Shankar and Philip Glass. Produced by Kurt Munkacsi, Ravi Shankar and Suresh Lalwani.\n \n Production Shankar: Recorded at Kodandapani Audio Lab Madras. Recorded by A. R. Swaminathan. Assisting Ravi Shankar in orchestration and arrangement: Suresh Lalwani. Conducted by Ashit Desai and Suresh Lalwani. Mixed by Michael Riesman and Suresh Lalwani.\n \n Musicians: Vocals Ravi Shankar and S.P. Balasubramanyam and the Madras Choir. Orchestral group from Madras. Soloists: Ronu Mazumdar, Flute; Shubho Shankar, Sitar; Partha Sarathy, Sarod; Partha Sarathy, Veena; T. Srinivasan, Mridangam &amp; Drum Speech; Abhiman Kaushal, Tabla.\n Production Glass: Music by Philip Glass. Produced by Kurt Munkacsi for Euphorbia Productions, Ltd., NYC. Conducted by Michael Riesman. Engineered by Blaise Dupuy. Assistant Engineers: Michael McGrath, Ramone Diaz. Recorded at The Living Room Studios, NYC. Executive Producer: Rory Johnston. Edited with Sound Tools by Digidesign.\n Musicians: Strings: Tim Baker Violin; Barry Finclair Violin, Viola; Mayuki Fukuhara Violin; Regis landiorio Violin; Karen Karlsud Violin; Sergiu Schwartz Violin; Masako Yanagita, Violin, Viola; Al Brown, Viola; Richard Sortomme, Viola; Seymour Barab, Cello; Beverly Laudrisen, Cello; Batia Lieberman, Cello; Fred Zlotkin, Cello; Joe Carver, Bass. Woodwinds: Theresa Norris, Flute; Jack Kripl, Flute, Soprano Saxophone; Jon Gibson, Soprano Saxophone; Richard Peck, Tenor, Alto Saxophone; Lenny Pickett, Tenor, Alto Saxophone. Brass: Peter Gordon, French Horn; Ron Sell, French Horn; Keith O'Quinn, Trombone; Alan Raph, Trombone. Gorden Gottleib: Percussion. Jeanie Gagne: Voice. Michael Riesman: Piano.\n \n Art Direction by Melanie Penny. Design by Candy Jernigan. Photography by Ebet Roberts.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Offering  After a slow introduction saxophone plays the Shankar raga melody, subsequently enriched by the two other saxes. A long middle section in quicker tempo treats the material more freely in several parts, concluded with a shorter recapitulation of the opening theme.  Review by Martin Perlich\n This historic collaboration brings full circle a process which began when promising young American musician Philip Glass met Indian master Ravi Shankar in Paris in 1965.", "published": "Thu, 19 Nov 2009 15:28:03 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Offering", "artist": {"url": "http://www.last.fm/music/Ravi+Shankar+and+Philip+Glass", "mbid": "", "name": "Ravi Shankar and Philip Glass"}, "url": "http://www.last.fm/music/Ravi+Shankar+and+Philip+Glass/_/Offering", "listeners": "26778", "toptags": {"tag": [{"url": "http://www.last.fm/tag/contemporary%20classical", "name": "contemporary classical"}, {"url": "http://www.last.fm/tag/classical", "name": "classical"}, {"url": "http://www.last.fm/tag/minimal", "name": "minimal"}, {"url": "http://www.last.fm/tag/minimalism", "name": "minimalism"}, {"url": "http://www.last.fm/tag/ethnic", "name": "ethnic"}]}, "mbid": "", "duration": "586000", "playcount": "66845", "id": "1250081"}}