{"track": {"album": {"@attr": {"position": "5"}, "title": "Artifakts (BC)", "url": "http://www.last.fm/music/Plastikman/Artifakts+(BC)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/47890749.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/47890749.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/47890749.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/47890749.jpg", "size": "extralarge"}], "artist": "Plastikman", "mbid": "97f4338f-99e7-435a-aa79-96560164f95b"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Rekall", "artist": {"url": "http://www.last.fm/music/Plastikman", "mbid": "abee98f6-5239-4abf-bbe6-e1e2815a0dd6", "name": "Plastikman"}, "url": "http://www.last.fm/music/Plastikman/_/Rekall", "listeners": "10606", "comments": ["BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM BOOM", "great development of the track...", "Amazing track!", "phänomenal", "I have an ear erection right now", "pretty good", "Nice!", "W O W", "see below, this is my forest soundtrack", "Yes!", "Richie you are great!", "Very nice, Herr Plastikman! Keep going!", "zyrotechira", "intelligent d&b taken to the next level", "it's a pleasure to know and have most of his musicproductions at home\r\n\r\noh my god  , i love mixing those tunes week by week", "sauber! :)", "I am an old, old man. I live in a bothy in a deep and relentless forest that is little visited. I now spendmost of my time looking at the trees, their shapes, and the sounds they make when moving and talking. I try not to survey what has brought me here, my previous life and loves, and the accumulation of small, distinct steps that didn't appear random at the time. My favourite moments are when the light starts to fade and lilac sunbeams orchestrate the tree-tops before dusk. I like the sound of these colours. This is my soundtrack.", "doctor hawtin.", "es buenisimo", "yeaaaaaahh"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/minimal", "name": "minimal"}, {"url": "http://www.last.fm/tag/minimal%20techno", "name": "minimal techno"}, {"url": "http://www.last.fm/tag/techno", "name": "techno"}, {"url": "http://www.last.fm/tag/zyrotechira", "name": "zyrotechira"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}]}, "mbid": "9f055656-c99d-4017-8952-d61563a70255", "duration": "647000", "playcount": "25945", "id": "7499"}}