{"track": {"album": {"@attr": {"position": "2"}, "title": "Straight Outta Compton", "url": "http://www.last.fm/music/N.W.A/Straight+Outta+Compton", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83812531.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83812531.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83812531.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83812531.jpg", "size": "extralarge"}], "artist": "N.W.A", "mbid": "75c33b4c-81c3-4cc5-ae83-cd146848b9d2"}, "wiki": {"content": "&quot;Fuck tha Police&quot; is a protest song by the gangsta rap group N.W.A on the album Straight Outta Compton. Despite not being a single, it ranked #417 on Rolling Stone's list of the 500 Greatest Songs of All Time.\n Fuck tha Police is a mock court scene, in which the &quot;Police Department&quot; is put on trial, with Ice Cube, MC Ren, and Eazy-E playing the role of the prosecution. Judge &quot;Dre&quot; is presiding and the trial is described as being &quot;N.W.A versus the police department&quot;. Rapped &quot;testimonies&quot; expressing anger at racism and police brutality in abrasive, violent language are delivered by Ice Cube, MC Ren, and Eazy-E; the following are examples of some of the most extreme lyrics in the song:\n \n Ice Cube:\n \n &quot;Fuck tha police comin straight from the underground\n A young nigga got it bad 'cause I'm brown\n I'm not the other color so police think\n They have the authority to kill a minority&quot;\n \n MC Ren:\n \n &quot;To the police I'm sayin fuck you punk\n Readin my rights and shit, it's all junk\n Pullin out a silly club, so you stand\n With a fake assed badge and a gun in your hand\n But take off the gun so you can see what's up\n And we'll go at it punk, and I'ma fuck you up&quot;\n \n Eazy-E:\n \n &quot;Without a gun and a badge, what do you got\n A sucker in a uniform waiting to get shot\n By me, or another nigga\n And with a gat it don't matter if he's smaller or bigger.&quot;\n \n At the end of the song, &quot;Judge Dre&quot; delivers the verdict: &quot;The jury has found you guilty of being a redneck, white bread, chickenshit motherfucker&quot; —— &quot;you&quot; referring to a police officer who represents the Los Angeles Police Department. The police officer's reaction is: &quot;But wait, that's a lie! That's a goddamn lie! I want justice! I want justice! Fuck you, you black motherfucker...!&quot; as he is apparently being dragged out of the courtroom.\n \n The song &quot;Fuck tha Police&quot;, containing N.W.A's trademark inflammatory lyrics, stood out in particular from many of the songs on Straight Outta Compton. It highlights many of the tensions between black urban youth and the police (widespread resentment towards the LAPD boiled over 3 years later, in the 1992 Los Angeles riots following the Rodney King incident). The song also alleged that minorities in the police department betrayed their race, with lyrics such as:\n \n &quot;And on the other hand, without a gun they can't get none\n But don't let it be a black and a white one\n Cause they'll slam ya down to the street top\n Black police showing out for the white cop&quot;\n \n Especially controversial were the areas of the song that appear to condone violence towards police authorities; lines such as &quot;I'm a sniper with a hell of a scope/Taking out a cop or two, they can't cope/with me&quot; and &quot;A sucka in a uniform waitin' to get shot/by me, or anotha nigga&quot; directly reference the murder of police officers. The FBI and the U.S. Secret Service sent a letter to Ruthless Records informing the label of their displeasure with the song's message, and N.W.A were banned from performing at several venues.\n \n The controversy around the single helped propel sales for the album and, ultimately, helped make it go double platinum.\n \n This song has proven popular enough to be covered by such acts as Bone Thugs-N-Harmony, as well as gaining popularity with rock bands, including Dope, Soulfly and Rage Against the Machine. This song was included on N.W.A's Greatest Hits.\n \n In 1989, Australian radio station Triple J had been playing &quot;Fuck tha Police&quot; for up to six months, before gaining the attention of Australian Broadcasting Corporation management who subsequently banned it. As a reaction the staff went on strike and put N.W.A's &quot;Express Yourself&quot; on continuous play for 24 hours, playing it roughly 360 times in a row. In 1996, during massive opposition street protests in Belgrade, Serbia &quot;Fuck tha Police&quot;, along with Public Enemy's &quot;Fight the Power&quot; was continually played for 2 days on a Belgrade radio station B92.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Fuck tha Police&quot; is a protest song by the gangsta rap group N.W.A on the album Straight Outta Compton. Despite not being a single, it ranked #417 on Rolling Stone's list of the 500 Greatest Songs of All Time.\n Fuck tha Police is a mock court scene, in which the &quot;Police Department&quot; is put on trial, with Ice Cube, MC Ren, and Eazy-E playing the role of the prosecution. Judge &quot;Dre&quot; is presiding and the trial is described as being &quot;N.W.A versus the police department&quot;.", "published": "Tue, 17 May 2011 17:29:47 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Fuck tha Police", "artist": {"url": "http://www.last.fm/music/N.W.A", "mbid": "3a54bffa-2314-44a2-927b-60144119c780", "name": "N.W.A"}, "url": "http://www.last.fm/music/N.W.A/_/Fuck+tha+Police", "listeners": "288445", "toptags": {"tag": [{"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "020b9192-fc12-4fee-8c84-d4957f72d637", "duration": "345000", "playcount": "821410", "id": "1267357"}}