{"track": {"album": {"@attr": {"position": "11"}, "title": "The Heist", "url": "http://www.last.fm/music/Macklemore+&+Ryan+Lewis/The+Heist", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90020109.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90020109.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90020109.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90020109.png", "size": "extralarge"}], "artist": "Macklemore & Ryan Lewis", "mbid": "a100f86e-ac89-4ced-98e9-799f4329622e"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Wing$", "artist": {"url": "http://www.last.fm/music/Macklemore+&+Ryan+Lewis", "mbid": "", "name": "Macklemore & Ryan Lewis"}, "url": "http://www.last.fm/music/Macklemore+&+Ryan+Lewis/_/Wing$", "listeners": "132672", "comments": ["Chyba jedna z lepszych piosenek Macklemora ;)", "amo", "I love the passion behind the words, it gets inside you and you can actually feel what it is he's saying, it's amazing.", ".. now I see it’s just another pair of shoes' \r\namazing <3", "Well said smokeandsex. This is an incredible song.", "They told me to just do it, I listened to what that SWOOSH SAID!", "Favorite. So perfect.", "wonderful.", "the sneaker thing is merely a specific example of a much larger root problem in society, but on an objective level it perfectly illuminates the absurdity and tragedy of a society valuing things we can hold versus things we can feel... the tangible, yet finite limitations of the material world versus the much more fulfilling, intangible, \"free\" sources of fulfillment that stem from human emotion, connectivity, and compassion. the things you can't buy or put a price tag on, which are the only things that can ultimately free us from the prison of materialism which creates prisoners of us all.", "i love the message of this song. i remember seeing a 1994 documentary called \"hoop dreams,\" it touched on so many different things (but primarily it showed the lives of two teens living in an inner-city area of illinois that were recruited to play high school basketball at a rich white school), but i remember it touched on nike/brand name basketball shoes as a status symbol for poor kids living in poverty. \n\nalso, the book \"michael jordon and the new global capitalism\" delves into this issue in great detail. that so much violence, including murder, has been perpetrated over expensive sneakers illuminates the tragedy of a society built upon capitalism, materialism, and object worship... and we have brainwashed (through media, culture, etc) children especially to place higher value on things like shoes rather than on human life."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/seattle", "name": "seattle"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/macklemore", "name": "macklemore"}]}, "mbid": "2281938c-37a2-428f-ad07-d6274246555d", "duration": "298000", "playcount": "718499", "id": "477906280"}}