{"track": {"album": {"@attr": {"position": "13"}, "title": "Get Rich Or Die Tryin (Edited Version)", "url": "http://www.last.fm/music/50+Cent/Get+Rich+Or+Die+Tryin+(Edited+Version)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82678159.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82678159.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82678159.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82678159.png", "size": "extralarge"}], "artist": "50 Cent", "mbid": ""}, "wiki": {"content": "&quot;21 Questions&quot; is a song performed by rapper 50 Cent. Nate Dogg, who gives additional vocals, is featured uncreditedly on the chorus and outro. The song was written by 50 Cent, K. Risto, J. Cameron, and V. Cameron for 50 Cent's commercial debut album Get Rich or Die Tryin' (2003). Released in 2003 as the album's second single, it became his second number one song in the United States after &quot;In Da Club&quot;. It reached number six in the UK Singles Chart while &quot;In Da Club&quot; was at #23, giving him the rare feat of having two singles in the Top 30 at the same time. The track was produced by Dirty Swift and Bruce Waynne of Midi Mafia and samples Barry White's &quot;It's Only Love Doing Its Thing&quot;. R&amp;B singer Lil' Mo created the answer-back remix titled &quot;21 Answers&quot;. Her version received decent airplay, and was often merged together with 50 Cent's version for club play.\n \n When producer Dr. Dre worked with 50 Cent on his debut album, he stated that he did not want the song on the album. According to 50 Cent, &quot;Dre was, like, 'How you goin' to be gangsta this and that and then put this sappy love song on?'&quot;[1] 50 Cent responded saying, &quot;I'm two people. I've always had to be two people since I was a kid, to get by. To me that's not diversity, it's necessity.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;21 Questions&quot; is a song performed by rapper 50 Cent. Nate Dogg, who gives additional vocals, is featured uncreditedly on the chorus and outro. The song was written by 50 Cent, K. Risto, J. Cameron, and V. Cameron for 50 Cent's commercial debut album Get Rich or Die Tryin' (2003). Released in 2003 as the album's second single, it became his second number one song in the United States after &quot;In Da Club&quot;.", "published": "Mon, 18 May 2009 18:16:22 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "21 Questions", "artist": {"url": "http://www.last.fm/music/50+Cent", "mbid": "8e68819d-71be-4e7d-b41d-f1df81b01d3f", "name": "50 Cent"}, "url": "http://www.last.fm/music/50+Cent/_/21+Questions", "listeners": "229370", "comments": ["Fuck yeah", "Hey my men:  Would you still have love for me & if I was down & out?  Probably not.  Nate Dogg will always be top Dogg.  50 went through hard times too as we all do on this earth.  We all have to coinside  I love everyone, I just don't have to like them. Lou", "its un edited   for me mmm weird", "yeah thats the only reason why I like this song but 50% or whatever can roll out! I dislike 50 and his snitching bitching ass", "edited version isn't for trve niggas", "<3", "Everything is amazing about this song.", "Better than his douchebag shit in his more recent album.", "I miss this kind of 50", "I remember when this first came out makes me feel old lol [2]", "If I was hit and I was hurt would you be by my side?? If it was time to put in work would you be down to ride??", "Nate       R.I.P.  my brother.", "RIP NATE DOGG", "Real song because most girls won't answer neither question because we know!", "<3", ":P", "yes", "i just can't explain how much i love this song, idk maybe it's cause it makes me feel incredible... \"i love u like a fat kid love cake\" lol ;-)", "R.I.P Nate dogg. have a blunt for me", "As corny as this song is, you gotta love it. R.I.P. Nate Dogg."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/50%20cent", "name": "50 cent"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/wjlb-fm", "name": "wjlb-fm"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "26e91130-723f-4005-9385-4e77e8734f80", "duration": "224000", "playcount": "729258", "id": "1173122"}}