{"track": {"streamable": {"#text": "1", "fulltrack": "0"}, "name": "Kenji", "artist": {"url": "http://www.last.fm/music/Fort+Minor", "mbid": "e1564e98-978b-4947-8698-f6fd6f8b0181", "name": "Fort Minor"}, "url": "http://www.last.fm/music/Fort+Minor/_/Kenji", "listeners": "214652", "comments": ["Hey, that fresssssh !!!! and new!! i like that it's smoooooth!!", "1,200,000*", "so you tell me how many deaths would you rather have 600,000 or a million?", "you people that says the japs din't deserve the bombings you are wrong they wern't going to surrender if we didn't drop the bombs 2x the people that died because of the bombs would have died", "we treated the enemy japs/nazis 50x better than they treated our troops", "Dig this tune.", "wake up people.  the world isnt fair and its not nice. sad story but ive heard and seen alot worse.", "so real", "Well ... Outside the camps, the Japanese in America during World War II did not think were very glad. So it is not the fact that they would have remained outside the safe. By analogy to the Jews in Nazi Germany, or the enemies of the people in the Soviet Union. Set against the people of the unwanted (=\r\nI apologize in advance for the English", "I can' believe America would even do this,making the Japanese leave. I blame those terrible Republican presidents that are paranoid as hell", "So powerful.. this is amazing. Nothing has changed, though, has it? Since the 2nd world war... innocent civilians are still dying in many parts of the world in the name of \"peace\" by cold-blooded leaders and soldiers thinking they're doing their people a favor.. protecting them from something.. but no one knows what this something is.", "I love this song and I love this story. It shows that we take what we have for granted. I could not imagine living this way. Sad story but it makes you open your eyes and your ears to the world.", "nah this is different to that man germans deserved everyting they got but the nucleur bombs were 2 far the japanese didnt do anything to deserve that even counting the shit they did to the thier prsoners yu kno....", "sad story... it's a high price the japanese and the german had/ have to pay because of the 2. world war, even if they haven't take part in it (hiroshima, nagasaki, hamburg, dresden)", "I remember hearing about this nasty period of American history from some elderly folk who lost everything when the Feds depopulated Bainbridge Island. And it makes me #$$#^ sick when people start advocating a repeat of this garbage with \"Muslims\" and \"Commies\"", "I love this song, I cry every time I hear the woman on it speak, because she sounds so much like my grandmother, who is also Japanese-American. \nBut to Sam_Paine, and everyone else who comments on the Japanese atrocities during World War II as a sick sort of justification for internment, you are missing the point. \nInternment was not hurtful to these people because they were Japanese, it hurt because they were American.", "EPIC! Love this song.", "I have shivers from this song. all of our rights is the government's lies and history proves this... \r\n\r\n[2]", "the lyrics of this song overwhelm me!", "Mike kenji shinoda yea"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/fort%20minor", "name": "fort minor"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/rapcore", "name": "rapcore"}]}, "mbid": "2724821c-df59-4db8-807f-3b2883f23864", "duration": "231000", "playcount": "924488", "id": "32459000"}}