{"track": {"album": {"@attr": {"position": "27"}, "title": "Renegades", "url": "http://www.last.fm/music/Eminem,+Jay-Z/Renegades", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/45784421.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/45784421.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/45784421.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/45784421.jpg", "size": "extralarge"}], "artist": "Eminem, Jay-Z", "mbid": ""}, "wiki": {"content": "&quot;3am&quot; is the second official single by American rapper Eminem from his upcoming album Relapse. The single was produced by Dr. Dre, along with most of the album, and was released on April 23, 2009 through Shade 45. The song was released onto the iTunes music store April 28, 2009. A music video has been shot, and was released on May 2 at 10:00pm via &quot;Cinemax&quot;\n \n The song deals with darker themes, pitting Eminem as a serial killer as he questions his own sanity and recalls various homicidal incidents. The song, according to Eminem, is said to be closer to the overall sound of the album, as opposed to the poppy, fun-poking &quot;We Made You&quot;. It features Eminem presumably rapping from the perspective of his alter ego Slim Shady, utilizing both internal and multi-syllabic rhyme schemes in his three verses.\n \n Eminem quotes a famous line from the movie, The Silence of the Lambs, - &quot;She puts the lotion in the bucket, it puts the lotion on the skin, or else she gets the hose again&quot;.[4] This is the third time Eminem uses a reference to The Silence of the Lambs, which was also referred to in the D12 song American Psycho from Devil's Night and the music video for &quot;You Don't Know&quot; from Eminem Presents: The Re-Up with Eminem being restrained in a similar trolley and muzzle to that of Hannibal Lecter's. Eminem also imitates Hannibal Lecter's trademark lip-licking motion to Jodie Foster when, in the beginning of the video, Eminem is visited at his cell by a female FBI Agent who looks similar to Foster's character in The Silence of the Lambs. References to Hannah Montana and Kim Kardashian are also made\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;3am&quot; is the second official single by American rapper Eminem from his upcoming album Relapse. The single was produced by Dr. Dre, along with most of the album, and was released on April 23, 2009 through Shade 45. The song was released onto the iTunes music store April 28, 2009. A music video has been shot, and was released on May 2 at 10:00pm via &quot;Cinemax&quot;  The song deals with darker themes, pitting Eminem as a serial killer as he questions his own sanity and recalls various homicidal incidents.", "published": "Fri, 8 May 2009 13:31:20 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "3AM", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/3AM", "listeners": "46125", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/detroit", "name": "detroit"}]}, "mbid": "", "duration": "106000", "playcount": "254894", "id": "302702845"}}