{"track": {"album": {"@attr": {"position": "8"}, "title": "Straight Outta Compton", "url": "http://www.last.fm/music/N.W.A/Straight+Outta+Compton", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83812531.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83812531.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83812531.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83812531.jpg", "size": "extralarge"}], "artist": "N.W.A", "mbid": "75c33b4c-81c3-4cc5-ae83-cd146848b9d2"}, "wiki": {"content": "&quot;Express Yourself&quot; is a song recorded by American hip hop group N.W.A. The song, off their 1988 album Straight Outta Compton, samples Charles Wright &amp; the Watts 103rd Street Rhythm Band's song of the same name. Unlike most songs on the album and by N.W.A, the song is almost devoid of profanity and violent content.\n \n The song's vocals are primarily handled by Dr. Dre though an extended version features interludes from Ice Cube and MC Ren.\n \n The song's lyrics center around ideas of free expression and the constraints placed on rappers by radio censorship. They also speak of the fact that other &quot;rappers&quot; are afraid to express themselves for fear of what other people might think and that they try to be like everyone else.\n \n This song is featured in the video games Grand Theft Auto: San Andreas, Tony Hawk Pro Skater 4, EA's Skate and in the movie Mr. &amp; Mrs. Smith. However, the version featured in Tony Hawk Pro Skater 4 is slightly different.\n \n In 1990 the Australian government youth radio station Triple J played the song on continuous loop for 24 hours (360 times in a row) whilst the station went on a protest strike against censorship. After playing NWA's &quot;Fuck tha Police&quot; for six months, government action had forced the station to stop playing the song. At that time Triple J had been the only station in the world playing the controversial song. Continuously playing the band's other popular song during this strike was deemed an appropriate response to show solidarity with the band and dissatisfaction with the decision.\n \n Between the Rancid releases of &quot;...And Out Come the Wolves&quot; and &quot;Life Won't Wait&quot; from 1995 to 1998, Tim Armstrong recorded a version of &quot;Express Yourself&quot; with the band The Silencers on the Life Won't Wait Demos. The first half of the demo consists of Rancid demos and the second half consists of The Silencers demos. Tim Armstrong also recorded a version of &quot;Express Yourself&quot; for &quot;Engage.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Express Yourself&quot; is a song recorded by American hip hop group N.W.A. The song, off their 1988 album Straight Outta Compton, samples Charles Wright &amp; the Watts 103rd Street Rhythm Band's song of the same name. Unlike most songs on the album and by N.W.A, the song is almost devoid of profanity and violent content.  The song's vocals are primarily handled by Dr. Dre though an extended version features interludes from Ice Cube and MC Ren.  ", "published": "Mon, 10 May 2010 18:28:14 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Express Yourself", "artist": {"url": "http://www.last.fm/music/N.W.A", "mbid": "3a54bffa-2314-44a2-927b-60144119c780", "name": "N.W.A"}, "url": "http://www.last.fm/music/N.W.A/_/Express+Yourself", "listeners": "193925", "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/old%20school", "name": "old school"}, {"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}]}, "mbid": "2dd8559b-5af1-446e-b8fb-33a8a0398513", "duration": "283000", "playcount": "729605", "id": "1327953"}}