{"track": {"album": {"@attr": {"position": "18"}, "title": "The Eminem Show", "url": "http://www.last.fm/music/Eminem/The+Eminem+Show", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88163203.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88163203.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88163203.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88163203.png", "size": "extralarge"}], "artist": "Eminem", "mbid": "40a7080b-40e4-3b24-847a-d21aaee5f414"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "My Dad's Gone Crazy", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/My+Dad%27s+Gone+Crazy", "listeners": "121596", "comments": ["last verse. that is all.", "raranaranaranaranaranaranaranaranarana and codeine", "he just fucking went crazy in the last verse, jesus christ", "SUCK IT MARSHALL.", "fuck that shit bitch", "Still my favorite Eminem song, though that's not saying a lot since I haven't really liked him in about a decade", "I THINK MY DAD'S GONE CRAAAZY", "love the cat meows instead of saying pussy! XD", "best lyrics ever", "He is his own man.  NO IMITATIONS.  ( just an opinion, from an old hippy....who just likes Eminem.......still.", "Yup. He's lyrics in this were sick. Even if you don't like his tone, you gotta give props to the skill.", "my songs can make you cry, take you by surprise and at the same time, make you dry your eyes with the same rhyme", "It's like my mother always told me: rana rana rana rana rana rana rana rana rana rana", "I remember hearing this in middle school once and never again. It's been too long.", "Yeah the 3rd verse is probably one of the best outro verses ever.", "I think my dads gone crazy!! Thats awesome my little girl says that all the time!", "@weirdfeline good idea;)", "Amazing song!", "There should be a part two... \"My Dad's Still Crazy?\"", "My songs can make you cry, take you by surprise\nAnd at the same time, make you dry your eyes with the same rhyme\nSee what you're seeing is a genius at work\nWhich to me isn't work, so it's easy to misinterpret it at first,\nCuz when i speak, it's tongue in cheek\nI'd yank my fuckin teeth before id ever bite my tongue\nI'd slice my gums, get struck by fuckin' lightning twice at once\nAnd die and come back as vanilla ice's son\nAnd walk around the rest of my life spit on\nAnd kicked and hit with shit, every time i sung\nLike R Kelly as soon as \"bump n' grind\" comes on\nMore pain inside of my brain, than the eyes of a little girl inside of a\nplane\nAimed at the World Trade, standin' on Ronnie's grave,\nScreaming at the sky, till clouds gather as Clyde Mathers and Bonnie Jade\nAnd thats pretty much the gist of it,Parents are pissed, but the kids love\nit\nNine millimeter, heater stashed, in two-seaters with meat cleavers\nI don't blame you, i wouldn't let hailie listen to me neither"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/psycho", "name": "psycho"}]}, "mbid": "2f91de98-e516-4d81-93dc-645fc6145630", "duration": "267000", "playcount": "472294", "id": "1322705"}}