{"track": {"streamable": {"#text": "0", "fulltrack": "0"}, "name": "Crew Love", "artist": {"url": "http://www.last.fm/music/Drake", "mbid": "7cf5af7a-afa0-4dca-9473-a13508c64e9d", "name": "Drake"}, "url": "http://www.last.fm/music/Drake/_/Crew+Love", "listeners": "136490", "comments": ["i used to hate this song; but. . .i have grown to like it. after understanding the meaning behind the track", "this song discovered the weeknd.\r\nloved this song when it came out. :)", "Big fan of this collabo.  Abel Tesfaye has yet to blow but his time is coming.  House of Balloons...classic!  Yup!...in my trey songz voice.", "amazing beat", "love it", "\" and this should really be The Weeknd feat. Drake.\" is this youtube?", "absolutely amazing track. one of the best to come out of 2011, any genre", "It doesn't matter how much the sung, if Drake made the song and they were called down to feature on it, it's still Drake's song. No matter if he sung 1 word, and they sung 500.", "They loving the crew", "@smackingas - The Weeknd, not The Weekend.", "you have to put drake's name as the main artist because most of you wouldn't have listened if it was the weekend's song", "The weeknd is pretty great on this. It must have been awesome to not only collaborate with this inspiration but also steal the show.", "Weeknd KILLS this-----Luv him and starting to really dislike Drake for not getting him to us faster.  ijs", "those Canadians really know how to sing", "drake should not even bother singing anymore after weeknd goes in on this shit, son look like amateur-hour next to em", "Accepting the fact that The Weeknd sung more in this, but this is featured on Drake's album. Therefore it's \"ft. Weeknd\".", "the weeknd >> drake [4] and this should really be The Weeknd feat. Drake.[2]", "the weeknd >> drake [3] and this should really be The Weeknd feat. Drake.", "the weeknd >> drake", "lov thiz"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/crew%20love", "name": "crew love"}, {"url": "http://www.last.fm/tag/featuring", "name": "featuring"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/canadian", "name": "canadian"}]}, "mbid": "", "duration": "209000", "playcount": "622538", "id": "545316348"}}