{"track": {"album": {"@attr": {"position": "2"}, "title": "The Chronic", "url": "http://www.last.fm/music/Dr.+Dre/The+Chronic", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87903127.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87903127.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87903127.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87903127.png", "size": "extralarge"}], "artist": "Dr. Dre", "mbid": "704e8225-4f0a-4795-a3ef-7df0c6073977"}, "wiki": {"content": "&quot;Fuck wit Dre Day (And Everybody's Celebratin')&quot; (released as &quot;Dre Day&quot;) is a hip-hop single by Dr. Dre, with a guest appearance by Snoop Doggy Dogg, from the 1992 album The Chronic on Death Row Records. The song was released as a single in 1993.\n \n The single failed to match the popularity of Dre's earlier hit, &quot;Nuthin' but a &quot;G&quot; Thang&quot;, although it did reach number eight on the U.S. Billboard Hot 100 chart in June 1993 and number six (counting the twelve weeks spent) on the rap/hip-hop chart on that year's overall ranking. The song features a slowed-down interpolation of Funkadelic's &quot;(Not Just) Knee Deep&quot; as its bassline and features Jewell on vocals and RBX on chorus.\n \n The song was a diss towards rappers Eazy-E, Dre's former accomplice; Tim Dog, an East Coast rapper who slighted the whole West Coast rap scene; and Luther (Luke) Campbell, whose track &quot;Fakin' Like Gangstas&quot; from his debut solo album I Got Shit On My Mind (featuring JT Money from the group Poison Clan) was taken personally for making references to some of the popular rappers in the &quot;gangsta&quot; category. Snoop Dogg later made peace between him and Luke in the song Hoez from Smokefest Underground. &quot;Fuck Wit' Dre Day&quot; has an accompanying music video directed by Dr. Dre.\n Eazy-E retaliated on his next album It's On (Dr. Dre) 187um Killa which contained the song &quot;Real Muthaphuckkin G's&quot;, on which he makes fun of Dr. Dre, Snoop Dogg (calling them &quot;studio gangstas&quot;), and Death Row Records.\n \n Tim Dog responded with &quot;Dog Baby&quot; and &quot;Bitch with a Perm&quot; — two tracks directed at Snoop Dogg. Tim Dog was angry at Snoop for his 2nd verse and line &quot;Tim Dog can eat a big fat dick&quot; at the end of the song, as well as the representation of the lines &quot;Fuck me in the ass!&quot; and &quot;Step to me and let me suck your dick!&quot; as &quot;things that Tim Dog would say&quot; in the skit track, &quot;The $20 Sack Pyramid&quot;.\n \n Luther Campbell along with JT Money and then-upcoming artist Clayvoisie responded with the song &quot;Cowards in Compton&quot; (from Luke's second solo LP, In The Nude) and its accompanying video that parodied Dre's original premise as a member of the mid-1980s rap group World Class Wreckin' Cru. On which Tweedy Bird Loc dissed Luther on &quot;Fucc Miami&quot; including &quot;Tha Shiznit&quot; where Snoop retaliated.\n \n &quot;Fuck Wit' Dre Day&quot; was included as a single for the video game Grand Theft Auto: San Andreas, playing on West Coast hip hop radio station Radio Los Santos.\n \n Snoop Dogg used and originated the word &quot;bootylicious&quot; in this song almost a decade before the 2001 single of that name by Destiny's Child. However, in this song it means &quot;bad&quot; or &quot;weak&quot;; that is far different from the meaning Beyoncé Knowles gave it in her group's hit, which the Oxford English Dictionary Online used when it added &quot;bootylicious&quot; in 2004.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Fuck wit Dre Day (And Everybody's Celebratin')&quot; (released as &quot;Dre Day&quot;) is a hip-hop single by Dr. Dre, with a guest appearance by Snoop Doggy Dogg, from the 1992 album The Chronic on Death Row Records. The song was released as a single in 1993.  The single failed to match the popularity of Dre's earlier hit, &quot;Nuthin' but a &quot;G&quot; Thang&quot;, although it did reach number eight on the U.S. Billboard Hot 100 chart in June 1993 and number six (counting the twelve weeks spent) on the rap/hip-hop chart on that year's overall ranking.", "published": "Sat, 30 May 2009 13:56:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Fuck Wit Dre Day (And Everybody's Celebratin')", "artist": {"url": "http://www.last.fm/music/Dr.+Dre", "mbid": "5f6ab597-f57a-40da-be9e-adad48708203", "name": "Dr. Dre"}, "url": "http://www.last.fm/music/Dr.+Dre/_/Fuck+Wit+Dre+Day+(And+Everybody%27s+Celebratin%27)", "listeners": "64217", "comments": ["Third verse synths ftw hahahaha.  I think Dre was playing around with his mix and it was like one of those things where you could click a button and hide it if you want to (Like a Photoshop layer) and he just forgot to take them out of the final recording and then it was just too late.", "its gap teeth in your mouth so my dicks got to fit", "Great song, but I can't help but feel \"You got teeth in your mouth so my dick's got to fit\" is one of the stupidest lyrics I've ever heard.", "It's Dre Day", "Bow wow wow yippy yo yippy yay, Doggy Dogg's in the motherfuckin house / Bow wow wow yippy yo yippy yay, Death Row's in the motherfuckin house", "heard it on USA top 20 back'n tha days... check out the poorly played random synths in the 3rd verse, biatch", "sick song, but the weird synthie in the background cracks me up everytime i hear it.", "Reminds me of playing GTA: San Andreas every single day while listetning to Radio Los Santos, hehehe. One of my fav songs ever.", "love this shit", "But here's a jimmy joke about your mama that you might not like\nI heard she was the 'Frisco dyke", "Easy-E can eat big fat diiiiick", "miss this shit.", "Dr Dre !", "WAY BETTER QUALITY\r\nhttp://www.youtube.com/watch?v=IjInWI0pows", "stompin on the 'Eazy'est streets that you can walk on, haha love this song", "\"Used to be my homie, used to be my ace now i wanna slap the taste out your mouth\" Damn thats a great verse", "The songs where Eazy and Dre went down on each other were Hardcore.", "Jewell sounds so good on this. <3", "bow wow wow yippy yo yippy yay.. doggy dogg's in the muthafuckin' house..", "But here's a jimmy joke about your mama that you might not like"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}, {"url": "http://www.last.fm/tag/g-funk", "name": "g-funk"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "3681e10c-2e36-43bc-b974-64de5051694f", "duration": "154000", "playcount": "283541", "id": "1418712"}}