{"track": {"album": {"@attr": {"position": "9"}, "title": "The Eminem Show", "url": "http://www.last.fm/music/Eminem/The+Eminem+Show", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88163203.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88163203.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88163203.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88163203.png", "size": "extralarge"}], "artist": "Eminem", "mbid": "40a7080b-40e4-3b24-847a-d21aaee5f414"}, "wiki": {"content": "The song was Eminem's return after the successful The Marshall Mathers LP, intended as a sequel to &quot;The Real Slim Shady&quot; and essentially saying that he is back to save the world. It also refers to Eminem's role in the music industry and his cultural effects.\n \n The song mocks a number of Eminem's critics, including Dick Cheney and his wife Lynne Cheney, the FCC and MTV, Chris Kirkpatrick, as well as lampooning comparisons of Eminem to Elvis Presley as a Caucasian succeeding commercially in a predominantly African-American art form. A line in the song also attacks his own mother Debbie Mathers for the lawsuit she filed against him for the lyrics of his debut single &quot;My Name Is&quot;.\n \n The opening lyric &quot;Two trailer park girls go round the outside&quot; is based on the single &quot;Buffalo Gals&quot; by Malcolm McLaren, while the introduction which is spoken by Obie Trice &quot;Obie Trice, real name no gimmicks.&quot; is sampled from his own track &quot;Rap Name&quot;. The round the outside lyric could be considered a subliminal diss to Canibus, who used a similar line in Box Cutta Blade Runna, released on &quot;C! True Hollywood Stories&quot; which makes numerous disses against Eminem.\n \n A sample from the track, the phrase &quot;nobody listens to techno&quot;, became an underground techno bootleg anthem produced by Deep Dish and Danny Howells under the alias Size DDD (Deep Dish Danny). The song was played by many well-known DJs to satirize the claim. The song was also parodied on All That, a skit show on Nickelodeon, as &quot;Without Meat&quot;. It was also parodied on MADtv, a skit show on FOX, as &quot;Whats on TV?&quot;. In the second verse a line samples the intro from &quot;The Real Slim Shady&quot;.\n \n The background saxophone riff was sampled for Drunkenmunky's 2002 club hit &quot;E&quot; (help·info).\n \n Some of the lyrics are altered on the clean version, such as &quot;This is about to get heavy&quot; also &quot;Jiggle your hips&quot; is placed to get rid of a sexually explicit remark in the 1st verse.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The song was Eminem's return after the successful The Marshall Mathers LP, intended as a sequel to &quot;The Real Slim Shady&quot; and essentially saying that he is back to save the world. It also refers to Eminem's role in the music industry and his cultural effects.  The song mocks a number of Eminem's critics, including Dick Cheney and his wife Lynne Cheney, the FCC and MTV, Chris Kirkpatrick, as well as lampooning comparisons of Eminem to Elvis Presley as a Caucasian succeeding commercially in a predominantly African-American art form.", "published": "Fri, 1 May 2009 01:41:41 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Without Me", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Without+Me", "listeners": "555598", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/00s", "name": "00s"}]}, "mbid": "", "duration": "290000", "playcount": "2630845", "id": "1020788"}}