{"track": {"streamable": {"#text": "0", "fulltrack": "0"}, "name": "Diamonds from Sierra Leone (Remix) (feat. Jay-Z)", "artist": {"url": "http://www.last.fm/music/Kanye+West", "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051", "name": "Kanye West"}, "url": "http://www.last.fm/music/Kanye+West/_/Diamonds+from+Sierra+Leone+(Remix)+(feat.+Jay-Z)", "listeners": "91667", "comments": ["I ain't a business man, I'm a BUSINESS, MANNN! [2]", "i'm not a businessman i'm a business, man", "I always skip Kanye's first half and go straight to Jay takin over the song, YASSSSS", "I ain't a business man, I'm a BUSINESS, MANNN!", "foreva eva foreva eva", "this reminds me of the time i was in Prague .", "So much better with Jay-z", "That forever ever etc part is an homage to Ms. Jackson by Outkast.", "The darkest track, but I love it.", "im not a businessman, im a business, man [6]", "FOREVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER EVER.", "Jay-z ruined this song. Could we have one mainstream rap some about something other then J's ego???", "Amaaazzzzinggggg when the beat starts on the song.", "is they jacob's don't lie to me mayne (2)", "sick <3", "jay dropped some fire here..", "im not a businessman, im a business, man [5]", "im not a businessman, im a business, man [4]", "Jay-Z just made this song even hotter", "im not a businessman, im a business, man [3]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/kanye%20west", "name": "kanye west"}, {"url": "http://www.last.fm/tag/remix", "name": "remix"}]}, "mbid": "", "duration": "233000", "playcount": "401451", "id": "22534465"}}