{"track": {"album": {"@attr": {"position": "12"}, "title": "A Beautiful Mind", "url": "http://www.last.fm/music/Eminem/A+Beautiful+Mind", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/86009727.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/86009727.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/86009727.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/86009727.png", "size": "extralarge"}], "artist": "Eminem", "mbid": "875f24ae-c4f3-45a9-9b95-67013b875524"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Music Box", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Music+Box", "listeners": "32702", "comments": ["Might be the best song from Relapse", "you are right segoran", "this song is sick, the best on Refill. [3]", "The third verse on this track is fucking insane! [2]", "bass D:", "MY MUSIC BAWKS", "The third verse on this track is fucking insane! \"Slip in through the crack, leavin' the corpse drippin'. The mortician of love sent from above. Forced entry; the more wenchy, the more stingy I become. Been doin' this for more than a quarter century, I'm just numb. Am I dreamin', is it real? Someone pinch me on the buns. The time has come to tie her up, got to roll me the ladder. I've had enough of the chatter. Climb up to the window; look at her and climb in and slowly shatter her brain matter and batter her with the bat. A matter of fact that will splatter her. But before I do that, I'll have a chat to flatter her; give her two compliments, back-to-back, like \"Tabatha! I'm your secret admirer, I'm back to ravish ya. So strong is your fight, but you're no match for Dracula.\" Prolonging her plight as I go back to stabbin' her. Dismember her limbs, simple as that, cadaver her. Zoom in with the lens, then pan back the camera. Stand back, 'cause here comes your man Jack, so Pamela...\"", "this song is sick, the best on Refill.  [2]", "this song is sick, the best on Refill.", "It would be that much better without this annoying \"My Music Box\" :/", "better than all the crap on his new album", "crazy", "sick", "BLACK OUT TO DIS BANGA RIGHT HEYAAAAA!  I also agree that his voice sounds really weird in the chorus . . . dunno why.", "MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX MY MUSIC BOX", "that not bad i stell like his old ones bc this good 2", "He's back", "Such a crazy flow. :) Genius! :)", "i absolutely ADORE this song. *___*", "Greates song that is on every relapse!\r\n\r\nwondering  why it didn't get more popular.."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/dr%20dre", "name": "dr dre"}, {"url": "http://www.last.fm/tag/lyricists", "name": "lyricists"}]}, "mbid": "738389f8-8ed9-463c-9022-5ff0d656c556", "duration": "305000", "playcount": "196971", "id": "365717909"}}