{"track": {"album": {"@attr": {"position": "1"}, "title": "To The Extreme", "url": "http://www.last.fm/music/Vanilla+Ice/To+The+Extreme", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/61068117.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/61068117.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/61068117.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/61068117.jpg", "size": "extralarge"}], "artist": "Vanilla Ice", "mbid": "ae103b0a-b932-4009-acb6-388db1cf890b"}, "wiki": {"content": "&quot;Ice Ice Baby&quot; is a hip hop song written by American  rapper  Vanilla Ice and DJ Earthquake. The song samples the bassline  of &quot;Under Pressure&quot; by Queen and David Bowie, who did not initially receive songwriting credit or royalties until after it had become a hit. Originally released on Van Winkle's 1989 debut album Hooked and later on his 1990 national debut To the Extreme, it is his most famous and popular song. It has appeared in remixed form on Platinum Underground and Vanilla Ice Is Back! A live version appears on the album Extremely Live, while a rap rock  version appears on the album Hard to Swallow, under the title &quot;Too Cold&quot;.\n \n &quot;Ice Ice Baby&quot; was initially released as the B-side to Van Winkle's cover of &quot;Play That Funky Music&quot;, but the single was not initially successful. When a disc jockey played &quot;Ice Ice Baby&quot; instead, it began to gain success. &quot;Ice Ice Baby&quot; was the first hip hop single to top the Billboard charts. Topping the Australian, Dutch, Irish, Italian and UK charts, the song helped diversify hip hop by introducing it to a mainstream audience.\n \n Robert Van Winkle, better known by his stage name Vanilla Ice, wrote &quot;Ice Ice Baby&quot; at the age of 16, basing its lyrics upon his experiences in South Florida.  The lyrics describe a drive-by shooting and Van Winkle's rhyming skills.  The chorus of &quot;Ice Ice Baby&quot; originates from the signature chant of the national African American fraternity Alpha Phi Alpha.  Of the song's lyrics, Van Winkle states that &quot;If you released 'Ice Ice Baby' today, it would fit in today's lyrical respect among peers, you know what I'm sayin'? My lyrics aren't, 'Pump it up, go! Go!' At least I'm sayin' somethin'.&quot;\n \n The song's hook samples the bassline of the 1981 song &quot;Under Pressure&quot; by Queen and David Bowie.Freddie Mercury and David Bowie did not receive credit or royalties for the sample. In a 1990 interview, Van Winkle said the two melodies were slightly different because he had added an additional note. In later interviews, Van Winkle readily admitted he sampled the song and claimed his 1990 statement was a joke; others, however, suggested he had been serious. Van Winkle later paid Mercury and Bowie, who have since been given songwriting credit for the sample. In December 1990, Van Winkle told Smash Hits magazine where he came up with the idea of sampling &quot;Under Pressure&quot;:\n \n “ \tThe way I do stuff is to go through old records that my brother has. He used to listen to rock 'n' roll and stuff like that. I listened to funk and hip hop because rock wasn't really my era. But having a brother like that, well, I just mixed the two, and he had a copy of 'Under Pressure'. And putting those sounds to hip hop was great.\t”\n \n Van Winkle described himself as the first rapper to cross into the pop market, and said as a result he &quot;had to take the heat for a lot of people&quot; for his music's use of samples, but the criticism he received over sample use allowed sampling to become acceptable in mainstream hip hop.\n [edit] Release\n \t\n \n &quot;Ice Ice Baby&quot; was initially released by Ichiban Records as the B-side to Van Winkle's cover of &quot;Play That Funky Music&quot;. The 12-inch single featured the radio, instrumental and a cappella versions of &quot;Play That Funky Music&quot; and the radio version and &quot;Miami Drop&quot; remix of &quot;Ice Ice Baby&quot;. When a disc jockey played &quot;Ice Ice Baby&quot; instead of the single's A-side, the song gained more success than &quot;Play That Funky Music&quot;. A music video for &quot;Ice Ice Baby&quot; was produced for $8000.  The video was financed by Van Winkle's manager, Tommy Quon, and shot on the roof of a warehouse in Dallas, Texas.  In the video, Van Winkle is shown rapping the lyrics while he and others dance to the song. Heavy airplay of the video by The Box while Van Winkle was still unknown increased public interest in the song.  &quot;Ice Ice Baby&quot; was given its own single, released in 1990 by SBK Records in the United States, and EMI Records in the United Kingdom. The SBK single contained the &quot;Miami Drop&quot;, instrumental and radio mixes of &quot;Ice Ice Baby&quot; and the album version of &quot;It's A Party&quot;. The EMI single contained the club and radio mixes of the song, and the shortened radio edit.The single was quickly pulled from the American market soon after the song reached number one, in a successful attempt to drive consumers to buy the album instead.\n \n Reception\n \n &quot;Ice Ice Baby&quot; was the first hip hop single to top the Billboard charts. It has been credited for helping diversify hip hop by introducing it to a mainstream (not exclusively black) audience.\n \n Entertainment Weekly reviewer Mim Udovitch wrote that &quot;[Vanilla Ice] probably would have scored with his hit rap single 'Ice Ice Baby' even if he hadn't been white. There's just something about the way its hook — a sample from Queen and David Bowie's 'Under Pressure' — grabs you and flings you out onto the dance floor.&quot;\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ice Ice Baby&quot; is a hip hop song written by American  rapper  Vanilla Ice and DJ Earthquake. The song samples the bassline  of &quot;Under Pressure&quot; by Queen and David Bowie, who did not initially receive songwriting credit or royalties until after it had become a hit. Originally released on Van Winkle's 1989 debut album Hooked and later on his 1990 national debut To the Extreme, it is his most famous and popular song.", "published": "Fri, 19 Feb 2010 22:28:02 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ice Ice Baby", "artist": {"url": "http://www.last.fm/music/Vanilla+Ice", "mbid": "2d5583be-aafd-41ec-addd-df85913855ef", "name": "Vanilla Ice"}, "url": "http://www.last.fm/music/Vanilla+Ice/_/Ice+Ice+Baby", "listeners": "301515", "comments": ["icetastic", "Please delete yourself.  Thank you.", "omg, bike ridding to this is absoluttly awsome.", "Please delete this. I beg of you.", "ew", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK", "Хитище на все времена!!!", "yeah... this remix is pretty lousy, it would sound better to the music of supersonic by JJ FAD.", "classic !", "SO BAD THAT IT'S GOOD .", "Official video: http://www.youtube.com/watch?v=rog8ou-ZepE", "♫ ◕ ‿ ◕ ♪ * ♥¸.•´¸.•*´¨)  timeLESS ¸.•*¨) .•` * ♥ .•*¨*•", "Killed a perfectly good song....  -_-", "The fuck..", "the hell is this version?", "Britney :P", "what version is this?", "if music had a sense of smell this song would smell like shit", "classic", "ice ice baby is cool"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/old%20school", "name": "old school"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "78c78c0c-4c3f-455e-88a0-ca5556ab46d3", "duration": "250000", "playcount": "971655", "id": "1012443"}}