{"track": {"wiki": {"content": "&quot;Dark Fantasy&quot; is a song by American hip hop recording artist Kanye West from his fifth studio album, My Beautiful Dark Twisted Fantasy (2010). The song serves as the opening track of the album, and was written by West, Ernest Wilson, Jeff Bhasker, Mike Dean and Robert Diggs. It features an opening narrative delivered by rapper Nicki Minaj, and singers Teyana Taylor and Justin Vernon contribute to the song's hook and provide background vocals. The track is built around a sample of &quot;In High Places&quot; by Mike Oldfield. The song introduces several of the themes presented on the album and features numerous pop culture references, a gospel-inspired production style, and piano-driven composition. The song received mostly positive reviews from music critics, who generally praised the song as a strong opener to My Beautiful Dark Twisted Fantasy, complimenting West's vocal delivery and the song's production.\n \n Despite not being released as a single, the hype generated by the release of My Beautiful Dark Twisted Fantasy caused the song to enter the Billboard Hot 100 at position 60. It was the opening song of West's 2011 setlist at the Coachella Music Festival, and was performed with Taylor at the 'Vevo Presents GOOD Music' musical venue. &quot;Dark Fantasy&quot; was utilized during the opening sequence of West's short film Runaway, during an extended scene with West driving down an atmospheric forest.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Dark Fantasy&quot; is a song by American hip hop recording artist Kanye West from his fifth studio album, My Beautiful Dark Twisted Fantasy (2010). The song serves as the opening track of the album, and was written by West, Ernest Wilson, Jeff Bhasker, Mike Dean and Robert Diggs. It features an opening narrative delivered by rapper Nicki Minaj, and singers Teyana Taylor and Justin Vernon contribute to the song's hook and provide background vocals.", "published": "Sun, 14 Apr 2013 07:33:03 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Dark Fantasy", "artist": {"url": "http://www.last.fm/music/Kanye+West", "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051", "name": "Kanye West"}, "url": "http://www.last.fm/music/Kanye+West/_/Dark+Fantasy", "listeners": "372066", "comments": ["Criminally underrated.", "so good i could actually cry  (2)", "Wu Tang Beat !", "CAN WE GET MUCH HIGHER?", "I luv it", "so good i could actually cry", "I'm just a Chi town nigga wit' a Nas flow.", "Bad ass beat.", "You're 17 Heester, go back to /mu/", "Ooky booky goo-goo.", "CAN WE GET MUCH HIGHER?", "perfection.", ">liking nicki minaj\n\nAre you thirteen?", "Nicki ♥", "god i want to make this song begin after nicki minaj", "Can we!?", "Flawless album.", "YOU AIN'T GOT NO YEEZY NIGGA?!?", "let's stop talking about nicki minaj and start talking about how RZA kills on this [5]", "Me found bravery in my Bravado"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/kanye%20west", "name": "kanye west"}, {"url": "http://www.last.fm/tag/2010", "name": "2010"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "885ccb38-4057-4d1a-8fb0-52804f79d653", "duration": "281000", "playcount": "2279876", "id": "425822560"}}