{"track": {"album": {"@attr": {"position": "7"}, "title": "The Massacre (re-issue)", "url": "http://www.last.fm/music/50+Cent/The+Massacre+(re-issue)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91401659.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91401659.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91401659.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91401659.jpg", "size": "extralarge"}], "artist": "50 Cent", "mbid": ""}, "wiki": {"content": "&quot;Candy Shop&quot; is the 2nd single by rapper 50 Cent and R&amp;B singer Olivia. The song was written by 50 Cent and Scott Storch for 50 Cent's second commercial album The Massacre (2005). Scott Storch, who also produced the track, took influence from Middle Eastern music.\n \n The song was released as the album's second domestic single, and first international single. It was one of the year's most popular songs, peaking inside the top ten on the majority of the charts it entered. &quot;Candy Shop&quot; received mixed reviews from critics, with some calling it a retread of 50 Cent's previous collaboration with Lil' Kim on &quot;Magic Stick&quot;.\n \n In an interview with XXL magazine, rapper Fat Joe claimed that he helped produce the track while working with Scott Storch. He stated: &quot;I'm pretty sure the world don't know we actually produced Candy Shop together. I produced it with him (Storch)... Scott called me like 50 times, 100 times: 'Yo, you sure you don't want to use it? 50 Cent called me. 50 Cent want it.' I never had a problem with this dude. I was like, 'Go ahead.'&quot; When writing the song, 50 Cent stated: &quot;I attempted to be as sexual as possible, from a male perspective, without being vulgar or obscene&quot;.\n \n &quot;Candy Shop&quot; is a mid-tempo dancefloor track. The song, which was officially produced by Scott Storch, samples The Salsoul Orchestra's &quot;Love Break&quot;. The production was described by IGN as having a &quot;Middle Eastern tinge&quot; with synthesized strings that &quot;unleash a darkly atonal whirl that sounds too much like something either Timbaland or The Neptunes or Mannie Fresh have concocted&quot;. The Guardian also wrote that the production contains &quot;wan-sounding imitations of the Neptunes' sparse, breathy funk&quot;. PopMatters described the chorus as being &quot;relaxed yet faintly ominous&quot; with 50 Cent and Olivia crooning: &quot;Girl what we do (what we do) / And where we do (and where we do) / The things we do (things we do) / Are just between me and you (oh yeah).&quot;[9] Rolling Stone also noted the chorus for 50 Cent's &quot;amateur-sounding tenor croon&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Candy Shop&quot; is the 2nd single by rapper 50 Cent and R&amp;B singer Olivia. The song was written by 50 Cent and Scott Storch for 50 Cent's second commercial album The Massacre (2005). Scott Storch, who also produced the track, took influence from Middle Eastern music.  The song was released as the album's second domestic single, and first international single. It was one of the year's most popular songs, peaking inside the top ten on the majority of the charts it entered.", "published": "Mon, 18 May 2009 18:19:19 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Candy Shop", "artist": {"url": "http://www.last.fm/music/50+Cent", "mbid": "8e68819d-71be-4e7d-b41d-f1df81b01d3f", "name": "50 Cent"}, "url": "http://www.last.fm/music/50+Cent/_/Candy+Shop", "listeners": "528317", "comments": ["never gets old!!!!", "hino", "lol", "This was my favorite song when I was 10.", "sweet", "brilliant", "so sexy", "i love candy....no homo", "nice", "great song", "so sedutive", "So seductive...", "nice", "The candy shop is closed for today sorry 50", "Oh take me to the Candy Shop! Hmmm... I haven't heard any news about 50 cent... I wonder why.", "you want to taste what i got oooo yaaaa", "i've got the magic stick", "I'm sorry, but If a black guy said that he was gonna take me to the candy shop...I'd be quite scared :P", "no", "Lovvvvvvvvvve this!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/50%20cent", "name": "50 cent"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}]}, "mbid": "9c450565-8bfb-4911-84c3-35ca2218fc49", "duration": "260000", "playcount": "1595523", "id": "12053294"}}