{"track": {"album": {"@attr": {"position": "15"}, "title": "Signed, sealed, delivered/ Kanal 24", "url": "http://www.last.fm/music/Diverse+Artister/Signed,+sealed,+delivered%2F+Kanal+24", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/67054022.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/67054022.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/67054022.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/67054022.jpg", "size": "extralarge"}], "artist": "Diverse Artister", "mbid": ""}, "wiki": {"content": "From the soundtrack of the 1994 film Above the Rim.  Won MTV Movie award for Best Song in 1995.\n \n On a cool, clear night (typical to Southern California) Warren G travels through his neighborhood, searching for women with whom he might initiate sexual congress. He has chosen to engage in this pursuit alone.\n \n Nate Dogg, having just arrived in the east side of Long Beach, seeks Warren. On his way to find Warren, Nate passes a car full of women who are excited to see him. Regardless, he insists to the women that there is no cause for excitement.\n \n Warren makes a left turn at 21st Street and Lewis Ave, in the East Hill/Salt Lake neighborhood, where he sees a group of young men enjoying a game of dice together. He parks his car and greets them. He is excited to find people to play with, but to his chagrin, he discovers they intend to relieve him of his material possessions. Once the hopeful robbers reveal their firearms, Warren realizes he is in a less than favorable predicament.\n \n Meanwhile, Nate passes the women, as they are low on his list of priorities. His primary concern is locating Warren. After curtly casting away the strumpets (whose interest in Nate was such that they crashed their automobile), he serendipitously stumbles upon his friend, Warren G, being held up by the young miscreants.\n \n Warren, unaware that Nate is surreptitiously observing the scene unfold, is in disbelief that he is being robbed. The perpetrators have taken jewelry and a Rolex Watch from Warren, who is so incredulous that he asks what else the robbers intend to steal. This is most likely a rhetorical question.\n \n Observing these unfortunate proceedings, Nate realizes that he may have to use his firearm to deliver his friend from harm.\n \n The tension crescendos as the robbers point their guns to Warren's head. Warren senses the gravity of his situation. He cannot believe the events unfolding could happen in his own neighborhood. As he imagines himself making a fantastical escape, he catches a glimpse of his friend, Nate.\n \n Nate has seventeen cartridges (sixteen residing in the pistol's magazine, with a solitary round placed in the chamber and ready to be fired) to expend on the group of robbers. Afterward, he generously shares the credit for neutralizing the situation with Warren, though it is clear that Nate did all of the difficult work. Putting congratulations aside, Nate quickly reminds himself that he has committed multiple homicides to save Warren before letting his friend know that there are females nearby if he wishes to fornicate with them.\n \n Warren recalls that it was the promise of copulation that coaxed him away from his previous activities, and is thankful that Nate knows a way to satisfy these urges. Nate quickly finds the women who earlier crashed their car on Nate's account. He remarks to one that he is fond of her physical appeal. The woman, impressed by Nate's singing ability, asks that he and Warren allow her and her friends to share transportation. Soon, both friends are driving with automobiles full of women to the East Side Motel, presumably to consummate their flirtation in an orgy.\n \n The third verse is more expository, with Warren and Nate explaining their G Funk musical style. Warren displays his bravado by daring anyone to approach the style. There follows a brief discussion of the genre's musicological features, with special care taken to point out that in said milieu the rhythm is not in fact the rhythm, as one might assume, but actually the bass. Similarly the bass serves a purpose closer to that which the treble would in more traditional musical forms. Nate displays his bravado by claiming that individuals with equivalent knowledge could not even attempt to approach his level of lyrical mastery. Nate goes on to note that if any third party smokes as he does, they would find themselves in a state of intoxication almost daily (from Nate's other works, it can be inferred that the substance referenced is marijuana). Nate concludes his delineation of the night by issuing a threat to &quot;busters,&quot; suggesting that he and Warren will further &quot;regulate&quot; any potential incidents in the future (presumably by engaging their antagonists with small arms fire).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "From the soundtrack of the 1994 film Above the Rim.  Won MTV Movie award for Best Song in 1995.  On a cool, clear night (typical to Southern California) Warren G travels through his neighborhood, searching for women with whom he might initiate sexual congress. He has chosen to engage in this pursuit alone.  Nate Dogg, having just arrived in the east side of Long Beach, seeks Warren. On his way to find Warren, Nate passes a car full of women who are excited to see him. Regardless, he insists to the women that there is no cause for excitement. ", "published": "Sat, 16 Feb 2013 17:16:54 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Regulate", "artist": {"url": "http://www.last.fm/music/Warren+G", "mbid": "6b6e8683-158a-47f8-b2e3-0148998cdcbb", "name": "Warren G"}, "url": "http://www.last.fm/music/Warren+G/_/Regulate", "listeners": "328189", "comments": ["Young Guns.", "This sound is like a drug, highly addictive.", "One of the greatest Hip Hop songs of all time!", "the pinnacle of g-funk", "</3", "16 in the clip and one in the hole, Nate Dogg is about to make some bodies turn cold... [2] maybe my favorite G-Funk moment", "Ha, ha! The wiki to this song is hilarious.", "IF YA SMOKE LIKE I SMOKE THEN YA HIGH LIKE EVERYDAY", "Awesome song heard it on pandora", "16 in the clip and one in the hole, Nate Dogg is about to make some bodies turn cold...", "HELo", "It's the G-Funk era, funked out with a gangsta twist! Amazing song!", "Love this song foreverrrrrrrr", "WARREN & NATE! YEA YEA", "Classic!", "I forgot about this song!! What a tune!", "Regulate the 719", "LBC", "sweet bassline <3", "Love this song forever! :)"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/g-funk", "name": "g-funk"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "aafd3a37-1dc8-4664-adef-987ea6c8700a", "duration": "250000", "playcount": "1220396", "id": "17458"}}