{"track": {"album": {"@attr": {"position": "3"}, "title": "Aquemini", "url": "http://www.last.fm/music/Outkast/Aquemini", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88033029.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88033029.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88033029.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88033029.png", "size": "extralarge"}], "artist": "Outkast", "mbid": "06438d71-3a7d-3f41-9338-3dc08351e19f"}, "wiki": {"content": "Interestingly, this track ended up in court with Mrs. Rosa Parks herself suing OutKast and their label for false advertising.  Because it came to the 6th circuit on appeal from summary judgment, no decision on the merits was made other than that there was a material issue of fact as to the relationship of Rosa Parks to the song.  The court said, &quot;We believe that reasonable persons could conclude that there is no relationship of any kind between Rosa Parks' name and the content of the song-a song that is nothing more and nothing less than a paean announcing the triumph of superior people in the entertainment business over inferior people in that business.&quot;  The court also questioned the success of OutKast's claimed metaphor for pushing their competition to the 'back of the bus' - Rosa Parks resisted moving to the back of the bus, she did not in fact force others there.  &quot;As the parties agree, she is “an international symbol of freedom, humanity, dignity and strength.”  [citation omitted]  There is not even a hint, however, of any of these qualities in the song to which Defendants attached her name.&quot;\n In the end, the court reserved judgment on the artistic value of the song, saying &quot;whether we personally regard it as repulsive trash or a work of genius is immaterial to a determination of the legal issues presented to us&quot; and left it for the district court to decide.  The case never made it back to the district court, and the song is still up on Last.fm, so we can assume the parties settled their differences.\n The decision, which features the lyrics to the song in their entirety including a translation of the chorus by Mrs. Parks herself, can be found at 329 F.3d 437 (6th Cir. 2003).  \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Interestingly, this track ended up in court with Mrs. Rosa Parks herself suing OutKast and their label for false advertising.  Because it came to the 6th circuit on appeal from summary judgment, no decision on the merits was made other than that there was a material issue of fact as to the relationship of Rosa Parks to the song.  The court said, &quot;We believe that reasonable persons could conclude that there is no relationship of any kind between Rosa Parks' name and the content of the song-a...", "published": "Sun, 22 Nov 2009 21:48:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Rosa Parks", "artist": {"url": "http://www.last.fm/music/Outkast", "mbid": "73fdb566-a9b1-494c-9f32-51768ec9fd27", "name": "Outkast"}, "url": "http://www.last.fm/music/Outkast/_/Rosa+Parks", "listeners": "193434", "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}]}, "mbid": "b338e36c-578f-40d3-af71-83ae6adfa9c0", "duration": "235000", "playcount": "688602", "id": "1582"}}