{"track": {"streamable": {"#text": "0", "fulltrack": "0"}, "name": "Renegade", "artist": {"url": "http://www.last.fm/music/Jay-Z", "mbid": "", "name": "Jay-Z"}, "url": "http://www.last.fm/music/Jay-Z/_/Renegade", "listeners": "59017", "comments": ["classic", "gay story bro", "cool story bro. [4] lol Dayum ya'll can't we just say it's a good song? Both elite rappers.", "White ppl love EM lol jk. But fo real Em killed on this shit", "cool story bro [3]. They both killed it, its my favorite song ever, all 4 verses were amazing, and I wanna see this Em and Hov again, not the ones we have now", "Jay-z is such a lazy sounding rapper.", "cool story bro. [2] i agree with you though.", "vv You could've just written a journal -,- ...", "cool story bro.", "Really, people hailing Em > Jay on this track is almost (read: almost) as bad as people saying Em > Big on \"Dead Wrong\". \"Relax and take notes, while I take totes of the marijuana smoke\". That line >>>> Eminem's career.", "And for the record, Royce > Jay > Em on this track. Royce fucking destroyed this shit. Much like he bested Em on most of the early Bad Meets Evil (the only real ones, fuck that bullshit they released a couple of months ago) tracks.", ">Just dropped knowledge in this shoutbox. Are you watching closely?", "Basically, if you know what you're talking about, you can assert that Jay = Em on this track, or if you want to take it further Jay > Em on this track.", "The metaphors/allusions/references Jay drops trump the alliteration Em had everyone drooling over in his first verse (ludicrous lucrative lyrics). > I can drop alliterations superior to that on the fly in essays bruh.", "Jay's entire 2nd verse is quotable, and the lines he drops on this track trump Em's any day of the week. \"I had to hustle, my back to the wall, ashy knuckles, pockets filled with a lot of lint, not a cent, Gotta vent, lot of innocent of lives lost on the project bench\". \"My demeanor - thirty years my senior\". \"Raisin my fingers to critics; raisin my head to the sky\nBIG I did it - multi before I die (nigga)\". \"No lie, just know I chose my own fate, I drove by the fork in the road and went straight\".", "Once you look at what both are actually spitting (read: once morons stop drooling over Em's \"white boy\" flow), you'd realize that Em's 1st verse > Jay's 1st verse and Jay's 2nd verse > Em's 2nd verse. And I'd only give Em's verse first a slight edge over Jay's first verse. The gap between the 2nd verses (in Jay's favor) is larger.", "Jay had the best lines on the track, and it applies to everyone who says dumb shit like \"Em killed Jay on his own shit\" (stop dick riding Nas). \"Do you fools even listen to music or do you just skim through it\".", "If you want to really get down to it, the gap between Em and Jay really is actually very small. This song only proves that people still want to champion/hail the white boy. Anyone dismissing race playing a factor in this song is an idiot. The general listener (read: white people) will always be drawn to the white rapper on a track. The fact that the stigmata still exists today in 2011 is just fucking sorry.", "v lolno. These aren't all time verses. Only a fool who hasn't listened to a lot of hip-hop would make that assertion.", ">\"2 of the best verses you'll ever hear\""], "toptags": {"tag": [{"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/aitch", "name": "aitch"}]}, "mbid": "bd9fffc5-e515-424b-8d12-c080039b88ac", "duration": "338000", "playcount": "209181", "id": "1470604"}}