{"track": {"album": {"@attr": {"position": "10"}, "title": "Encore [Deluxe Edition", "url": "http://www.last.fm/music/Eminem/Encore+%5BDeluxe+Edition", "image": [{"#text": "http://ec1.images-amazon.com/images/P/B00065XJ52.09._SCMZZZZZZZ_.jpg", "size": "small"}, {"#text": "http://ec1.images-amazon.com/images/P/B00065XJ52.09._SCMZZZZZZZ_.jpg", "size": "medium"}, {"#text": "http://ec1.images-amazon.com/images/P/B00065XJ52.09._SCMZZZZZZZ_.jpg", "size": "large"}, {"#text": "http://ec1.images-amazon.com/images/P/B00065XJ52.09._SCMZZZZZZZ_.jpg", "size": "extralarge"}], "artist": "Eminem", "mbid": ""}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Rain Man", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Rain+Man", "listeners": "77517", "comments": ["I killed superman how ironic. Lol I love this song so much. One of the few songs that make me laugh out loud. Dr. Dre is hilarious too just by saying yeah as eminem is asking him questions. But he tripped fell and his penis went in, LMAO.", "I fucking love this nonsense. GOD DAMN IT DRE WHERE'S THE GOD DAMN BEAT.", "CUZ I AINT GOT NO LEEEEEEEEEEEEEEEEEEGS", "free jazz", "Best song ever made", "\"I just did a whole song and I didn't say shit.\"", "This is so fucking awesome! I forgot how much i used to love this song back in high school...", "\" shit this is the same verse, I just did this \" haha lol", "\"You find me offensive... I find you offensive for finding me offensive!\"", "He claims he was on drugs when he made this album, this song you can definitely tell. It's just nonsense.", "My favorite Em song", "\"God damn it Dre where's the god-damned beat?\"", "if you like cartoons you'll love this song !!! hehe O_O", "have to laugh at the people saying eminem ruined a dre track , bullshit. listen to the lyrics people , he did incredible with this . made me laugh alot when i first heard it too.", "Brilliant song!!! XD only eminem could do this", "How he does this I do not know, but FANTASTIC!!!", "He just did a whole song and didn't say shit... xD", "funny because of the humor... not how other rap is just embarrassing to listen to", "King of Comedy Rap", "Let's ask Dr. Dre\nDr. Dre? (What up?)\nI gotta question if I may? (Yeah)\nIs it gay to play Putt-Putt golf with a friend (Yeah)\nAnd watch his butt-butt when he tees off? (Yeah)\nBut, but! I ain't done yet\nIn football the quarterback yells out hutt-hutt\nWhile he reaches in another grown man's ass\nGrabs on his nuts but just what if\nIt was never meant it was just an accident\nBut he tripped, fell, slipped and his penis went in\nHis teeny tiny little round hiney but he didn't mean it\nBut his little weenie flinched just a little bit\nAnd I don't mean to go in into any more details but\nWhat if he pictured it as a females butt?\nIs that gay? I just need to clear things up\nTill then I'll just walk around with a manly strut because...\n- amazing verse, I can't imagine anyone else alive who'd come up with this shit!!!!!!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/fun", "name": "fun"}]}, "mbid": "ce2a151e-ab65-4fe7-9a80-4e25c040333c", "duration": "314000", "playcount": "335309", "id": "9576168"}}