{"track": {"album": {"@attr": {"position": "13"}, "title": "Sex And The City: Original Motion Picture Soundtrack", "url": "http://www.last.fm/music/Jem/Sex+And+The+City:+Original+Motion+Picture+Soundtrack", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/77174566.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/77174566.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/77174566.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/77174566.png", "size": "extralarge"}], "artist": "Jem", "mbid": ""}, "wiki": {"content": "&quot;Walk This Way&quot; is a song by American hard rock group <a href=\"http://www.last.fm/music/Aerosmith\" class=\"bbcode_artist\">Aerosmith</a>. It was written by Steven Tyler and Joe Perry. It was originally released as the second single from their 1975 album <a title=\"Aerosmith - Toys in the Attic\" href=\"http://www.last.fm/music/Aerosmith/Toys+in+the+Attic\" class=\"bbcode_album\">Toys in the Attic</a>. It peaked at #10 on the Billboard Hot 100 in early 1977, part of a string of successful hit singles for the band in the 1970s.\n \n In addition to being one of the songs that helped break Aerosmith into the mainstream in the 1970s, it also helped resurrect their career and revolutionized the new hybrid sub-musical genre of &quot;rock and rap&quot;, or the molding of rock and hip hop music when it was re-made in 1986 with rappers Run-D.M.C. on their album Raising Hell. It became an international hit and won both groups a Soul Train Music Award for Best Rap - Single in 1987.\n \n The song was covered by UK girl groups <a href=\"http://www.last.fm/music/+noredirect/Sugababes+and+Girls+Aloud\" class=\"bbcode_artist\">Sugababes and Girls Aloud</a> as the official Comic Relief single in 2007.\n \n <strong>Song information</strong>\n \n The song starts out with the famous two measure drum beat intro by Joey Kramer, followed up the equally famous guitar riff by Joe Perry. The song then goes into the verse, with a steady drum beat and bassline by Tom Hamilton forming as the backbeat, with dueling guitars by Joe Perry and Brad Whitford.\n The lyrics, which tell the story of a high school boy losing his virginity, are sung quite fast by Steven Tyler, with heavy emphasis being placed on the rhyming lyrics (e.g., &quot;so I took a big chance at the high school dance&quot;). This rap-style delivery -- which may explain why the song worked so well as a rap song when it was re-made 11 years later -- was ahead of its time.\n \n Between the elaborately detailed verses, the chorus primarily consists of a repetition of &quot;Walk this way, talk this way&quot;. In collaborations, the other singer often says &quot;talk this way&quot; every alternate line of the chorus. Live in concert, Steven Tyler often has the audience, combined with members of the band, sing &quot;talk this way&quot;. There is also a lengthy guitar solo at the end of the song, and in concert, Steven Tyler will often harmonize his voice to mimic the sounds of the guitar.\n \n In the Run-D.M.C. cover, the turntable is added in to reflect the additional hip hop influence on the record.\n While the band were working on Toys in the Attic, having written the music for the song but having difficulty coming up with lyrics for it, they decided to take a break and see Young Frankenstein, where the &quot;Walk This Way&quot; gag, by legendary British comedian Marty Feldman, provided the basis (or phrase) for the lyrics.\n \n \n While the Run-DMC cover is nearly identical to the original version of the song, the Girls Aloud/Sugababes cover has a few changes tweaked into the song; the additional line &quot;Walk this way, you wanna talk this way&quot; is added, the vocoder is added, the lyrics are moved around, and the beat is slightly sped up to add a further dance pop influence to the song.\n \n Both versions of the song (the original Aerosmith version and the second Aerosmith/Run-DMC remake version) appear on various Aerosmith compilations as well as Run-DMC albums\n \n <strong>Legacy</strong>\n \n &quot;Walk This Way&quot; was one of two hit singles by the band to hit the Top 10 of the Billboard Hot 100 in the 1970s, the other one being a re-release of &quot;Dream On&quot;. &quot;Walk This Way&quot;, though, helped &quot;Toys in the Attic&quot; to be the bestselling Aerosmith album, and one of the most critically acclaimed. Aerosmith's version of &quot;Walk This Way&quot; often competes with &quot;Sweet Emotion&quot; and &quot;Dream On&quot; for the title of Aerosmith's signature song, being one of the band's most important, influential, and recognizable songs. The band almost never omits it from their concert setlist, still performing their classic version of the song to this day. The song has also long been a staple of rock radio, garnering regular airplay on classic rock, mainstream rock, and album-oriented rock radio stations. In 2009, it was named the 8th greatest hard rock song of all time by VH1.\n \n <strong>Run-D.M.C. version</strong>\n \n In 1986, the hip hop group Run-D.M.C. performed a cover of &quot;Walk This Way&quot; with Steven Tyler and Joe Perry guesting on vocals and guitars. While working on Raising Hell, Rick Rubin pulled out Toys in the Attic (an album they freestyled over) and explained who Aerosmith were. While Run and DMC had no idea who Aerosmith were at that time, Jam Master Jay suggested remaking the song. Both Run and DMC did not like the idea. Later, however, they covered the song with Aerosmith. DMC later called it &quot;a beautiful song&quot; in a trailer for Guitar Hero. The 1986 version of the song is often credited as helping break rap into mainstream popular music as it was the first rap song to hit the Top 5 in The Billboard Hot 100, and the remake demonstrated how elements of rap music can be part of rock and pop songs, harking back to the DJing of <a href=\"http://www.last.fm/music/Afrika+Bambaataa\" class=\"bbcode_artist\">Afrika Bambaataa</a>, who would mix in tracks by the likes of <a href=\"http://www.last.fm/music/The+Beatles\" class=\"bbcode_artist\">The Beatles</a>, the <a href=\"http://www.last.fm/music/+noredirect/Rolling+Stones\" class=\"bbcode_artist\">Rolling Stones</a> and <a href=\"http://www.last.fm/music/Grand+Funk+Railroad\" class=\"bbcode_artist\">Grand Funk Railroad</a> among the more usual funk breaks. It also briefly samples the opening drum intro of the original in a middle section of the song. This version of &quot;Walk This Way&quot; charted higher on the Hot 100 than the original version, peaking at #4. It was also one of the first big rap singles in the UK, reaching a peak of #8 there. The landmark collaboration catapulted Run-D.M.C. into mainstream stardom and would influence rap music for years to come. The song paved the way for other pop acts to introduce elements of hip hop into their music. It pioneered the trend of rap/sung collaborations that is so present on American Radio in the late 1990s and 2000s. The collaboration also introduced a fusion of rock and hip hop, later known as rap rock, to a wide audience for the first time. The song also marked a major comeback for Aerosmith, as they had been largely out of mainstream pop culture for several years while recovering from drug and alcohol addiction, and their 1985 comeback album <a title=\"Aerosmith - Done With Mirrors\" href=\"http://www.last.fm/music/Aerosmith/Done+With+Mirrors\" class=\"bbcode_album\">Done With Mirrors</a>, flopped. Aerosmith followed up &quot;Walk This Way&quot; with a string of multi-platinum albums and Top 40 hits, starting with the album <a title=\"Aerosmith - Permanent Vacation\" href=\"http://www.last.fm/music/Aerosmith/Permanent+Vacation\" class=\"bbcode_album\">Permanent Vacation</a> and single &quot;<a title=\"Aerosmith &ndash; Dude (Looks Like a Lady)\" href=\"http://www.last.fm/music/Aerosmith/_/Dude+(Looks+Like+a+Lady)\" class=\"bbcode_track\">Dude (Looks Like a Lady)</a>&quot; in 1987. In 2008, &quot;Walk This Way&quot; was ranked number 4 on VH1's 100 greatest Songs of Hip Hop.\n \n <strong>Music video</strong>\n \n The 1986 music video for &quot;Walk This Way&quot; symbolically placed Aerosmith and Run-D.M.C. in a musical duel in neighboring studios before Tyler literally breaks through the wall that separates them. The video then segues to the bands' joint performance on stage. The highly popular video was the first rap hybrid video ever played in heavy rotation on MTV and is regarded as a classic of the medium.\n It is to be noticed that, aside from Steve Tyler and Perry, none of the other rock musicians in the video are the Aerosmith members; instead, they were played by Roger Lane, J. D. Malo and Matt Stelutto - respectively rhythm guitarist, bassist and drummer for the largely unknown hair metal outfit Smashed Gladys.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Walk This Way&quot; is a song by American hard rock group <a href=\"http://www.last.fm/music/Aerosmith\" class=\"bbcode_artist\">Aerosmith</a>. It was written by Steven Tyler and Joe Perry. It was originally released as the second single from their 1975 album <a title=\"Aerosmith - Toys in the Attic\" href=\"http://www.last.fm/music/Aerosmith/Toys+in+the+Attic\" class=\"bbcode_album\">Toys in the Attic</a>. It peaked at #10 on the Billboard Hot 100 in early 1977, part of a string of successful hit singles for the band in the 1970s.  In addition to being one of the songs that helped break Aerosmith into the mainstream in the 1970s...", "published": "Mon, 4 May 2009 17:39:16 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Walk This Way", "artist": {"url": "http://www.last.fm/music/Run-D.M.C.", "mbid": "", "name": "Run-D.M.C."}, "url": "http://www.last.fm/music/Run-D.M.C./_/Walk+This+Way", "listeners": "296375", "comments": ["almost forgot about corpses in her mouth video and F.E.A.R, love that bike, me want me want", "lizardking66j>>>>>>>>>>>this is a great video but still dont beat virtual insanity video and first time watching smack ur bitch up!!!", "Walk This Way", "great version", "love the video", "this is why I love all kinds of music.  RUN DMC and Aerosmith showed and proved that good music has no racial barriers.", ":-O", "still love it :)", "Surprised this doesn't have more scrobbles!", "Awesome music shout out to my big brother D collins R.I.P.", "The best!", "people say old school, music don't get old and music to day anti got nothing on these guys....", "Old school läst grüssen...lol\n#", "CONCIERTAZO EN MADRID!! NON-STOP OF JUMPING!!", "ahhh de ellos son originales!!!", "Classic!", "great version of this song.   excellent guitareee-solo at the end. rock on \r\n\r\n\\oo/", "Very good song", "love rap-rock", "lol awesome!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "", "duration": "312000", "playcount": "1016953", "id": "1283333"}}