{"track": {"album": {"@attr": {"position": "5"}, "title": "The Chronic", "url": "http://www.last.fm/music/Dr.+Dre/The+Chronic", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87903127.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87903127.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87903127.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87903127.png", "size": "extralarge"}], "artist": "Dr. Dre", "mbid": "704e8225-4f0a-4795-a3ef-7df0c6073977"}, "wiki": {"content": "&quot;Nuthin' but a &quot;G&quot; Thang&quot; is a 1993 hit song by American gangsta rapper Dr. Dre, from his debut solo album, The Chronic. It features rapper Snoop Doggy Dogg and is the first single from the album. &quot;Nuthin' but a 'G' Thang&quot; reached number two on the Billboard Hot 100, outdoing The Chronic's other singles &quot;Fuck wit Dre Day (and Everybody's Celebratin')&quot; (number 8) and &quot;Let Me Ride&quot; (number 34). The single also reached number one on Billboard's Hot R&amp;B/Hip-Hop Singles &amp; Tracks chart. It was also one of the first big rap singles in the UK, where it reached number three.\n The song's music video was MTV's third most requested video of 1993. On MTV, the music video was heavily cut; a full-length version of the video exists with uncut footage (e.g., drug references and a scene where a woman's bikini top was yanked open).\n \n     * Notarized: BET's Top 100 Videos of The 20th Century: number five\n     * On MTV's 100 Greatest Music Videos Ever Made it was listed at number thirty-two in 1999.\n     * In April 2005 MTV2 and XXL's 25 Greatest West Coast Videos number two.\n     * 2001 VH1: 100 Greatest Videos: number eighty\n     * 2003 VH1: 100 Best Songs of the Past 25 Years: number thirty-one\n     * 2007 VH1: Best 100 songs of the 90's : 12th\n     * Voted #14 in the Top 100 Rap Songs.\n \n The vocals are shared by Dre and Snoop Doggy Dogg (who has sole songwriting credit), who drop in trademark references to Long Beach and Compton in California. The song contains samples from Leon Haywood's &quot;I Wanta Do Something Freaky to You&quot; and &quot;Uphill (Peace of Mind)&quot; by Frederick Knight.\n \n &quot;Nuthin' but a 'G' Thang&quot; is listed in The Rock and Roll Hall of Fame's 500 Songs that Shaped Rock and Roll. It's Dre's only song on Rolling Stone's list of the 500 Greatest Songs of All Time (ranked number 419), not counting two other songs that feature Dre as producer and on vocals, N.W.A.'s &quot;Fuck tha Police&quot; and 2Pac's &quot;California Love&quot;. Q magazine listed it as the twenty-fourth greatest hip-hop song of all time. AcclaimedMusic.net lists it as the 131st best song of all time, the best song of 1992, and as the sixth best hip-hop/rap song of all time.\n \n The song is on the soundtrack of the popular video game, Grand Theft Auto: San Andreas from the rap radio station, Radio Los Santos.\n \n Number 3 on VH1's 100 Greatest Songs of Hip Hop.\n \n     * Kris Kross heavily sampled Nuthin' but a &quot;G&quot; Thang on their 1993 single I'm Real.\n     * Snoop Dogg's first single from &quot;Da Game Is to Be Sold, Not to Be Told&quot; was a sequel to the song entitled, &quot;Still a G Thang.&quot;\n     * Dr. Dre and Snoop Dogg retooled &quot;Nuthin' but a 'G' Thang&quot; into the titular theme of their 2001 comedy film The Wash.\n     * The song &quot;I Need a G&quot; by Dani Stevenson featuring Snoop Dogg used the same sample as &quot;Nuthin' but a 'G' Thang&quot;.\n     * Twista used the same Leon Haywood sample for the song &quot;Mobsta's Anthem&quot; from his 1997 album Adrenaline Rush.\n     * Young Dro's video for his 2006 single &quot;Shoulder Lean&quot; references &quot;Nuthin' But a 'G' Thang.&quot;\n     * &quot;Get It Up&quot; by Silkk the Shocker uses the reworked chorus of &quot;Nuthin' But a 'G' Thang&quot;.\n     * Ja Rule's &quot;Livin' It Up&quot; contains a sample of &quot;Nuthin' but a 'G' Thang&quot;. It was nominated for a Grammy Award.\n     * MIMS's &quot;This Is Why I'm Hot&quot; contains a short sample of the song sampled in &quot;Nuthin' but a 'G' Thang&quot;\n     * Juelz Santana has made a song over the beat entitled &quot;Secret&quot;, which can be heard at his official MySpace.\n     * There also is a radio edit, where most of the profanity is removed by changes in lyrics.\n     * There is now a 2009 UK version created by new age old skool, Seb Good Feat. WhiPrap sensation &quot;Jonny Boi&quot;\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Nuthin' but a &quot;G&quot; Thang&quot; is a 1993 hit song by American gangsta rapper Dr. Dre, from his debut solo album, The Chronic. It features rapper Snoop Doggy Dogg and is the first single from the album. &quot;Nuthin' but a 'G' Thang&quot; reached number two on the Billboard Hot 100, outdoing The Chronic's other singles &quot;Fuck wit Dre Day (and Everybody's Celebratin')&quot; (number 8) and &quot;Let Me Ride&quot; (number 34). The single also reached number one on Billboard's Hot R&amp;B/Hip-Hop Singles &amp; Tracks chart. It was also one of the first big rap singles in the UK, where it reached number three.\n ", "published": "Sat, 30 May 2009 12:48:00 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Nuthin' But a \"G\" Thang", "artist": {"url": "http://www.last.fm/music/Dr.+Dre", "mbid": "5f6ab597-f57a-40da-be9e-adad48708203", "name": "Dr. Dre"}, "url": "http://www.last.fm/music/Dr.+Dre/_/Nuthin%27+But+a+%22G%22+Thang", "listeners": "156994", "comments": ["Amazing sample taken from the original track by Leon Haywood - Wanna Do Something Freaky To You.", "classic", "old school!", "Classic", "GIMMIE THE MICROPHONE SO I CAN BURST LIKE A BUBBLE!!!", "Can't fuck with it.", "Now that's a rap!", "classic fo sure", "classic...", "after so many years this still remains my favourite hip hop song.", "death row is the label that, pays me", "Ready to make an entrance so back on up.", "I love this song....", "Love this VIDEO........ITZ LIKE THHHHHIIIIIIIIIZZZZZ..........", "AIN'T NUTHIN BUT A G THANG BABY", ":-O", "Reminds me of San Andreas so much! [5]", ":-O", "NIGGER LOVERS ! ! !", "bump this"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/g-funk", "name": "g-funk"}]}, "mbid": "dcf902a4-f759-4d4f-a480-3ae6b204072e", "duration": "239000", "playcount": "563363", "id": "1047364"}}