{"track": {"wiki": {"content": "&quot;On to the Next One&quot; is a song by American hip hop recording artist Jay-Z, released as the fourth single from his twelfth studio album The Blueprint 3 on his Roc Nation label, also released as the fourth single in the United Kingdom after &quot;Young Forever&quot;. The song features vocals and production from producer and rapper Swizz Beatz. The song has been frequently used for freestyles, notably by Ab-Soul, Bun B, Crooked I and Red Cafe. The song contains a vocal sample of the words &quot;under the spotlight&quot; from the official Justice remix of &quot;D.A.N.C.E.&quot;. The song won the Grammy Award for Best Rap Performance by a Duo or Group at the 53rd Grammy Awards, making this, in total Jay-Z's 13th Grammy Award overall, and Swizz Beatz's first Grammy Award win. In addition, Jay-Z is the first artist to have all four singles from one album win six Grammy Awards in their respective category. This song was also used in the soundtrack for the videogame NBA 2K13\n \n Samples &quot;D.A.N.C.E.&quot; by Justice.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;On to the Next One&quot; is a song by American hip hop recording artist Jay-Z, released as the fourth single from his twelfth studio album The Blueprint 3 on his Roc Nation label, also released as the fourth single in the United Kingdom after &quot;Young Forever&quot;. The song features vocals and production from producer and rapper Swizz Beatz. The song has been frequently used for freestyles, notably by Ab-Soul, Bun B, Crooked I and Red Cafe.", "published": "Sun, 3 Mar 2013 01:32:56 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "On to the Next One (feat. Swizz Beatz)", "artist": {"url": "http://www.last.fm/music/Jay-Z", "mbid": "", "name": "Jay-Z"}, "url": "http://www.last.fm/music/Jay-Z/_/On+to+the+Next+One+(feat.+Swizz+Beatz)", "listeners": "58804", "comments": ["so so good.", "That beat is just UNSTOPPABLE [15]", "now double your money and make a stack [2]", "Happy Bday!!", "That beat is just UNSTOPPABLE [14]", "Choose one im on to the next one freeze somebody bring me back the money please", "My favourite Jay-Z song. That beat is just UNSTOPPABLE [13]", "That beat is just UNSTOPPABLE [12]", "this song turns me on", "Love that he sampled D.A.N.C.E. by Justice on this track. Sick as fuck.", "\"I'm not a Jonas, brother. I'm a grown up.\" LOL The Best song! Congratulations Jay!", "Illuminati! But nice song", "GRAMMY FOR MUSIC <3", "sick! love it", "excellent track for driving too fast on the highway haha  sorry Mr. Officer!", "Lol at that autotune line, he said FUCK THE AUTOTUNE, and the autotune \"makes the line fall dead in a cool effect\".", "Lol mallpunk182, you clearly don't understand it.", "Grammy Award for Best Rap Performance by a Duo or Group", "That beat is just UNSTOPPABLE [11]", "now double your money and make a stack"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/swizz%20beatz", "name": "swizz beatz"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/melhores", "name": "melhores"}]}, "mbid": "", "duration": "256000", "playcount": "400748", "id": "340339159"}}