{"track": {"album": {"@attr": {"position": "1"}, "title": "The Heart of a Thug Ghetto Gospel", "url": "http://www.last.fm/music/2Pac/The+Heart+of+a+Thug+Ghetto+Gospel", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/43146613.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/43146613.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/43146613.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/43146613.jpg", "size": "extralarge"}], "artist": "2Pac", "mbid": ""}, "wiki": {"content": "&quot;Ghetto Gospel&quot; is a song by rapper Tupac Shakur, which was originally released as the second single on his posthumous 2004 album Loyal to the Game. It features a sample from the Elton John track &quot;Indian Sunset&quot; from his Madman Across The Water album. The song was written by Tupac Shakur to separate any racial views at the time and produced by Eminem.\n \n &quot;Ghetto Gospel&quot; was the only song on Loyal to the Game with an accompanying music video. At the very end of the video there is a message from his mother, Afeni Shakur, saying &quot;Remember to keep yourself alive, there is nothing more important than that.&quot;\n \n It reached no.1 in the UK singles charts.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ghetto Gospel&quot; is a song by rapper Tupac Shakur, which was originally released as the second single on his posthumous 2004 album Loyal to the Game. It features a sample from the Elton John track &quot;Indian Sunset&quot; from his Madman Across The Water album. The song was written by Tupac Shakur to separate any racial views at the time and produced by Eminem.  &quot;Ghetto Gospel&quot; was the only song on Loyal to the Game with an accompanying music video.", "published": "Tue, 23 Mar 2010 21:38:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ghetto Gospel", "artist": {"url": "http://www.last.fm/music/2Pac", "mbid": "382f1005-e9ab-4684-afd4-0bdae4ee37f2", "name": "2Pac"}, "url": "http://www.last.fm/music/2Pac/_/Ghetto+Gospel", "listeners": "129833", "comments": ["Franchement la meilleure qu'il ait faite.", "Peace to this young warrior.", "My favorite 2Pac song.", "<3", "Great Tupac - RIP", "dont like 2 pac but love this shit holla..............", "ghetto gospel", "I wish I could downvote people; yet I'll have to be content to upvote this song.", "not to much cause he talked alot shit about white people he would of gotten shot either way.sorry but thats just the truth", "tupac siempre hablaba de las cosas que los yanquis prefieren mantener calladas, ocultas, censuradas.", "Powerful tune. It's amazing how 2Pac's lyrical gift still holds up and remains relevant to our society's problems. God only knows what he would have said about the world today...", "mash it, resample it, remove lyrics, add lyrics, add a beat, add an \"Indian Sunset\", you can do whatever, but he still has a message", "holla!!!!!!!!!!!!!", "too bad it was released in this form way after 2pac's death", "\"INSPIRATION\"", "2Pac didn't even listened to this song", "PAC is still the best because he speaks to EVERYONE. RIP", "Classic pac!! Dam this song is sick!!", "very good", "love it  R.I.P 2pac !!! Gone but not forgetten"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/2pac", "name": "2pac"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/gangsta", "name": "gangsta"}]}, "mbid": "e7bb6b81-83d9-48bd-b52b-2aa6fed29408", "duration": "238000", "playcount": "780899", "id": "8270143"}}