{"track": {"streamable": {"#text": "0", "fulltrack": "0"}, "name": "Crack Music (feat. The Game)", "artist": {"url": "http://www.last.fm/music/Kanye+West", "mbid": "164f0d73-1234-4e2c-8743-d77bf2191051", "name": "Kanye West"}, "url": "http://www.last.fm/music/Kanye+West/_/Crack+Music+(feat.+The+Game)", "listeners": "79844", "comments": ["That real black music, nigga.", "this dark diction has become america's addiction", "My favorite Kanye song. So much meaning.", "If his objective was to create one of the most annoying and obnoxious songs in the world he accomplished it with flying colors.", "that's that crap music nigga", "No wonder it's called Crack Music, it's on repeat and I can't stop listening to it.", "monologue at the end is fucking intense", "brilliant song. i wish kanye still had songs with this much meaning", "GAME NEEDED A VERSE ON HEAR IT WAS MADE FOR HIM TO SPIT AND HE DID  KANYE THIS MY SONG FAM LOVE YOU FOR THAT FAM NO HOMO", "why do you want a game-verse on this track? this is the genius thing about it. in 2005 game was a great artist. and he only got 10 words on this song. this makes this song what it is. imagine. late registration is not an average 12 tracks, 2 singles, 1 lovesong, 9 filler LP... the same with the young jeezy adlibs on Can't Tell Me Nothing", "i love this song so so so so much...it makes me feel like i'm back in the fall of 2005 all over again...", "O' Kanye we hardly knew ye... :/", "lol, game lays down a nice verse on the remix, im wondering why it wasnt on the album, but the hook did come up way short on this one... either way Kanye Omari West and Jayceon Terrell Taylor FTW!!!!!", "like the track i woulda used jigga or lill wayne for the hook maybe juvey. have fun in netherlands kanye!", "great instrumentals but i agree, hook needs to better..", "This is fuckin terrible", "Keyshia and Charlie on the la-la's. <3", "Best Kanye track.", "the marching band drums and choir chorus are genius...i love this song, it represents the gritty origins of contemporary hip hop stemming from the reagan years of the 80's", "ronald reagan cooked up an answer"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/kanye%20west", "name": "kanye west"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/good%20rap", "name": "good rap"}]}, "mbid": "", "duration": "271000", "playcount": "289688", "id": "22008096"}}