{"track": {"album": {"@attr": {"position": "5"}, "title": "The New Breed", "url": "http://www.last.fm/music/50+Cent/The+New+Breed", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/3698788.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/3698788.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/3698788.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/3698788.jpg", "size": "extralarge"}], "artist": "50 Cent", "mbid": "266b8bdc-7c67-4ecd-aa3a-156374126be0"}, "wiki": {"content": "&quot;In Da Club&quot; is a hip hop song performed by rapper 50 Cent for his commercial debut album Get Rich or Die Tryin'. The song was produced by <a href=\"http://www.last.fm/music/Dr.+Dre\" class=\"bbcode_artist\">Dr. Dre</a> with co-production from Mike Elizondo. 50 Cent, Dr. Dre, and Elizondo also wrote the song. The track was released in late 2002 as the album's lead single and was well received by music critics.\n \n &quot;In Da Club&quot; became 50 Cent's first number one single and was one of 2003's most popular songs after reaching number one in the United States and peaking inside the top five on the majority of the European charts it entered. At the 46th Grammy Awards, it was nominated for Best Male Rap Solo Performance and Best Rap Song.\n \n After 50 Cent was discovered by <a href=\"http://www.last.fm/music/Eminem\" class=\"bbcode_artist\">Eminem</a> in 2002, he was invited to fly to Los Angeles where he was introduced to Dr. Dre. 50 Cent recorded seven songs in five days with Dr. Dre, with &quot;In da Club&quot; being the first track they recorded. 50 Cent described the studio sessions saying:\n \n Dre, he'll play dope beats... [He'll say], 'These are the hits, 50. So pick one of these and make a couple of singles or something.' The very first time he heard [me rap on] 'In Da Club' he said, 'Yo, I didn't think you was going to go there with it, but, you know, it works.' He was probably thinking of going in a different direction with that song. Then he expanded it into a hit record.\n \n The production was originally given to the hip hop group <a href=\"http://www.last.fm/music/D12\" class=\"bbcode_artist\">D12</a>, but was passed on to 50 Cent. The rapper recorded the track with only the drum beat present. Since much of the content on Get Rich or Die Tryin' was &quot;dark&quot;, he wanted to write material that was &quot;the exact opposite&quot;. He called the song a &quot;celebration of life. Every day it's relevant all over 'cause every day is someone's birthday.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;In Da Club&quot; is a hip hop song performed by rapper 50 Cent for his commercial debut album Get Rich or Die Tryin'. The song was produced by <a href=\"http://www.last.fm/music/Dr.+Dre\" class=\"bbcode_artist\">Dr. Dre</a> with co-production from Mike Elizondo. 50 Cent, Dr. Dre, and Elizondo also wrote the song. The track was released in late 2002 as the album's lead single and was well received by music critics.  &quot;In Da Club&quot; became 50 Cent's first number one single and was one of 2003's most popular songs after reaching number one in the United States and peaking inside the top five on the majority of the European charts it entered.", "published": "Wed, 17 Feb 2010 00:06:14 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "In Da Club", "artist": {"url": "http://www.last.fm/music/50+Cent", "mbid": "8e68819d-71be-4e7d-b41d-f1df81b01d3f", "name": "50 Cent"}, "url": "http://www.last.fm/music/50+Cent/_/In+Da+Club", "listeners": "771372", "comments": ["DAMN SON", "CLUB BANGER ENOUGH SAID", "one of my favorite beats ever!!!", "Best song", "Gotta love the 50...", "http://www.last.fm/music/KD/Timeless/Damn+Thang", "you dat faggot ass nigga tryna pull me back right", "shiiit, fiddy's the biggest wanker this side of the generation gap, but fuck me, this song's beast.", "TODAY 10 YEAR LEGENDARY SONG \" IN DA CLUUUB \" !", "HOLY SHIT !!! DOPE BEAT", "His first album will always be my favorite.", "go go go 50", "Well done boy..", "Fuck yeah. 50 cent goes hard af here. FUCK GUAM", "YES SEX IT UP!! HARD RAP:)", "best club classic !!!!!!", "i love this song", "this is one of the best partying and club songs", "A 50 classic.", "this is one of the best club songs"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/50%20cent", "name": "50 cent"}, {"url": "http://www.last.fm/tag/gangsta%20rap", "name": "gangsta rap"}]}, "mbid": "eda2ad6f-e444-4cb9-a1f4-ac2085d8db5e", "duration": "173000", "playcount": "2443385", "id": "23534"}}