{"track": {"album": {"@attr": {"position": "1"}, "title": "Paper Trail: Case Closed", "url": "http://www.last.fm/music/T.I./Paper+Trail:+Case+Closed", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/55144533.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/55144533.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/55144533.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/55144533.png", "size": "extralarge"}], "artist": "T.I.", "mbid": ""}, "wiki": {"content": "&quot;Live Your Life&quot; is a song by American rapper T.I., and the third single, from his sixth studio album Paper Trail. It was released as the third single from the album on September 23, 2008. The song features Barbadian  Pop  singer Rihanna, and was produced by Just Blaze and Canei Finch. It officially premiered at the 2008 MTV Video Music Awards during T.I.'s performance. This is T.I's third Billboard Hot 100 number one single in the United States (after &quot;My Love&quot; with Justin Timberlake and his previous single &quot;Whatever You Like&quot;) and Rihanna's fifth on the same chart (after &quot;SOS&quot;, &quot;Umbrella&quot;, &quot;Take a Bow&quot; and &quot;Disturbia&quot;). The song samples O-Zone's &quot;Dragostea din tei&quot;.\n \n In the United Kingdom it was released in a digital download on November 8 and physically released on November 24. It reached number two on downloads alone, becoming T.I.'s third top-five hit in the UK (Destiny's Child's &quot;Soldier&quot; with Lil Wayne which peaked at number four and &quot;My Love&quot; with Justin Timberlake reaching number two as well) and Rihanna's ninth top five hit in the UK.\n \n The single has been certified 3x Platinum by the RIAA, and Platinum by the RIANZ \n \n It was ranked the number six hip hop song of 2008 by MTV. This song can be heard in the film The Hangover as well as the trailer. It was also played during ESPN coverage of the 2009 NFL Draft. The song also won T.I. and Rihanna the Viewer's Choice Award at the 2009 BET Awards, becoming T.I.'s third and Rihanna's first BET Award win. At the 2009 MTV Video Music Awards the song won the award for Best Male Video. It was nominated for 'Track Of the Year', 'Best Hip Hop Collaboration' and 'Best Hip Hop Video' at the 2009 BET Hip Hop Awards, and won in the 'Best Hip Hop Collaboration' &amp; 'Best Hip Hop Video' categories. The song was also nominated for 'Favorite Music Collaboration' at the 2010 People's Choice Awards.\n \n The first version of the song leaked onto the Internet on August 26, earlier than the award performance, although that version was not the mastered version. The official mastered album version, which has Rihanna's own verse, and T.I.'s dedication to soldiers on the Iraqi battlefield (on the first part, he told &quot;Ay... This a special what's haapnin' to all my, all my soldiers over there in Iraq. Errbody right here, what you need to do is be thankful for the life you got you know what I'm sayin'? Stop lookin' at what you ain't got, start and be thankful for what you do got. Let's give it to 'em baby girl&quot;) has already been released as a promotional digital download for radio stations. The radio edit clocks out at 4:01, the album version is the same as above except Rihanna's verse is longer, T.I.'s intro is longer, the chorus is extended and the sample is used at the end, the album version clocks out at 5:39.\n \n The song contains a rendition of the O-Zone song &quot;Dragostea Din Tei&quot;, a number one single throughout Europe that was further made famous by the Numa Numa Internet meme.\n \n &quot;Live Your Life&quot; debuted at number 80 on the Billboard Hot 100 for the chart week of October 10, 2008. The following week, the song jumped from number 80 to number one on the Hot 100. This set a record for the highest jump to number one in history, a record previously set by T.I. himself only six weeks prior when his song &quot;Whatever You Like&quot; jumped from number 71 to number one on the chart. However, this record was broken the following week by Britney Spears and her song Womanizer jumping from number 96 to number one on the Hot 100.  &quot;Live Your Life&quot; also replaced &quot;Whatever You Like&quot; at number 1 on the Hot 100, making T.I. the ninth artist to ever replace themselves at number one on the chart.  &quot;Whatever You Like&quot; also occupied the number 2 position on the Hot 100 that week, making it the first time an artist has held the number 1 and number two positions simultaneously since Akon in 2006. It is T.I.'s second Hot 100 number one as a lead artist, and his third overall. For the issue dated December 6, &quot;Live your Life&quot; topped the Pop 100 chart in the U.S., replacing Katy Perry's &quot;Hot N Cold&quot; from the top spot, making it T.I.'s first ever number one hit on that chart. The single held the number 1 spot for six non-consecutive weeks.\n \n The song debuted at number seven on Bubbling Under R&amp;B/Hip-Hop Singles before entering Hot R&amp;B/Hip-Hop Songs as the week's &quot;Hot Shot&quot; at number 77 and rising the following week up to number 38, peaking at number two for 10 consecutive weeks. The song was also number one on the Hot Rap Tracks for nine consecutive weeks. It also peaked at number four on the Canadian Hot 100. The song debuted at number 3 on the Irish Singles Chart, giving T.I. his highest charting single there, and Rihanna her tenth top ten there. However, in the week ending November 6, &quot;Live Your Life&quot; disappeared on the Irish Top 50, but re-entered at number nine.\n \n In New Zealand, &quot;Live Your Life&quot; debuted at number twenty three on October 6, 2008 and peaked at number two. The song was certified Platinum after nineteen weeks selling over 15 thousand copies. \n \n On the Australian ARIA Singles Chart, the song debuted in its first week at number 48, jumped up to 25, and has so far peaked at number 3. It debuted on the Australian ARIA Physical Singles Chart at number 10 on the 17th of November, and has so far peaked at number seven on that chart. Also, it has peaked so far at number 4 on the ARIA Digital Tracks Chart. \n \n In the UK, the song entered at number 16 on the UK iTunes chart and within hours of being available, it had reached number 1. The Single debuted at number 39 on the official UK Singles Chart and surged up to number 2 the next week, giving Rihanna her sixth top two single, following &quot;Pon De Replay&quot;, &quot;SOS&quot;, &quot;Unfaithful&quot;, &quot;Umbrella&quot; and &quot;Take a Bow&quot;.\n \n The video stars T.I and Rihanna. The music video uses the radio edit of the extended song. The video plays backwards, starting with the end of T.I.'s day. It is 6:33PM. In the opening scene T.I is walking. The song then starts and goes from a series of underground shots and Rihanna in her dressing room. T.I. goes back to walking and is shown with blood all over his face and other various cuts. T.I. is then shown driving in a car at 6:01PM. The video then cuts to T.I's day at 6:27PM. He gets thrown out of the car and is kicked by a large man. The video then cuts again to 5:21PM in the day. T.I is shown wearing the same suit he did earlier in the video, except that it is not torn and dirty. He then encounters a group of thugs. T.I preemptively lands a punch on one of the men. He is then beaten up by the rest men there. Here the video begins a different story arc, showing T.I before he made his fortune. The video takes its turn going from T.I. singing in a recording studio to him and in front of a house playing dice and dominoes with some of his friends. This portion of the video is interspersed with clips of the other story arc, such as showing T.I with a briefcase full of money. After this, the video is mostly back to main story arc. T.I is shown in the bathroom of a bar at 4:35PM. At 4:37PM he walks out into the bar. The video shows T.I. talking to a man saying &quot;[he] want<del> out.&quot;; the man replies by explaining that there is no getting out, not for him nor for the character that Rihanna plays. At 4:41PM T.I slams the money briefcase down on the table and shows it to the man saying that &quot;I'm done. I got myself here, I'll get myself out&quot;. Then he is seen walking into that same bar, in a flashback, with a CD in his hand. The man that T.I spoke to earlier calls him over. This is a flashback showing T.I trying to get a record deal. The last shot of the video takes place at around the same time as the first shot of the video. T.I. is walking down the L.A. sewers, raising his hands triumphantly in the air with a bloodied and scarred face. Meaning that he was successful in buying his way out of the original record deal, both with the money he made and by getting jumped out.\n \n During this scene you can hear T.I.'s song &quot;U Don't Know Me&quot; playing in the background.\n \n The song's producer, Just Blaze, is briefly seen playing pool in the bar during the second verse and final chorus.\n \n The Official Charts Company of the UK censored the video and only play a 30 second clip of the end of the video with no blood.</del>\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Live Your Life&quot; is a song by American rapper T.I., and the third single, from his sixth studio album Paper Trail. It was released as the third single from the album on September 23, 2008. The song features Barbadian  Pop  singer Rihanna, and was produced by Just Blaze and Canei Finch. It officially premiered at the 2008 MTV Video Music Awards during T.I.'s performance. This is T.I's third Billboard Hot 100 number one single in the United States (after &quot;My Love&quot; with Justin Timberlake and his previous single &quot;Whatever You Like&quot;) and Rihanna's fifth on the same chart (after &quot;SOS&quot;...", "published": "Tue, 26 Jan 2010 21:07:43 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Live Your Life", "artist": {"url": "http://www.last.fm/music/T.I.", "mbid": "e5a91e7d-7e58-4495-bc17-abce72da507d", "name": "T.I."}, "url": "http://www.last.fm/music/T.I./_/Live+Your+Life", "listeners": "202004", "comments": ["Vote Live Your Life (feat. Rihanna) NOW!!!!!!!", "Correction: Live Your Life (feat. Rihanna) [3]", "Correction: Live Your Life (feat. Rihanna) [2]", "Live Your Life (feat. Rihanna)", "Correction: Live Your Life (feat. Rihanna)", "I can't stand the beginning. [4]", "I love O-Zone, they rocked in this song 8D", "I can't stand the beginning. [3]", "Live Your Life (feat. Rihanna) [x2]", "T.I.: I hate how the music has lost all intergerity and now is all about how much money the \"artist\" is making and what cars they drive, and all their moronic hooting and hollering.\nRihanna: IMMA PAPERCHASER! LOOK HOW I AM LIVING! LIVE YOUR LIFE!\n\nGotta love the irony of that song.", "Live Your Life (feat. Rihanna)", "I can't stand the beginning. [2] that was taken from O-zone", "I can't stand the beginning.", "Viciante!!!!!", "Just live ya life! Love T.I <3 !", "Yea this is a hot song", "am west side any day!!", "супер!!!", "When I first heard this song, I nearly flipped. Sampling the Numa Numa song did it for me.", "I generally can't stand T.I., but this song is dope.  It's just so unrelentingly happy!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rihanna", "name": "rihanna"}, {"url": "http://www.last.fm/tag/wkqi-fm", "name": "wkqi-fm"}]}, "mbid": "f26d7430-1421-4c9e-aed3-c6670fa8ebdf", "duration": "289000", "playcount": "1376577", "id": "225440796"}}