{"track": {"album": {"@attr": {"position": "4"}, "title": "Fort Minor Sessions @ AOL", "url": "http://www.last.fm/music/Fort+Minor/Fort+Minor+Sessions+@+AOL", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/53395001.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/53395001.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/53395001.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/53395001.png", "size": "extralarge"}], "artist": "Fort Minor", "mbid": "29f9e1d1-b553-4e4d-8641-a31610fcd38d"}, "wiki": {"content": "&quot;Remember the Name&quot; was leaked onto the Internet on August 20, 2005, several months prior to the album's release. The song brought positive reviews from the hip hop community. It was also planned to be the first single from &quot;The Rising Tied&quot; but this changed just before the album came onto the shelves, and Fort Minor released &quot;Petrified&quot; and &quot;Believe Me&quot; instead, reserving &quot;Remember the Name&quot; for later.\n \n The song is quickly becoming one of the most popular sports anthems, played at many stadiums and arenas throughout the United States. The National Basketball Association used &quot;Remember the Name&quot; as the theme song for the 2006 and 2007 NBA Playoffs as well as the 2008 NBA Draft. The song is also featured on the soundtrack of the EA Sports video game NBA Live 06. The 2006 Big East Men's Basketball Tournament was used as a theme song. During the 2006 season it was played as part of the introductory video before Arizona Diamondbacks baseball games. The song is also used during the Cleveland Indians' introductory video in 2007. The song was also the theme at the University of Memphis basketball games during the 2006-2007 college basketball season. Television broadcasts of the Major League Gaming championships in the United States in 2007 often played this song during intermissions preceding Grand Finals.\n It is also featured in promotional TV trailers for the 2006 movie, Gridiron Gang, NBC's 2006 series, Friday Night Lights, and Pride, directed by Sunu Gonera. Also the trailer for Fighting (film).\n The song has also been featured in the TV commercial for the 50th Grammy Awards in 2008.\n It has also been used in a tribute to Calgary Flames captain Jarome Iginla and Montreal Canadiens Alternate Captain Alexei Kovalev. It Has Also Been Used in a Video of NBA Superstar Tracy McGrady and Michael Jordan.\n Remember the Name was also played at the start of Episode 12 (&quot;The OG&quot;), Season 2, in TV Show Numb3rs.\n The song was used in promos during the week leading up to Super Bowl XL which featured the Seattle Seahawks and Pittsburgh Steelers.\n Ron Concepcion, an MMA competitor from Chicago, used this song as entrance music for his mma fight in May 2008, No Way Out.\n UFC middleweight Patrick Cote also used the song as his entrance music for his middleweight title fight with Anderson Silva at UFC 90.\n The song was also used by the University of Washington's First Year Programs in advertising their annual welcome week known as Dawg Daze during the summer of 2008.\n Also, the Beijing Olympics Committee used the song &quot;Remember the Name&quot; for several commercials showing several Chinese athletes, which aired in China and Hong Kong during the 2008 Beijing Summer Games.\n Occasionally featured as the lead-in song for the World Soccer Daily Sirius radio show and podcast.\n The song is used as the background theme in the trailers to the film Fighting\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Remember the Name&quot; was leaked onto the Internet on August 20, 2005, several months prior to the album's release. The song brought positive reviews from the hip hop community. It was also planned to be the first single from &quot;The Rising Tied&quot; but this changed just before the album came onto the shelves, and Fort Minor released &quot;Petrified&quot; and &quot;Believe Me&quot; instead, reserving &quot;Remember the Name&quot; for later.  ", "published": "Sun, 22 Nov 2009 22:20:51 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Remember the Name", "artist": {"url": "http://www.last.fm/music/Fort+Minor", "mbid": "e1564e98-978b-4947-8698-f6fd6f8b0181", "name": "Fort Minor"}, "url": "http://www.last.fm/music/Fort+Minor/_/Remember+the+Name", "listeners": "386233", "toptags": {"tag": [{"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/fort%20minor", "name": "fort minor"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "", "duration": "230000", "playcount": "2577923", "id": "20389546"}}