{"album": {"wiki": {"content": "FutureSex/LoveSounds is the second studio album by American pop and R&amp;B singer Justin Timberlake, released September 12, 2006 on Jive Records. Recording sessions for the album took place during November 2005 to July 2006 at Thomas Crown Studio in Virginia Beach, Virginia. FutureSex/LoveSounds was primarily produced by Timbaland, Danja, and Timberlake himself. The album features lyrical themes concerning sex and love, and it contains musical styles such as R&amp;B, dance-pop, and electronic.\n \n The album was released after a four year gap in which it was revealed that Timberlake was in musical hiatus and felt unable to write anything. It was reported that as Justified was in the making for decades, it would be a challenge for Timberlake to produce an album that would be as successful as his debut. FutureSex/LoveSounds received generally positive reviews from most music critics, based on an aggregate score of 70 out of 100 from Metacritic. The album exceeded expectations and sold in excess of 9 million copies, with 4 million copies sold in the United States alone, and the thirty best-selling album of the 2000s\n \n Timberlake released his debut album, Justified, in 2002, and spawned the US top five hit &quot;Rock Your Body&quot;. However, it was the alleged girlfriend-dumping-themed &quot;Cry Me a River&quot;—because of Timberlake's concluded ten-year relationship with pop contemporary Britney Spears—with a video featuring a woman sporting references to Spears, which propelled the album into charts. Justified eventually sold up to four million copies in the United States. With the commercially and critically successful debut that established Timberlake outside the realm of his then-former band 'N Sync, however, he was only twenty-two years old and at a crossroads that made him feel &quot;burnt&quot; out. He thought he lost his voice in the sense of &quot;knowing what and how he wanted to sing&quot;. Justified was &quot;decades in the making&quot; and would be a challenge for him to follow a similar album; so, he needed a break.\n \n In the following two years, Timberlake turned partially idle in the recording industry. He immersed himself in athletic activities, and was lounging in his house during weekends. Timberlake reflects, &quot;Oh, shit! This is what the world looks like at a regular pace.&quot; His being burnt out partly caused him to try acting in movies. In October 2003, he hosted and was the musical guest on the American late-night variety show Saturday Night Live and showcased his acting abilities in a parody to American actor Ashton Kutcher and American singer-actress Jessica Simpson. Later, he paired American actor Jimmy Fallon on The Barry Gibb Talk Show and, in the words of Fallon, impressed him and the crew with having a great comedic timing. After the show, Timberlake was overwhelmed with acting offers, and readily accepted them because he was also lacking an inspiration at that time and did not want to miss out on opportunities. As he wanted to do it the right way, he chose roles and directors he thought were &quot;cool&quot;. Before the year ends, Timberlake shot the movie Edison Force and acted in the following year for another three lined-up films, including Alpha Dog.\n \n Timberlake opted not to pursue the reunion with 'N Sync that he considered after Justified. According to him, he was concerned with how they would reinvent their music: &quot;OK, what are we gonna do? What we did doesn't work now. How would we reinvent what we do?' I don't think the answer came to any of us.&quot; In late 2004, Timberlake contacted record producers Rich Harrison and Rodney Jerkins, whom the latter had previously produced songs with 'N Sync, for possible collaboration on the new album. Both producers were interested and were already preparing something for him in the time. They liked the live band-driven late-night shows of Timberlake and wanted to incorporate it in his music. While in the trailer during shootings, Timberlake attempted to write songs and conceptualize, and had guitar and keyboard with him. However, it was unproductive: &quot;I just needed a little bit of time away from touring and promoting and I just needed a little time to live.&quot;\n \n In 2005, Timberlake was inspired to make records again. He felt he needed to experiment and create something new. Also, according to him, he was motivated by the sad state of the pop radio and dismissed the idea of doing something that would sound alike. So, he turned again to his Justified collaborator, record producer Timbaland, whom he admired for being &quot;not afraid to move outside of his box&quot;.\n \n In November 2005, he visited Thomas Crown Studios, Timbaland's studio, in Virginia Beach, Virginia, United States. However, they lacked direction as to what the album should be. Record producer Danja, a protégé of Timbaland, recalled, &quot;We had no direction at all ... There was no direction for how he wanted the song to sound, because there was no direction for how he wanted [his album FutureSex/LoveSounds] to sound.&quot; There was no game plan and even a working title: &quot;Nobody had a thought about anything. None of us was aiming for anything.&quot; Timberlake thought that if he could make a record that would live up to Justified, he &quot;would have&quot;; so, he asked Timbaland if he could reproduce the likes of &quot;Cry Me a River&quot; by four or six times. While in the studio, Timbaland was supplying them something to eat and listen to, and was just &quot;fooling&quot; around and &quot;free styling&quot;. Also that night, Danja was playing a guitar riff and caught the attention of Timberlake. The latter then came up with a melody and lyrics. Timbaland was at their side and was adding drums into the progressing sound. With no written lyrics, Timberlake recorded it in the vocal booth that would become a song called &quot;What Goes Around&quot;. The collective was adding everything they felt was fitting to the song, and when done they teased each other until they decided to proceed onto making a new album. Timberlake responded to Timbaland: &quot;Let's do something we would never do. Let's go far left and just see what happens.&quot; Timbaland, who is creative according to Timberlake, took it as a challenge.\n \n Official production of FutureSex/LoveSounds started in December 2005. Timberlake proceeded sluggishly for a few weeks, working on and off in the studio. When production began, Jive Records president Barry Weiss asked him when would the album be done. Timberlake replied: &quot;I don't know, it could take a year.&quot; Timberlake did not recruit many musical collaborators because he was happy with his small cast, saying &quot;they're heavy hitters&quot;. In three weeks time, the collective was able to create songs like &quot;My Love&quot;, &quot;SexyBack&quot;, and &quot;Sexy Ladies&quot;. In early January 2006, Timberlake and the producers were able to compose over a dozen of songs. Timbaland, the veteran among his collaborators, produced the majority of the album, while Justified-co-producers The Neptunes were not able to work with Timberlake again because of a dispute between them and Jive Records. The title of the album was not yet conceptualized although release date was already slated. The title was not finalized until Jive Records gave Timberlake a deadline on finishing what would become FutureSex/LoveSounds.\n \n With no concrete plans, however, Timberlake's goal of the album was &quot;'to capture moments' with a vivid, raw, off-the-cuff sound&quot;. They described the sessions as free-flowing. Timberlake, who included record production in his repertoire, managed the process with no formula. On songs like &quot;SexyBack&quot;, they would go around the studio coming up with beats. Timberlake referred to themselves as &quot;looking like a mad man, a mad scientist&quot;. The collective thought the album best equated to Michael Jackson's landmark record, Thriller, dubbing it as FS/LS Thriller 2006—Timberlake admitted he is a fan of Jackson and even name drops him in the song &quot;Chop Me Up&quot;.\n \n The album's lyrics were never written down on paper, as Timberlake claimed it would only slow him down. For instance, the lyrics for &quot;What Goes Around&quot; were composed in his head with the song being recorded shortly after. Some songs were conceptualized within a relatively short time, while others took longer because Timberlake wanted to do some tricks. For instance, the lyrics to &quot;Losing My Way&quot; were written in a more narrative style which took Timberlake longer to write. The only song he wrote down on paper was &quot;(Another Song) All Over Again&quot;, a collaboration Timberlake did with record producer Rick Rubin. Rubin felt it was unusual for Timberlake because he requested him to write the lyrics before going in the studio instead of hitting it directly in the vocal booth. The idea of teaming up with Rubin emanated from actor Chris Rock, who recommended him to Timberlake. He considered the idea good and, when he saw Rubin at Coachella, California, United States, he approached him and talked over the idea. Timberlake went to Neil Diamond's studio and Rubin played him some demos, one of which a ballad that became &quot;(Another Song) All Over Again&quot;. Timberlake felt that this song challenged him to better his songwriter skill.\n \n With FutureSex/LoveSounds, Timberlake wanted to play rock &amp; roll instead of the R&amp;B and pop genres he combined in Justified. Besides bands like The Strokes, The Killers, Arcade Fire, and Radiohead, he wanted to channel the English rock band Coldplay whom he deemed serious in their music. As major producer of the album, Timbaland retreated from the idea because he was not accustomed to that kind of music. However, he was thinking of making only a handful of such songs to be tested since they were afraid of alienating the urban fan base Timberlake had gathered since his debut album. Timbaland recalled, &quot;We just can't go the Coldplay route.&quot; Enabling them to do it, they produced several interludes and reprises instead of full songs. They anticipated that Timberlake's fans would be irritated or intrigued.\n \n FutureSex/LoveSounds is musically distinct from Justified. Although &quot;What Goes Around&quot;'s sound is relatively similar to Justified, Timberlake said that it is the only closest song to the album. Timberlake called the music of the album a &quot;fly by the seat of your pants&quot; kind of style. &quot;It's less concentrated to [sic] one sound. It's more broad as far as the styles I wanted to mix in to my own type of thing.&quot; Many of the songs were composed with varied instrumentation, but predominantly used guitar and piano. Since Justified, Timberlake has said that he wants to be recognized as an R&amp;B artist because it was the kind of music he grew up listening to. His admiration to rock icons is evident in FutureSex/LoveSounds. Timberlake said the influence English rock musician David Bowie and late INXS frontman Australian singer-songwriter Michael Hutchence had on him is reflected in the album. He said that he admired these rock bands because he felt that &quot;they were capturing something raw and unrehearsed&quot;.\n \n FutureSex/LoveSounds generally contains songs with sexual innuendo and themes of love. The album, if summarized, &quot;...is about the very nature of how sex and love are interchangeable and immutable and contradictory and complementary all at once, so that the same words mean different things depending on what music is played or what mood is set.&quot; Timberlake said that songs in the album were motivated by these two recurring themes. The first half of the album, the FutureSex, generally focuses on sex. For instance, the track &quot;FutureSex/LoveSound&quot; is sexually suggestive. Other sensual songs like &quot;LoveStoned&quot; contain lyrics &quot;She's going home with me tonight&quot; and in &quot;Damn Girl&quot;, &quot;from Casanova to supernova&quot;. The second half, LoveSounds, is the album's &quot;sweet side&quot; and this is evident in some of the preludes. &quot;What Goes Around&quot;, for instance, is considered an emotional song; &quot;LoveStoned&quot; transitions to a two-minute love songs (I Think She Knows). Although the album has lyrical themes, it is completely un-autobiographical. The only song which hints of Timberlake's own experiences is &quot;What Goes Around&quot;. Its lyrics suggests a sequel to &quot;Cry Me a River&quot;, but Timberlake closed the speculation himself, declaring that the song was written about one of his friends, who had gone through a similar situation. Although sex and love are dominant in the entire album, the song &quot;Losing My Way&quot; diverges to a more serious topic; this song was inspired by a documentary of a crystal meth addiction which Timberlake watched. &quot;(Another Song) All Over Again,&quot; is a homage to Donny Hathaway as stated by Timberlake. He considers Donny Hathaway to be &quot;the best singer of all time.&quot;\n \n FutureSex/LoveSounds was released in the United States on September 12, 2006. The album debuted at number one on the Billboard 200, the official US album chart, with first week sales of over 684,000. This was Timberlake's first time at number one as a solo artist after peaking at number two with Justified in 2002. The album has sold over four million units in the United States, and has been certified four-time platinum by the Recording Industry Association of America.\n \n FutureSex/LoveSounds was the eighteenth best-selling album of 2006 in the United States. Internationally, the album was also well-received, being Sony BMG's biggest selling album of 2006 and became the biggest pre-order album in iTunes history and broke the all time record for one week sales of a digital album previously held by Coldplay. The album debuted at number one in Australia, and has since certified five-time platinum by the Australian Recording Industry Association with shipments of over 350,000 units. FutureSex/LoveSounds is the thirty-fourth best-selling album of 2006 in Australia, and third the following year. Across Europe, the album peaked inside the Top 10 in most countries. The album debuted at number one in Ireland and the United Kingdom; it also opened at number two in Sweden and Switzerland.\n \n A deluxe version of the album was released on November 27, 2007. The revamped edition features several guests; including a duet version of &quot;Until the End of Time&quot; with Beyoncé Knowles and the remix version of &quot;Sexy Ladies&quot; featuring vocals by hip hop artist 50 Cent. The deluxe version of the album was released on as a digipak. It includes a bonus DVD which featuring live performances by Timberlake, music videos of all the album's singles except &quot;Until The End of Time&quot; and &quot;Chop Me Up&quot;, Behind-the-Scene footages of the making of some music videos. On this version, both the CD and the DVD contain the clean versions of the songs. Seven singles were released from FutureSex/LoveSounds: &quot;SexyBack&quot;, &quot;My Love&quot;, &quot;What Goes Around.../...Comes Around&quot;, &quot;Summer Love&quot;, &quot;LoveStoned/I Think She Knows&quot;, &quot;Until the End of Time&quot;, and &quot;Chop Me Up&quot;. First three singles were consecutive number-one hit on the Billboard Hot 100, making Timberlake the first male artist to have three or more consecutive number-one hits from one album since Usher achieved it in 2004. Timberlake embarked on the FutureSex/LoveShow tour in January of 2007. Guests were rap group Three 6 Mafia, T.I., and the album's producers will.i.am, Timbaland, and Danja.\n \n Timberlake's collaboration with Timbaland received mixed response from critics. A review from the US daily newspaper The New York Times reads: &quot;How well do Mr. Timberlake and Timbaland work together? So well that they can make even the world's most irritating percussion instrument, the human beatbox, sound pretty good.&quot; On the October 2006 issue of the Vibe magazine, a reviewer says, &quot;Timberlake and Timbaland[...]write frustratingly awkward songs.&quot;\n \n On the October 2006 issue of the British music magazine Q, a review states, &quot;[The album is a] set of forward-thinking pop reminiscent of Sign O' The Times-era Prince.&quot; Ben Williams of New York magazine praised Timberlake as one of the white singers who is brave for producing black music. Stephen Thomas Erlewine of the online music database Allmusic commented that Timberlake has &quot;a clear musical vision&quot; in the album.\n \n Katy Kroll of the music magazine Billboard says: &quot;Although the mix of dance beats, pounding basslines and palatable vocals is occasionally marred by mundane R&amp;B tracks like &quot;Until the End of Time,&quot; there are far more pop gems than slow jams. The sound may be a bit different, but the music's sex appeal remains a force to be reckoned with.&quot; Robert Christgau of the Rolling Stone magazine commented that although &quot;some of the up-tempo stuff flirts with mechanical muscle-flexing&quot;, Timberlake's &quot;best new tracks are thrilling&quot;.\n \n In 2007, the album received four nominations at the Grammy Awards, including Album of the Year and Pop Vocal Album. Timberlake lost the two; however, he won the Best Dance Recording for &quot;SexyBack&quot; and Best Rap/Sung Collaboration for &quot;My Love&quot;, The following year at the Grammys, &quot;What Goes Around.../...Comes Around&quot; was nominated for Record of the Year; Timberlake won Best Male Pop Vocal Performance for the same song and another Best Dance Recording for &quot;LoveStoned/I Think She Knows&quot;. The Rolling Stone magazine listed FutureSex/LoveSounds as their 26th among 2006's top 50 albums of the year.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "FutureSex/LoveSounds is the second studio album by American pop and R&amp;B singer Justin Timberlake, released September 12, 2006 on Jive Records. Recording sessions for the album took place during November 2005 to July 2006 at Thomas Crown Studio in Virginia Beach, Virginia. FutureSex/LoveSounds was primarily produced by Timbaland, Danja, and Timberlake himself. The album features lyrical themes concerning sex and love, and it contains musical styles such as R&amp;B, dance-pop, and electronic.  ", "published": "Sun, 22 Nov 2009 00:27:41 +0000"}, "name": "FutureSex/LoveSounds", "artist": "Justin Timberlake", "url": "http://www.last.fm/music/Justin+Timberlake/FutureSex%2FLoveSounds", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/87945819.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/87945819.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87945819.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87945819.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/87945819/FutureSexLoveSounds.png", "size": "mega"}], "listeners": "940650", "toptags": {"tag": [{"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/2006", "name": "2006"}]}, "releasedate": "    30 Nov 2005, 00:00", "mbid": "012cfa67-b673-42fd-9c20-473a2634a4de", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "FutureSex/LoveSound (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake/_/FutureSex%2FLoveSound+(Main+Version+-+Clean)", "mbid": "", "duration": "241"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "SexyBack (Main Version - Explicit)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+Timbaland", "mbid": "", "name": "Justin Timberlake Featuring Timbaland"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+Timbaland/_/SexyBack+(Main+Version+-+Explicit)", "mbid": "", "duration": "242"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "SexyBack (Main Version - Explicit)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Feat.+Timbaland", "mbid": "", "name": "Justin Timberlake Feat. Timbaland"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Feat.+Timbaland/_/SexyBack+(Main+Version+-+Explicit)", "mbid": "", "duration": "241"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "SexyBack (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Feat.+Timbaland", "mbid": "", "name": "Justin Timberlake Feat. Timbaland"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Feat.+Timbaland/_/SexyBack+(Main+Version+-+Clean)", "mbid": "", "duration": "241"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "SexyBack", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/SexyBack", "mbid": "b78742b6-60d4-422f-8f8b-b21cebcde631", "duration": "242"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "SexyBack (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+Timbaland", "mbid": "", "name": "Justin Timberlake Featuring Timbaland"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+Timbaland/_/SexyBack+(Main+Version+-+Clean)", "mbid": "", "duration": "242"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Medley: Sexy Ladies/Let Me Talk To You (Prelude) (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Medley:+Sexy+Ladies%2FLet+Me+Talk+To+You+(Prelude)+(Main+Version+-+Clean)", "mbid": "", "duration": "331"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Sexy Ladies (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Sexy+Ladies+(Main+Version+-+Clean)", "mbid": "", "duration": "236"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "My Love (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+T.I.", "mbid": "", "name": "Justin Timberlake Featuring T.I."}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+T.I./_/My+Love+(Main+Version+-+Clean)", "mbid": "", "duration": "276"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "Medley: Let Me Talk To You/ My Love (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+T.I.", "mbid": "", "name": "Justin Timberlake Featuring T.I."}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+Featuring+T.I./_/Medley:+Let+Me+Talk+To+You%2F+My+Love+(Main+Version+-+Clean)", "mbid": "", "duration": "368"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "My Love", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/My+Love", "mbid": "cabb5ae4-5f8b-4893-91db-0bbdcc102581", "duration": "276"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "LoveStoned/I Think She Knows Interlude (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/LoveStoned%2FI+Think+She+Knows+Interlude+(Main+Version+-+Clean)", "mbid": "", "duration": "444"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "LoveStoned/I Think She Knows Interlude (Main Version - Explicit)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/LoveStoned%2FI+Think+She+Knows+Interlude+(Main+Version+-+Explicit)", "mbid": "", "duration": "442"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "What Goes Around.../...Comes Around Interlude (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/What+Goes+Around...%2F...Comes+Around+Interlude+(Main+Version+-+Clean)", "mbid": "", "duration": "446"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "15"}, "name": "Chop Me Up (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+Timbaland+&+Three-6+Mafia", "mbid": "", "name": "Justin Timberlake featuring Timbaland & Three-6 Mafia"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+Timbaland+&+Three-6+Mafia/_/Chop+Me+Up+(Main+Version+-+Clean)", "mbid": "", "duration": "303"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "16"}, "name": "Chop Me Up", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Chop+Me+Up", "mbid": "", "duration": "304"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "17"}, "name": "Damn Girl (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+will.i.am", "mbid": "", "name": "Justin Timberlake featuring will.i.am"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+will.i.am/_/Damn+Girl+(Main+Version+-+Clean)", "mbid": "", "duration": "311"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "18"}, "name": "Damn Girl (Main Version - Explicit)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;Justin+Timberlake+featuring+will.i.am", "mbid": "", "name": "Justin Timberlake;Justin Timberlake featuring will.i.am"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;Justin+Timberlake+featuring+will.i.am/_/Damn+Girl+(Main+Version+-+Explicit)", "mbid": "", "duration": "311"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "19"}, "name": "Damn Girl", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Damn+Girl", "mbid": "", "duration": "312"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "20"}, "name": "Medley: Summer Love/Set The Mood (Prelude) (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Medley:+Summer+Love%2FSet+The+Mood+(Prelude)+(Main+Version+-+Clean)", "mbid": "", "duration": "382"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "21"}, "name": "Summer Love (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Summer+Love+(Main+Version+-+Clean)", "mbid": "", "duration": "246"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "22"}, "name": "Until the End of Time", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Until+the+End+of+Time", "mbid": "33dbb876-d498-4a3f-8e9c-1ff77f829c0e", "duration": "322"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "23"}, "name": "Set The Mood Prelude/ Until The End Of Time (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;The+Benjamin+Wright+Orchestra", "mbid": "", "name": "Justin Timberlake;The Benjamin Wright Orchestra"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;The+Benjamin+Wright+Orchestra/_/Set+The+Mood+Prelude%2F+Until+The+End+Of+Time+(Main+Version+-+Clean)", "mbid": "", "duration": "452"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "24"}, "name": "Until The End Of Time (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;The+Benjamin+Wright+Orchestra", "mbid": "", "name": "Justin Timberlake;The Benjamin Wright Orchestra"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake;The+Benjamin+Wright+Orchestra/_/Until+The+End+Of+Time+(Main+Version+-+Clean)", "mbid": "", "duration": "318"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "25"}, "name": "Losing My Way (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Losing+My+Way+(Main+Version+-+Clean)", "mbid": "", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "26"}, "name": "(Another Song) All Over Again (Main Version - Clean)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/(Another+Song)+All+Over+Again+(Main+Version+-+Clean)", "mbid": "", "duration": "346"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "27"}, "name": "Boutique In Heaven (Main Version - Explicit)", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Boutique+In+Heaven+(Main+Version+-+Explicit)", "mbid": "", "duration": "248"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "28"}, "name": "Pose", "artist": {"url": "http://www.last.fm/music/Justin+Timberlake", "mbid": "11ed83a4-0097-4322-aa1e-8fea09def405", "name": "Justin Timberlake"}, "url": "http://www.last.fm/music/Justin+Timberlake/_/Pose", "mbid": "", "duration": "286"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "29"}, "name": "Pose (Main Version -  Explicit)", "artist": {"url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+Snoop+Dogg", "mbid": "", "name": "Justin Timberlake featuring Snoop Dogg"}, "url": "http://www.last.fm/music/+noredirect/Justin+Timberlake+featuring+Snoop+Dogg/_/Pose+(Main+Version+-++Explicit)", "mbid": "", "duration": "285"}]}, "playcount": "11411560", "id": "3085223"}}