{"album": {"wiki": {"content": "True Blue is the third studio album by American singer-songwriter Madonna, released on June 30, 1986 by Sire Records. Madonna worked with Stephen Bray and Patrick Leonard on the album while co-writing all the songs. Deemed as Madonna's most girlish album, True Blue deals with her visions of love, work, dreams as well as disappointments and was inspired by her then husband Sean Penn, to whom Madonna dedicated the album. Musically, the songs on the album took a different direction from her previous endeavours, incorporating classical music in order to engage an older audience who had been skeptical of her music while featuring instrumentation including acoustic guitars, drums, synthesizers and Cuban musical instruments. The album features songs about love, freedom and in the case of &quot;Papa Don't Preach&quot;, social issues like teenage pregnancy.\n \n After its release, True Blue faced mixed reviews from contemporary critics. Some reviewers complimented the album, with one calling it a great dance-pop album while commending Madonna's skills as a singer, songwriter and entertainer. The album was also described as the archetype of the late '80s and early '90s pop albums. Some reviews expressed concern that the album lacked greatness and depth in the message of the songs. However, commercially True Blue became an international success, reaching the top of the charts in several countries including the United States, United Kingdom, Australia, Canada, France, Germany and Italy as well as other European nations. Worldwide sales of the album stand at twenty-four million, seven million of those being sold in United States, which earned it a seven times platinum certification by the Recording Industry Association of America.\n \n Five singles were released from the album: &quot;Live to Tell&quot;, &quot;Papa Don't Preach&quot;, &quot;Open Your Heart&quot;, which went on to top the Billboard Hot 100 chart as well as &quot;True Blue&quot; and &quot;La Isla Bonita&quot;, which reached the top-five. With the singles and their accompanying music videos Madonna began to change her image from that of a &quot;boy-toy&quot; to a more sophisticated matured look. &quot;Papa Don't Preach&quot; generated media controversy with some critics condemning Madonna for encouraging teenage pregnancy while others complimented her for her seemingly pro-life stance. &quot;Open Your Heart&quot; faced criticism for its music video and its portrayal of a minor entering a strip club. During the 2006 Confessions Tour the live performance of &quot;Live to Tell&quot;, which featured Madonna performing the song while hanging from a cross and wearing a crown of thorns, generated media uproar with religious groups condemning it as blasphemy. True Blue is credited as being the album which made Madonna into a superstar. It ensured Madonna's place among the musical artists of the '80s.\n \n True Blue received mixed reviews from critics. Music critics were less than impressed with the album's ending, but did praise the fact that Madonna's voice sounded stronger than it did on her previous efforts. Jon Pareles, in a review for The New York Times, said that &quot;True Blue&quot; reprised the themes of fidelity in its songs and complimented her addition of a tinge of real world storytelling in her songs, making her reach the &quot;fringes of the permissible&quot;. Stephen Holden in another review complimented the album and said that &quot;Madonna goes heavy on heart in this record&quot;. In a Rolling Stone review, Davitt Sigerson stated that Madonna was &quot;singing better than ever.&quot; The album's songs were called &quot;catchy&quot;, but Sigerson also commented on the lack of outstanding songs. He ultimately stated that True Blue is a &quot;sturdy, dependable, lovable new album&quot; which &quot;remains faithful to her past while shamelessly rising above it.&quot;\n \n Stephen Thomas Erlewine, in a review for Allmusic, named the album as the record that made Madonna a superstar. He also calls it &quot;one of the great dance-pop albums, a record that demonstrates Madonna's true skills as a songwriter, record-maker, provocateur, and entertainer through its wide reach, accomplishment, and sheer sense of fun.&quot;\n \n Sal Cinquemani from Slant Magazine called the album &quot;the supreme archetype for late '80s and early '90s pop music. Time stamped with '80s-era keyboard and drum synths, True Blue, though chockfull of hits, is the most dated of Madonna's albums.&quot; Many of the songs on the album were praised including &quot;Live to Tell&quot; which was called striking and &quot;Papa Don't Preach&quot; with the help of which, according to him, &quot;Madonna made the transition from pop tart to consummate artist, joining the ranks of '80s icons like Michael Jackson and Prince.&quot;\n \n BBC in an article about the up's and downs of Madonna's career, called &quot;True Blue&quot; as the album which cemented Madonna's reputation as the first 'Lady of Pop' and also appreciated the singles &quot;Papa Don't Preach&quot; and &quot;Live to Tell&quot;. Entertainment Weekly reviewer Jim Farber said &quot;Though Madonna's third proj-ect finds her adding to her palette with Spanish pop (&quot;La Isla Bonita&quot;) and messing with our heads with its seeming anti-abortion song (&quot;Papa Don't Preach&quot;). Also notable for Live to Tell, her best ballad to date&quot;. Robert Christgau was not impressed with the album and said &quot;In a time of collective self-deception, we don't need another snow job.&quot;\n \n The album debuted at number twenty-eight on the Billboard 200 and reached number one on the issue dated August 16, 1986 staying on the top for six weeks and was on the chart for a total of eighty-two weeks. The album also reached a peak of forty-seven on the Top R&amp;B/Hip-Hop Albums chart. On February 9, 1995 the album was certified seven times platinum by the Recording Industry Association of America (RIAA) for shipments of over seven million albums. This made &quot;True Blue&quot; the third best selling album of Madonna in the United States behind &quot;Like a Virgin&quot; and &quot;The Immaculate Collection&quot;. In Canada the album debuted at number seventy-three on the RPM chart for the issue of July 5, 1986. The album climbed rapidly upwards and peaked the chart for the issue dated August 9, 1986 staying on the top for nine weeks. The album was present on the chart for a record seventy-seven weeks. The album also reached number one in countries like Australia, the United Kingdom, France, Germany, Italy, Norway, Sweden, and Switzerland. Worldwide, the album has sold twenty-four million copies to date.\n \n The release of Madonna's True Blue in 1986 was among several albums by female artists which dominated the Billboard charts, including those by Whitney Houston, Sade, Janet Jackson, and Barbra Streisand. In addition to their willingness to seek outside collaborators, versus male artists who have preferred autonomy, Karin Berg, director of East Coast artists and repertoire for Warner Bros. Records commented, &quot;we may also be speaking here about a new kind of women who dominate their careers, women-Streisand and Madonna, especially-who know exactly what they want and are better at asserting themselves than some of the women in the past.&quot; True Blue was also influential in increasing the number of singles released by record labels. Paul Grein of Billboard reported: &quot;10 or 20 years ago you would have had two singles from an album at the most. Now we're in an era where Madonna is on her fifth single from the album True Blue and Janet Jackson is on her sixth from the LP Control.&quot;\n \n The second single from the album, &quot;Papa Don't Preach&quot; faced criticism as well as support from groups concerned with pregnancy and abortion for its theme of a girl getting pregnant and then deciding to keep her baby instead of aborting it. Alfred Moran who was the executive director of Planned Parenthood of New York City, criticized the song, fearing that it would undermine efforts to promote birth control among adolescents and that it would encourage teenage pregnancy. Susan Carpenter-McMillan who was the president of Feminists for Life (FFL) in the U.S., accepted the song's theme as being pro-life and said that &quot;abortion is readily available on every street corner for young women. Now what Madonna is telling them is, hey, there's an alternative.&quot; In a New York Times interview, Madonna commented on the controversy surrounding the song, and said;\n \n     &quot;Papa Don't Preach&quot; is a message song that everyone is going to take the wrong way. Immediately they're going to say I am advising every young girl to go out and get pregnant. When I first heard the song, I thought it was silly. But then I thought, wait a minute, this song is really about a girl who is making a decision in her life. She has a very close relationship with her father and wants to maintain that closeness. To me it's a celebration of life. It says, 'I love you, father, and I love this man and this child that is growing inside me'. Of course, who knows how it will end? But at least it starts off positive.\n \n Author Semonche in his book Censoring sex explained that with albums like &quot;True Blue&quot; and the next &quot;Like a Prayer&quot;, Madonna pushed the envelope of what could be shown on television which resulted in increase of her popularity. Madonna tried to experiment with different forms and styles with the videos and in the process constructed a new set of image and identity. She employed different aesthetic strategies to illustrate her songs, both narratively and deconstructing the actual meaning of the song. With the music videos of the &quot;True Blue&quot; singles, Madonna changed her boy-toy image of previous videos, movies and concert performances to a sophisticated and serious young woman. Madonna toned down her look for the music video of &quot;Live to Tell&quot; which portrayed her with shoulder-length wavy and golden blond hair with her clothes consisting of a simple 1930s-style flower dress. Madonna adopted a constant image makeover with each video as was evident with the release of the next music video for &quot;Papa Don't Preach&quot;. She appeared as a short-haired young blond teenager with the character deciding against abortion when she becomes pregnant. Madonna wore a slogan T-shirt that announced &quot;Italians do it Better&quot;.\n \n However, the music video of &quot;Open Your Heart&quot; had Madonna changing the concept of the stereo-typical male gaze and voyeurism. She appeared as a stripper in the video, who escapes with a young boy from the strip parlour in the end. Feminist writer Susan Bordo gave a negative review of the video, saying that the leering and pathetic men in the cubicles and Madonna's escape with the boy is &quot;cynically and mechanically tacked on as a way of claiming trendy status for what is just cheesecake - or, perhaps, pornography&quot;. MTV also had some reservations initially before airing the video, which was later resolved after a meeting with Warner Officials. But author Donn Welton pointed out that the usual power relationship between the &quot;voyeuristic male gaze and object&quot; is destabilized by the portrayal of the male patrons of the peep show as leering and pathetic.\n \n The original video for the third single &quot;True Blue&quot; showed Madonna with a new hairstyle from short-cropped in &quot;Papa Don't Preach&quot; to a bushy platinum blonde hairdo. However, Madonna and Sire Records decided to opt for a promotional device in the United States that would involve MTV viewers to make their own videos for the song. The contest was known as &quot;Madonna's 'Make My Video' Contest&quot;. Thousands of participants submitted their own versions of the song. Author Lisa A. Lewis said that this event emphasized Madonna's role as purveyor of multiple audience feelings. Madonna's Spanish look in the music video for the single &quot;La Isla Bonita&quot; became popular and appeared in the fashion trends at that time in the form of boleros and layered skirts accessorizing with rosary beads and crucifix like the video.\n \n Most of the songs from this album has been performed by Madonna on her world tours including most recent Sticky &amp; Sweet Tour. Her 1987 Who's That Girl Tour set list included almost all the songs from the album except &quot;Jimmy Jimmy&quot; which remains still the only song Madonna did not perform on any live appearance. The performances incorporated ideas of sex, sensation, religious and social themes and video projections. &quot;Live to Tell&quot; was one song which has always been performed backed by religious symbolism. The performance in the 1990 Blond Ambition World Tour had Madonna singing on a confession bench, with Roman columns and a platform full of votive candles in the background. Such symbolism was also present in 2006 Confessions Tour. Madonna performed the song while hanging from a mirrored cross and wearing a crown of thorns. This performance faced immense backlash from religious groups including the Russian Orthodox Church, Federation of Jewish Communities of Russia and the Vatican, which condemned the performance as an act of hostility toward the Roman Catholic Church by religious leaders. Madonna defended her performance saying,\n \n     &quot;My performance is neither anti-Christian, sacrilegious or blasphemous. Rather, it is my plea to the audience to encourage mankind to help one another and to see the world as a unified whole. I believe in my heart that if Jesus were alive today he would be doing the same thing.&quot;\n \n Her live performances of songs like &quot;Papa Don't Preach&quot; and &quot;Open Your Heart&quot; was also evoked such reaction from religious groups. Madonna dedicated &quot;Papa Don't Preach&quot; to the Pope during the performance on the Who's That Girl Tour as video images projected the words &quot;Safe Sex&quot;. She later revived the song in the Re-Invention World Tour while wearing t-shirts with slogans like &quot;Kabbalists do it Better&quot; or &quot;Brits do it Better&quot; or &quot;Irish do it Better&quot; T-shirts, reminiscent of the one she used in the song's music video. &quot;Open Your Heart&quot; had Madonna wearing her infamous conical bra during the Blond Ambition World Tour.\n \n For the Who's That Girl Tour, Madonna collaborated with designer Marlene Stewart and brought to life the imagery of the songs and their music videos to stage. Songs like &quot;White Heat&quot; were performed evoking its gangster idea. &quot;Love Makes the World Go Round&quot; was premiered by Madonna at the 1985 Live Aid series of concerts. The most performed song from this album is &quot;La Isla Bonita&quot;. She performed the song on most of her world tours including the 1987 Who's That Girl Tour, the 1993 Girlie Show Tour, the 2001 Drowned World Tour, the 2006 Confessions Tour, and in the Sticky and Sweet Tour in 2008–09. She also sang it at the 2007 Live Earth benefit concert in London. The song has been performed in a variety of remixed versions while retaining the Spanish nature of the composition. Occasionally Madonna is joined by folk groups and gypsy punk bands while dance/tribal remixes of the song have also been performed. In the Sticky &amp; Sweet Tour Madonna incorporated gypsy folk songs like &quot;Doli Doli&quot; and &quot;Lela Pala Tute&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "True Blue is the third studio album by American singer-songwriter Madonna, released on June 30, 1986 by Sire Records. Madonna worked with Stephen Bray and Patrick Leonard on the album while co-writing all the songs. Deemed as Madonna's most girlish album, True Blue deals with her visions of love, work, dreams as well as disappointments and was inspired by her then husband Sean Penn, to whom Madonna dedicated the album.", "published": "Sun, 1 Nov 2009 12:42:19 +0000"}, "name": "True Blue", "artist": "Madonna", "url": "http://www.last.fm/music/Madonna/True+Blue", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/87971755.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/87971755.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87971755.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87971755.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/87971755/True+Blue.png", "size": "mega"}], "listeners": "286341", "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/1986", "name": "1986"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "releasedate": "    25 Oct 1990, 00:00", "mbid": "4f430f03-75ff-329c-9c0d-8feb51eb13d3", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Papa Don't Preach", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Papa+Don%27t+Preach", "mbid": "858ce497-9d05-447f-a63e-3cd15a8c7eea", "duration": "267"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Open Your Heart", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Open+Your+Heart", "mbid": "4a608851-3b31-4b63-ada5-82fd715b504d", "duration": "252"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "White Heat", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/White+Heat", "mbid": "02bffafa-ab07-4fb0-9e89-70acb7dfccc7", "duration": "279"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Live to Tell", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Live+to+Tell", "mbid": "15e695e8-eac9-4e4e-ab2a-195b2ff6ecf8", "duration": "351"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Where's the Party", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Where%27s+the+Party", "mbid": "15997ebd-6837-4863-9cd9-30af89aa300c", "duration": "260"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "True Blue", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/True+Blue", "mbid": "1240e48f-8c5e-4ffb-87df-faeec23af637", "duration": "257"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "La Isla Bonita", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/La+Isla+Bonita", "mbid": "0e2afebb-2343-445a-94f7-c97e4ca1c620", "duration": "241"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Jimmy Jimmy", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Jimmy+Jimmy", "mbid": "918a8898-cf28-401d-9286-62e272111320", "duration": "234"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Love Makes the World Go Round", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Love+Makes+the+World+Go+Round", "mbid": "5479ad4a-92e0-4b92-a2af-a562503a2444", "duration": "270"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "True Blue (The Color Mix)", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/True+Blue+(The+Color+Mix)", "mbid": "7f11e5ba-cec2-4e4f-9d98-b3ea5c3bcad3", "duration": "398"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "La Isla Bonita (Extended Remix)", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/La+Isla+Bonita+(Extended+Remix)", "mbid": "0a99051c-e67c-4c38-abd8-12ace66811e4", "duration": "326"}]}, "playcount": "2278019", "id": "2178125"}}