{"album": {"wiki": {"content": "Dangerous was the first album Michael Jackson released in the 1990s, on November 22, 1991. It became his third best-selling album and second to debut at #1 on the Billboard 200 album chart, where it spent the next 4 weeks - selling 7 million copies in the US. With sales of approximately 30 million copies worldwide, it is Jackson's best-selling recording of the nineties and near ties with Bad as his second-best selling album, behind Thriller.\n \n According to the sleeve notes on the later remastered edition of the album, recording sessions began in Los Angeles, California at Ocean Way/Record One  Studio 2 on June 25, 1990. The sessions ended at Larrabee North and Ocean Way Studio on October 29, 1991, being the most extensive recording project of Jackson's career at the time (over 16 months compared to the usual 6 spent for his previous three studio albums).\n \n In March 1991, Jackson signed a 15 year, 6 album deal to Sony Music. The press reported that Sony actually handed over $1 billion to Jackson, but that was not the case. At the time, Sony estimated that if the albums Jackson released under the new contract sold at the same level they currently sold, it would generate over $1 billion in profits for them. Additionally, Jackson was awarded the highest royalty rate in the business. By the time the contract expired in March 2006, Michael would have been paid $45 million from Sony ($1 million a year, plus $5 million per album delivered). This does not include money he would have also earned from sales of albums, singles, videos etc. Under this contract, Jackson is estimated to have earned $175 million from album sales alone.\n \n At this point, Dangerous was already in the making, under the producing talents of (Quincy Jones recommended) 23-year-old Teddy Riley and Grammy-winner Bill Bottrell. The previous album, Bad, was Jackson's last designed for the LP industry, conforming to the usual 10-song within 50-minute format, whereas Dangerous was a 77-minute, 14-track compilation, which almost dared the capacity of early Nineties compact discs. Consequently, the record was released as a double album in vinyl.\n \n Dangerous was a highly anticipated album, as shown by an incident at the Los Angeles International Airport, where a group of armed robbers stole 30,000 copies before its official release. Because of this, more early copies of the album were released in several countries on November 21 followed by the official November 26 release date.\n \n The album is also well known for the cover's mysterious nature.It's also known for the number of occult symbols.(eg: the world upside down in the middle) A special limited-edition of the album was initially released in a large box with a picture of Jackson's eyes, which folded open to reveal the normal cover (painted by pop surrealist Mark Ryden), in pop-up card, with the CD and booklet in the bottom.\n \n Dangerous was released on November 26, 1991 with record-breaking sales. Dangerous  was Jackson's fastest-selling album ever in the United States with seven million shipped in under two months. This broke the sales record for Bad, which had also shipped seven million copies in 1987, but in twice as many months.\n \n Dangerous debuted at #1 on the Billboard Hot 200 Album Charts, with 326,500 copies sold in its first week. It held the position for four weeks until being replaced by Nirvana's Nevermind; the switch has been cited as an important signal helping to break alternative rock into the mainstream. Jackson helped promote the album with a high-profile performance at the Super Bowl and an interview with Oprah Winfrey, but it did not return to the #1 slot. However, it returned to the Top Ten after Jackson received the Grammy Legend Award at the 1993 ceremony. Dangerous spent 117 weeks inside the Billboard 200, thirty weeks more than Bad. The RIAA certified Dangerous 7x platinum, for shipping 7 million copies.\n \n In the United Kingdom, the album debuted at #1, holding off U2's Achtung Baby, but in the second week it was replaced by Queen's Greatest Hits II. Dangerous spent 23 weeks in the Top 10, and a total of 96 weeks on the Top 75 chart.\n \n &quot;Black or White&quot; was produced and co-written by Bill Bottrell. The single was Jackson's biggest hit since 1983's &quot;Billie Jean&quot;. In all, nine singles were released, spanning two years (1991-1993). A planned single release of the title track &quot;Dangerous&quot; was canceled in late 1993 due to the child molestation allegations. Seven singles reached the UK Top 10, the most for any Jackson album.\n \n 48% of Bad's worldwide sales were in the UK and US; for Dangerous, the total was 33%, reflecting Jackson's growing global reach. For the most part, the singles from Dangerous were bigger hits in Europe and Australia than in the United States. Dangerous sold very well in both Asia and South America, two emerging and growing record markets, and was supported by the Dangerous World Tour. Prior to the release of Jackson's next studio album, HIStory: Past, Present and Future, Book I, Dangerous had already sold over twenty-two million copies worldwide.bIn the space of 17 years, sources estimate the record has sold between 30 and 32 million copies worldwide making it a faster selling album than his previous record Bad.\n \n The album was included at number 115 on the list of the &quot;Definitive 200&quot; albums of all time developed by the National Association of Recording Merchandisers.\n \n As was becoming the standard for Jackson, the album's music videos were among the most costly and innovative of their time. Several of the music videos taken from the Dangerous  album had complex storylines and dance sequences, and featured cameo appearances by celebrities. The video for &quot;Jam&quot;, directed by David Kellogg, showed Jackson and Michael Jordan playing basketball and dancing together, while &quot;Remember the Time&quot;, directed by John Singleton, was set in an Ancient Egyptian palace, and starred Eddie Murphy, Magic Johnson and Iman. &quot;In the Closet&quot; featured Jackson and supermodel Naomi Campbell as lovers. The director of the video was photographer Herb Ritts, who also photographed Jackson in a series of promotional shots for the release of the Dangerous album. The video clip for &quot;Who Is It&quot; is notable as it was directed by David Fincher who later went on direct a number of films including Se7en, Fight Club and Zodiac. For the video &quot;Give Into Me&quot;, Michael appears in a concert setting, featuring Guns N Roses guitarist Slash.\n \n &quot;Black or White&quot; was originally over ten minutes long, premiering simultaneously on November 14, 1991 on MTV, VH1, BET, and Fox. The video featured one of the earliest examples of computer-generated morphing. The last four minutes of the video also induced much controversy, as it depicted Jackson smashing store windows and destroying a car with a crowbar. Jackson said this destructive behaviour was intended to imply a message of anti-racism and racist graffiti was added in later versions to make the violence more understandable. The music video was also controversial because of Jackson's sexually suggestive dance, which included the crotch grab as well as zipping up his pants. MTV and the other music video networks decided to excise the last four minutes of the &quot;Black or White&quot; video for all subsequent airings, and Jackson issued a statement apologizing to anyone who had been offended, and explaining that he tried to interpret the animal instinct of panthers into a dance. The video featured Macaulay Culkin and an appearance during the morphing scene by young Tyra Banks and was directed by John Landis, also the director of the &quot;Thriller&quot; short film.\n \n Alternative editions of the albums became very rare, products almost exclusive for record collectors. The most notable editions were a 1992 edition that folded out to become a diorama, a 1993 Japan remix compilation and a 1993 Australia two-disc edition that contained bonus remixes.\n \n An international re-release of the album (entitled Dangerous: Special Edition) took place on October 16, 2001, just two weeks before the release of Jackson's studio album Invincible. Simultaneously, Special Editions of Off the Wall, Thriller and Bad were also released. For the occasion, Dangerous was digitally remastered and included a slipcase and a brand new 24-page colorful booklet with revised artwork and previously-unseen photos. The new edition managed to reach #108 in the UK charts (the only one of those four re-releases that didn't enter the Top 75 there). Because of the constraints of Dangerous' running time, previously unreleased songs were not included. Originally, Dangerous: Special Edition was to be released as a double disc release, the 1st disc featuring the original 14 track album, the 2nd filled with unreleased tracks. This project was scrapped at the last moment, however many of the tracks were eventually leaked onto the internet along with various demos of other tracks that appeared on the album. In 2004, some of these leaked tracks were officially released on The Ultimate Collection (namely the &quot;Dangerous&quot; (Early Version) and &quot;Monkey Business&quot;).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Dangerous was the first album Michael Jackson released in the 1990s, on November 22, 1991. It became his third best-selling album and second to debut at #1 on the Billboard 200 album chart, where it spent the next 4 weeks - selling 7 million copies in the US. With sales of approximately 30 million copies worldwide, it is Jackson's best-selling recording of the nineties and near ties with Bad as his second-best selling album, behind Thriller.  ", "published": "Tue, 3 Aug 2010 16:53:12 +0000"}, "name": "Dangerous", "artist": "Michael Jackson", "url": "http://www.last.fm/music/Michael+Jackson/Dangerous", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/91836583.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/91836583.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91836583.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91836583.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/91836583/Dangerous.png", "size": "mega"}], "listeners": "344897", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/michael%20jackson", "name": "michael jackson"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}]}, "releasedate": "    30 Nov 1990, 00:00", "mbid": "f8fec732-3778-36b6-8237-4a402626a375", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Jam", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Jam", "mbid": "00c804bf-78d3-4450-b9d8-5b3967a20bc4", "duration": "336"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Why You Wanna Trip on Me", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Why+You+Wanna+Trip+on+Me", "mbid": "00378f05-a8a9-465c-98be-d3b42881b6af", "duration": "323"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "In the Closet", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/In+the+Closet", "mbid": "141ca89d-75e0-4fb0-ad25-7bccabd97c7e", "duration": "390"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "She Drives Me Wild", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/She+Drives+Me+Wild", "mbid": "1dca3212-f387-4320-a057-c9956b22bc77", "duration": "219"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Remember the Time", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Remember+the+Time", "mbid": "3b13400d-0ea7-4b9e-b696-c3bc830eb2da", "duration": "238"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Can't Let Her Get Away", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Can%27t+Let+Her+Get+Away", "mbid": "7a513025-cb94-4c5d-a4e4-c1bd3e347aa0", "duration": "168"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Heal the World", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Heal+the+World", "mbid": "04b18638-e902-4396-bc8a-7d427a10944b", "duration": "384"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Black or White", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Black+or+White", "mbid": "071fa60b-652a-4d67-b7e4-58a63a1bbe6f", "duration": "201"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Who Is It", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Who+Is+It", "mbid": "", "duration": "391"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "Give in to Me", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Give+in+to+Me", "mbid": "22a79f1b-0762-49cf-920b-c5d90d0fc954", "duration": "328"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "Will You Be There", "artist": {"url": "http://www.last.fm/music/+noredirect/Michael+Jackson;The+Cleveland+Orchestra", "mbid": "", "name": "Michael Jackson;The Cleveland Orchestra"}, "url": "http://www.last.fm/music/+noredirect/Michael+Jackson;The+Cleveland+Orchestra/_/Will+You+Be+There", "mbid": "", "duration": "458"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "Keep the Faith", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Keep+the+Faith", "mbid": "dc1f86c8-b088-4a02-820a-5439b426acf1", "duration": "356"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "Gone Too Soon", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Gone+Too+Soon", "mbid": "727e9211-7cc5-4089-ba2b-aae6aada520c", "duration": "202"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "Dangerous", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Dangerous", "mbid": "0c170a74-5d7c-4915-8071-73b669c46d5b", "duration": "417"}]}, "playcount": "3905134", "id": "2032862"}}