{"track": {"album": {"@attr": {"position": "14"}, "title": "Good Girl Gone Bad", "url": "http://www.last.fm/music/Rihanna/Good+Girl+Gone+Bad", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82474787.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82474787.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82474787.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82474787.png", "size": "extralarge"}], "artist": "Rihanna", "mbid": "0e48ae9a-a52f-4f3f-95c0-a547937368f2"}, "wiki": {"content": "&quot;Disturbia&quot; is a song written by Andre Merritt, Chris Brown and Robert Allen for the re-release of Rihanna's third studio album, Good Girl Gone Bad, and is the third single from the re-release, following &quot;Take a Bow&quot; and &quot;If I Never See Your Face Again&quot; and the seventh single from the original album. The song was produced by Brian Kennedy with background vocals by Chris Brown and Andre Merritt. Contrary to popular belief, Rihanna uses an Auto-Tune, not a vocoder throughout the song. It was featured in a Circuit City commercial.\n \n The song was originally written by Chris Brown and his team known as the Graffiti Artizts and was considered for the re-release of his album Exclusive. However, Brown felt that the song would be better suited for a female singer. He then forwarded the song to Rihanna. Def Jam had considered saving the track for Rihanna's next album in 2009, because she had already recorded &quot;Take a Bow&quot; for the re-release of Good Girl Gone Bad. However, Rihanna and her team felt that the song was a summer single and needed to be recorded and released as soon as possible. The decision was finally made to release the song as the follow up to &quot;Take a Bow&quot;.\n \n The song follows in the footsteps of Rihanna's &quot;Don't Stop the Music&quot; by being a fast and upbeat pop/dance-rhythmic song. However, in contrast to the upbeat music of &quot;Don't Stop the Music&quot;, it is lyrically dark in tone, being about a state of mental anguish, delusional feelings and confusion.\n \n In the UK, although not yet released as a single, &quot;Disturbia&quot; debuted on the UK Singles Chart at number forty-seven and was expected to chart higher on the 27th July due to high downloads and the release of the video, but managed to re-enter at #47 again and then climbed to #34. It also debuted at number forty-five in Ireland and then rose to #7 and became its new peak.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Disturbia&quot; is a song written by Andre Merritt, Chris Brown and Robert Allen for the re-release of Rihanna's third studio album, Good Girl Gone Bad, and is the third single from the re-release, following &quot;Take a Bow&quot; and &quot;If I Never See Your Face Again&quot; and the seventh single from the original album. The song was produced by Brian Kennedy with background vocals by Chris Brown and Andre Merritt. Contrary to popular belief, Rihanna uses an Auto-Tune, not a vocoder throughout the song. It was featured in a Circuit City commercial. ", "published": "Mon, 8 Mar 2010 18:48:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Disturbia", "artist": {"url": "http://www.last.fm/music/Rihanna", "mbid": "69989475-2971-49aa-8c53-5d74af88b8be", "name": "Rihanna"}, "url": "http://www.last.fm/music/Rihanna/_/Disturbia", "listeners": "671368", "comments": ["never gets old [70]", "Hino", "never gets old [69]", "BOW TO THIS", "666.728 - \r\nholy shit", "never gets old [68]", "♥", "pan pan peter pan pan peter pan", "bum bum be dum bum bum be dum bum <3 [3] never gets old [68]", "never gets old [67]", "<3", "I'd forgotten how good this is. [2]", "bum bum be dum bum bum be dum bum <3 [2]", "One of my faves of her!.", "super song", "Bruno Mars had a grenade, Tio Cruz had dynamite, then they both through it at katy perry the explosion was so powerful that riannah had a memory loss and then she ran out saying whats my name but nelly said it was just a dream.", "her best song!", "love this song", "bum bum be dum bum bum be dum bum <3", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS.ITS SO FREAKY BUT IT WILL ACTUALLY WORK April 2012 ."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/rihanna", "name": "rihanna"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "0090ee79-bf8b-4058-8ae3-41a5c1d9631b", "duration": "239000", "playcount": "4356283", "id": "196042126"}}