{"track": {"album": {"@attr": {"position": "11"}, "title": "The Best of Kylie Minogue", "url": "http://www.last.fm/music/Kylie+Minogue/The+Best+of+Kylie+Minogue", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91009597.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91009597.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91009597.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91009597.png", "size": "extralarge"}], "artist": "Kylie Minogue", "mbid": "2639a5ad-e3e1-4af8-bab9-328dcfe67e8c"}, "wiki": {"content": "&quot;Slow&quot; is a song performed by Australian recording artist and songwriter Kylie Minogue taken from her ninth studio album Body Language (2003). The song was later included on Minogue's second Greatest Hits compilation, Ultimate Kylie (2004). Written by Kylie Minogue, Dan Carey, Emilíana Torrini and produced by Sunnyroads, the song served as the album's lead single and was released on 3 November 2003. Musically, the song has an electropop feel.\n \n &quot;Slow&quot; received very positive reviews from music critics and fans alike, who thought the single was a departure from previous singles in sound and style. &quot;Slow&quot; was also marked as a highlight of the album and is also known as one of Minogue's best. &quot;Slow&quot; was nominated for Grammy Award for Best Dance Recording in the 47th Grammy Awards. &quot;Slow&quot; received commercial success worldwide, peaking at number one in her native Australia, and Denmark, Spain and United Kingdom. It performed well in other territories, reaching the top ten in Finland, Hungary, Norway, Ireland, Canada, New Zealand and Germany amongst others. The song had minor success on the Billboard Hot 100, peaking at number ninety-three, but managed to peak at number one on the US Hot Dance Club Songs, making it Minogue's third single to peak there.\n \n An accompanying music video was shot in Barcelona, Spain. The video featured Minogue lying next to a swimming pool surrounded by a semi-naked 'cast' striking various poses whilst lying down on their backs or on their sides. &quot;Slow&quot; has been performed on many of Minogue's concert tours, including Showgirl: The Greatest Hits Tour and her KylieX2008 tour. Minogue has named &quot;Slow&quot; as her favorite song that she has recorded. The single's music video, directed by Baillie Walsh, was shot over a three-day period in the Spanish city of Barcelona, at the Piscina Municipal de Montjuïc. The first two days of shooting were postponed due to heavy rain, but the video was completed by the end of the third day. The video opens with a man diving into a swimming pool from a diving board from where the skyscrapers of Barcelona can be clearly seen. After the man gets out the pool, the rest of the video focuses on Minogue, who is amongst a crowded poolside of swimwear-clad men and women. There are various side-views and bird's-eye views of Minogue as she sings the song.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Slow&quot; is a song performed by Australian recording artist and songwriter Kylie Minogue taken from her ninth studio album Body Language (2003). The song was later included on Minogue's second Greatest Hits compilation, Ultimate Kylie (2004). Written by Kylie Minogue, Dan Carey, Emilíana Torrini and produced by Sunnyroads, the song served as the album's lead single and was released on 3 November 2003. Musically, the song has an electropop feel.  ", "published": "Mon, 11 Mar 2013 09:03:20 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Slow", "artist": {"url": "http://www.last.fm/music/Kylie+Minogue", "mbid": "2fddb92d-24b2-46a5-bf28-3aed46f4684c", "name": "Kylie Minogue"}, "url": "http://www.last.fm/music/Kylie+Minogue/_/Slow", "listeners": "184507", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "00c434f1-5d3c-431c-9f02-c28bbc1db7df", "duration": "193000", "playcount": "1004746", "id": "2793170"}}