{"track": {"album": {"@attr": {"position": "2"}, "title": "Loose", "url": "http://www.last.fm/music/Nelly+Furtado/Loose", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69697420.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69697420.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69697420.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69697420.png", "size": "extralarge"}], "artist": "Nelly Furtado", "mbid": "e51f0649-244d-4e6b-af6a-dd991509fa49"}, "wiki": {"content": "&quot;Maneater&quot; is a song written by Nelly Furtado, Timothy &quot;Timbaland&quot; Mosley, Jim Beanz and Nate &quot;Danja&quot; Hills for Furtado's third album, Loose. It was co-produced by Timbaland and Danja and includes influences of 1980s music by artists such as Eurythmics and Hall &amp; Oates. Furtado stated that Hall &amp; Oates' song of the same name was an influence during the writing and recording of the song.\n \n Released as the album's first single in Europe in May 2006, &quot;Maneater&quot; became one of Nelly Furtado's most popular singles, topping the singles charts in Poland and the UK, and reaching the top ten across much of Continental Europe. It served as the album's second single in Australia, where it reached the top five, and in North America, where it became a club hit but was less commercially successful than the lead single, &quot;Promiscuous&quot;. It received favorable reviews from many music critics.\n \n &quot;Maneater&quot; was one of the first songs Furtado and Timbaland worked on in the Hit Factory Criteria recording studios in Miami, Florida. She has described the song as an analogy of how she incorporated the &quot;creative energy&quot; of Timbaland and his production crew into Loose. When making the album, Furtado and Timbaland were influenced by the work of musicians from the 1980s such as Talking Heads, Blondie, Madonna, The Police and Eurythmics. &quot;Eurythmics had this spooky, keyboard-driven pop sound&quot;, Furtado said. Final production of the track was delayed after a speaker caught fire in the studio control room.\n \n Furtado has characterized &quot;Maneater&quot; as &quot;a 'couture pop' song&quot;, explaining that it is &quot;in your face and very fashionable, stylistic and of-the-moment.&quot; In an interview with MTV News, she compared it favorably to eating too much cheesecake: &quot;It's got a crazy loud beat, and the vocals are bitchy and loud. A lot of people say it sounds like Peaches, because of the delivery, the spooky vocals.&quot; According to Furtado, the song is related to how people become &quot;hot on themselves&quot; when dancing in their underwear in front of a mirror. &quot;[It] truly has a life of its own; it makes you move&quot;, she said. Media sources compared it to the Hall &amp; Oates single &quot;Maneater&quot;, released in 1982, which Furtado has cited as an influence on the song.\n \n In Australia, the CD was released in two formats, although one version (the international single) had an extremely limited run and was not widely available. The Australia-exclusive &quot;Maneater&quot; CD single includes a cover of Gnarls Barkley's &quot;Crazy&quot; recorded on BBC Radio 1's Live Lounge program, on which &quot;Maneater&quot; was covered three times, by pop punk band Panic at the Disco, dance music duo Basement Jaxx and rock band Boy Kill Boy, whose cover was released on the album Radio 1's Live Lounge.\n \n &quot;Maneater&quot; is an uptempo electro-rock song that combines 80's electro synths and a more dance-oriented beat. The up-tempo song has prominent electropop and synth pop influences and is lyrically related to how people become &quot;hot on themselves&quot; when dancing in their underwear in front of a mirror. &quot;[It] truly has a life of its own; it makes you move&quot;, she said. Media sources compared it to the Hall &amp; Oates single &quot;Maneater&quot;, released in 1982, which Furtado has cited as an influence on the song. The song has a dance tempo and it is composed in the key of D major with a tempo of 132 beats per minute.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Maneater&quot; is a song written by Nelly Furtado, Timothy &quot;Timbaland&quot; Mosley, Jim Beanz and Nate &quot;Danja&quot; Hills for Furtado's third album, Loose. It was co-produced by Timbaland and Danja and includes influences of 1980s music by artists such as Eurythmics and Hall &amp; Oates. Furtado stated that Hall &amp; Oates' song of the same name was an influence during the writing and recording of the song.  Released as the album's first single in Europe in May 2006...", "published": "Sun, 13 Dec 2009 00:58:14 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Maneater", "artist": {"url": "http://www.last.fm/music/Nelly+Furtado", "mbid": "13655113-cd16-4b43-9dca-cadbbf26ee05", "name": "Nelly Furtado"}, "url": "http://www.last.fm/music/Nelly+Furtado/_/Maneater", "listeners": "608587", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/nelly%20furtado", "name": "nelly furtado"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}]}, "mbid": "01094cae-de10-4507-8e89-1d4ecac05865", "duration": "259000", "playcount": "3499425", "id": "38809107"}}