{"track": {"album": {"@attr": {"position": "9"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Elton+John/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/80757967.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/80757967.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/80757967.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/80757967.png", "size": "extralarge"}], "artist": "Elton John", "mbid": "c6ea842d-3e3f-4725-962d-93628f9d6a0a"}, "wiki": {"content": "&quot;Candle in the Wind&quot; is a song with music by Elton John and lyrics by Bernie Taupin. It was originally written in 1973, in honor of Marilyn Monroe, who had died 11 years earlier.\n \n In 1997, John performed a remake of the song as a tribute to Diana, Princess of Wales. This version of the song was released as a single, and reached No. 1 in many countries, proving a much greater success than the original.\n \n The original version in the key of E major appeared on John's 1973 album Goodbye Yellow Brick Road. The lyrics of the song are a sympathetic portrayal of the life of Marilyn Monroe (the song's opening line &quot;Goodbye Norma Jean&quot; refers to Monroe's real name). The single release of the original song reached #11 in the U.K. charts in 1974. At the time, it was not released as a single in the United States (&quot;Bennie and the Jets&quot; was chosen instead). Taupin was inspired to write the song after hearing the phrase &quot;candle in the wind&quot; used in tribute to Janis Joplin.\n \n In 1987, a live version of the song recorded for the album <em><a title=\"Elton John - Live In Australia With The Melbourne Symphony Orchestra\" href=\"http://www.last.fm/music/Elton+John/Live+In+Australia+With+The+Melbourne+Symphony+Orchestra\" class=\"bbcode_album\">Live In Australia With The Melbourne Symphony Orchestra</a></em> was released as a single. This version was released in the United States and reached #6 on the Billboard Hot 100. It also reached #5 in the United Kingdom.\n \n &quot;<a title=\"Elton John &ndash; Candle In The Wind 1997\" href=\"http://www.last.fm/music/Elton+John/_/Candle+In+The+Wind+1997\" class=\"bbcode_track\">Candle In The Wind 1997</a>&quot; or &quot;Goodbye England's Rose&quot; is a remake of &quot;Candle in the Wind&quot; as a tribute to Diana, Princess of Wales. The opening lines of the 1973 version, &quot;Goodbye Norma Jean, though I never knew you at all,&quot; were adapted to &quot;Goodbye England's rose, may you ever grow in our hearts.&quot; In fact, most of the lyrics were adapted to suit the circumstances of Diana's life and death: one notable omission was the line &quot;Even when you died, the Press still hounded you&quot;.\n \n Released in 1997, the song peaked at No. 1 in the United Kingdom, becoming John's fourth No. 1 single. It also peaked at No. 1 in several other countries. The Guinness Book of Records 2007 states that &quot;Candle In the Wind 1997&quot; is the biggest-selling single &quot;since records began,&quot; but that Bing Crosby's &quot;White Christmas&quot; has sold the most copies. John said he would never again sing this version live except at the request of Harry or William Windsor.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Candle in the Wind&quot; is a song with music by Elton John and lyrics by Bernie Taupin. It was originally written in 1973, in honor of Marilyn Monroe, who had died 11 years earlier.  In 1997, John performed a remake of the song as a tribute to Diana, Princess of Wales. This version of the song was released as a single, and reached No. 1 in many countries, proving a much greater success than the original.  ", "published": "Sat, 4 Dec 2010 03:22:34 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Candle in the Wind", "artist": {"url": "http://www.last.fm/music/Elton+John", "mbid": "334c2c2c-2ae3-4b69-8f38-167d07f83d25", "name": "Elton John"}, "url": "http://www.last.fm/music/Elton+John/_/Candle+in+the+Wind", "listeners": "316226", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/elton%20john", "name": "elton john"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/piano", "name": "piano"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "mbid": "01e373eb-cf42-42d1-8969-991513f594ea", "duration": "227000", "playcount": "1159575", "id": "1015737"}}