{"track": {"album": {"@attr": {"position": "16"}, "title": "Back to Basics", "url": "http://www.last.fm/music/Christina+Aguilera/Back+to+Basics", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92318087.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92318087.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92318087.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92318087.png", "size": "extralarge"}], "artist": "Christina Aguilera", "mbid": "d0445642-1485-3c54-a670-3b577da64906"}, "wiki": {"content": "&quot;Candyman&quot; is a swing jazz song written by Christina Aguilera and Linda Perry for Aguilera's third studio album, Back to Basics. It was released as the album's third and final American single in early 2007. In December 2007, it received a Grammy Award nomination for Best Female Pop Vocal Performance.\n \n <strong>Background and writing</strong>\n \n Perry and Aguilera have said that the song is new lyrics to music that is a new arrangement of <a href=\"http://www.last.fm/music/The+Andrews+Sisters\" class=\"bbcode_artist\">The Andrews Sisters</a>' 1941 hit &quot;<a title=\"The Andrews Sisters &ndash; Boogie Woogie Bugle Boy\" href=\"http://www.last.fm/music/The+Andrews+Sisters/_/Boogie+Woogie+Bugle+Boy\" class=\"bbcode_track\">Boogie Woogie Bugle Boy</a>&quot;.  Critics are usually complimentary towards Aguilera for her authentic replication of the old style.\n \n The song includes the military cadence &quot;<a title=\"USMC &ndash; Tarzan &amp; Jane Swingin' On A Vine\" href=\"http://www.last.fm/music/USMC/_/Tarzan+&amp;+Jane+Swingin%27+On+A+Vine\" class=\"bbcode_track\">Tarzan &amp; Jane Swingin' On A Vine</a>&quot;, sampled from the album Run to Cadence with the United States Marines, Volume 2.\n \n <strong>Release</strong>\n \n Originally, &quot;Candyman&quot; was to be the second single off the album, but the label pushed for &quot;Hurt&quot; hoping it would have comparable success to 2002's &quot;Beautiful&quot; and would become a holiday hit. The song was released on February 5, 2007 in the US, although Aguilera had already performed it on New Year's Rockin' Eve. The song debuted in the January 20, 2007 release of the Billboard Hot 100. &quot;Candyman&quot; peaked at #25 in its seventh week on the chart making it Christina Aguilera's 14th top 40 hit on the Billboard Hot 100. In the UK it was released on download only, peaking at #17 on the UK main singles chart and getting over 100,000 digital downloads. The song re-entered the UK Itunes chart in 2008 reaching 60 on the top 100 after <a href=\"http://www.last.fm/music/Alexandra+Burke\" class=\"bbcode_artist\">Alexandra Burke</a> performed the song on X-Factor. The song performed very well in Oceania, peaking #2 in both Australia and New Zealand and remaining in the Australian Top10 over 15 weeks.\n \n <strong>Music video</strong>\n \n The music video for the single &quot;Candyman&quot; was filmed on January 28, 2007. It was directed by Matthew Rolston and co-directed by Aguilera. It is based on a 1940s World War II theme, and Aguilera rented out an airport in Spain to film it. In the music video, she dances and sings in three different hair colors - red, blonde and brown, as if she were in a singing trio, a tribute to the Andrews Sisters. In another scene, she appears as the famous biceps-flexing factory worker Rosie the Riveter from Westinghouse's We can do it poster. Finally, she appears in scenes inspired by pin-up girls Judy Garland, Betty Grable, and Rita Hayworth. The video also features product placement for Campari. Benji Schwimmer, 2006 winner of So You Think You Can Dance, makes a cameo appearance as Aguilera's GI dance partner. Lacey Schwimmer, Benji's sister and also a contestant on So You Think You Can Dance, had also appeared in the video as a jitterbugger.\n \n Aguilera asked Rolston to co-direct the video with her after he worked with her for a photo shoot for the cover of Rolling Stone. Shooting the sequences of Aguilera as a singing trio took the longest since they had to be shot for each hair color and camera angle, which was computer controlled for precision. The choreography was carefully arranged so that none of the versions overlapped and the takes could be spliced together. The color scheme is based on Technicolor films, focusing on primary colors and bright secondary colors.\n \n On February 22, 2007, MTV gave the World Premiere of &quot;Candyman&quot; live on TRL and later on MTV's Making The Video. The video debuted at number six on TRL[9] and reached the top of the countdown four times. The video has since gone on to retire at number three, making it Aguilera's ninth video to retire. &quot;Candyman&quot; has garnered Aguilera a MTV Video Music Award nomination for Best Director with co-director Mathew Rolston.\n \n The video has become Aguilera's second most viewed clip on YouTube so far, being watched by over 18 million people.\n \n <strong>Critical response</strong>\n \n Most critics reserved high-praise for the single, while commenting on its highly-sexualized lyrics. Billboard magazine called the single &quot;right raunchy&quot;, but praised it, saying that &quot;Few popular vocalists could pull off such a laudable feat,&quot; and that it has such an &quot;irresistible tempo that radio will have no choice but to sweeten airwaves with 'Candyman.The one problem was that radio didn't play the song as it was requested and that's what kept it from rising to the top of the USA charts.'&quot; Bill Lame with About.com found that &quot;listeners may want to be alerted to the sexual content,&quot; but concluded &quot;Aguilera continues to demonstrate she is one of the top female artists in the business.&quot; Yahoo! Music called the song &quot;a good-time 1940's big band romp,&quot; and gave it eight out of ten stars.\n \n The 1940's <a href=\"http://www.last.fm/music/The+Andrews+Sisters\" class=\"bbcode_artist\">The Andrews Sisters</a> inspired track 'Candyman' is a far cry from the singer's '<a title=\"Christina Aguilera &ndash; Dirrty\" href=\"http://www.last.fm/music/Christina+Aguilera/_/Dirrty\" class=\"bbcode_track\">Dirrty</a>' days – it was co-written and produced by <a href=\"http://www.last.fm/music/Linda+Perry\" class=\"bbcode_artist\">Linda Perry</a> who created the 2003 chart-topper '<a title=\"Christina Aguilera &ndash; Beautiful\" href=\"http://www.last.fm/music/Christina+Aguilera/_/Beautiful\" class=\"bbcode_track\">Beautiful</a>'. The now-married Christina is sporting a much more sophisticated image on her latest album '<a title=\"Christina Aguilera - Back to Basics\" href=\"http://www.last.fm/music/Christina+Aguilera/Back+to+Basics\" class=\"bbcode_album\">Back to Basics</a>'.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Candyman&quot; is a swing jazz song written by Christina Aguilera and Linda Perry for Aguilera's third studio album, Back to Basics. It was released as the album's third and final American single in early 2007. In December 2007, it received a Grammy Award nomination for Best Female Pop Vocal Performance.  Background and writing  Perry and Aguilera have said that the song is new lyrics to music that is a new arrangement of <a href=\"http://www.last.fm/music/The+Andrews+Sisters\" class=\"bbcode_artist\">The Andrews Sisters</a>' 1941 hit &quot;<a title=\"The Andrews Sisters &ndash; Boogie Woogie Bugle Boy\" href=\"http://www.last.fm/music/The+Andrews+Sisters/_/Boogie+Woogie+Bugle+Boy\" class=\"bbcode_track\">Boogie Woogie Bugle Boy</a>&quot;.  Critics are usually complimentary towards Aguilera for her authentic replication of the old style. ", "published": "Tue, 16 Apr 2013 16:47:37 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Candyman", "artist": {"url": "http://www.last.fm/music/Christina+Aguilera", "mbid": "b202beb7-99bd-47e7-8b72-195c8d72ebdd", "name": "Christina Aguilera"}, "url": "http://www.last.fm/music/Christina+Aguilera/_/Candyman", "listeners": "429133", "comments": ["Best song", "best single, best video, she's the best!", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [34] ♥", "Good things come for boys who wait", "for me her best song", "Good music....", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [33] ♥", "SWEET SUGAR CANDYMAN ♥", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [32] ♥", "feel good music [2]", "feel good music", "fave xtina video", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [31] ♥", "pin up!", "good song,kann man gut dancen", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [30] ♥", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [29]  ♥", "HEYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYYY (10 Second E5 Note) When your favorite Gonna do it? [28]     haha ♥", "Great song <3", "There's nothing more dangerous than a boy with charm. ♥"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/christina%20aguilera", "name": "christina aguilera"}, {"url": "http://www.last.fm/tag/swing", "name": "swing"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "02d76450-eae6-4f13-af90-b2a7189bb148", "duration": "193000", "playcount": "2318393", "id": "44207243"}}