{"track": {"album": {"@attr": {"position": "1"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Elton+John/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/80757967.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/80757967.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/80757967.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/80757967.png", "size": "extralarge"}], "artist": "Elton John", "mbid": "c6ea842d-3e3f-4725-962d-93628f9d6a0a"}, "wiki": {"content": "&quot;<strong>Your Song</strong>&quot; is a ballad composed and performed by musician Elton John. The song's lyrics were written by Bernie Taupin. According to the <a href=\"http://www.songfacts.com/detail.php?id=390\" rel=\"nofollow\">Your Song Songfacts</a>, he wrote them over breakfast at John's parents' house, where he was living. The original lyrics have coffee stains on them. It appeared on John's self-titled second album in 1970.\n \n The song was released in the U.S. in October 1970 as the B-side to &quot;Take Me to the Pilot&quot;. Both received airplay, but &quot;Your Song&quot; was preferred by disc jockeys and replaced &quot;Take Me to the Pilot&quot; as the A-side, eventually making both the UK and U.S. top ten charts.\n \n <strong>Composition and inspiration</strong>\n \n &quot;Your Song&quot; is a soft blend of two different styles: folk and jazz: &quot;I hope you don't mind / I hope you don't mind / That I put down in words / How wonderful life is while you're in the world.&quot; The instrumental focus is on John's Leon Russell-influenced piano work, along with acoustic guitar, Paul Buckmaster's string accompaniment, and a shuffling rhythm section.\n \n The lyrics express the romantic thoughts of an innocent. Taupin offers a straightforward love-song lyric at the beginning: &quot;It's a little bit funny this feeling inside / I'm not one of those who can easily hide / I don't have much money but boy if I did / I'd buy a big house where we both could live.&quot; At times the self-deprecating narrator stumbles to get out his feelings, which despite being a melodramatic device, Allmusic calls &quot;effective and sweet&quot;: &quot;So excuse me forgetting but these things I do / You see I've forgotten if they're green or they're blue / Anyway the thing is what I really mean / Yours are the sweetest eyes I've ever seen / And you can tell everybody this is your song / It may be quite simple but now that it's done.&quot;\n \n The song was part of a stockpile of songs John and Taupin wrote in 1969 while living together. John pinpoints his composition of the music to October 27. Supposedly, it took him only ten minutes. Taupin had penned the lyrics earlier that day over breakfast. John cites the song as one of his favourites, and plays it at many of his concerts. In an interview, he commented that &quot;[he doesn't] think [he has] written a love song as good since&quot;.\n \n &quot;Your Song&quot; was itself the inspiration for the song &quot;We All Fall in Love Sometimes&quot; on John's 1975 album Captain Fantastic and the Brown Dirt Cowboy.\n \n <strong>Reception</strong>\n \n &quot;Your Song&quot; was praised by critics upon release and in subsequent years. Allmusic has stated that it &quot;is a near-perfect song&quot;. John Lennon (formerly of The Beatles) stated the song is &quot;the first new thing that's happened since we happened.&quot; Rolling Stone called the song a &quot;pretty McCartneyesque ballad&quot;. In 2004 Rolling Stone included the song in their 2004 list of 500 Greatest Songs of All Time at #136.\n \n <strong>Chart performance and impact</strong>\n \n The song was John's first pop hit. It rose to #8 on the Billboard Hot 100,[4] and in the UK peaked at #7. In 2002, John rerecorded the song as a duet with opera singer Alessandro Safina for the first Sport Relief charity telethon, and it reached #4 in the UK.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Your Song&quot; is a ballad composed and performed by musician Elton John. The song's lyrics were written by Bernie Taupin. According to the <a href=\"http://www.songfacts.com/detail.php?id=390\" rel=\"nofollow\">Your Song Songfacts</a>, he wrote them over breakfast at John's parents' house, where he was living. The original lyrics have coffee stains on them. It appeared on John's self-titled second album in 1970.  The song was released in the U.S. in October 1970 as the B-side to &quot;Take Me to the Pilot&quot;. Both received airplay, but &quot;Your Song&quot; was preferred by disc jockeys and replaced &quot;Take Me to the Pilot&quot; as the A-side, eventually making both the UK and U.", "published": "Tue, 23 Nov 2010 18:22:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Your Song", "artist": {"url": "http://www.last.fm/music/Elton+John", "mbid": "334c2c2c-2ae3-4b69-8f38-167d07f83d25", "name": "Elton John"}, "url": "http://www.last.fm/music/Elton+John/_/Your+Song", "listeners": "526767", "comments": ["klassiker", "No, I don't mind.", "yes,,, TIMELESS!", "Timeless [2]", "timeless", "Very nice.", "I've always loved this track. Simply timeless!", "Nice!", "Yours are the sweetest eyes I've ever seen. \r\nYup they are.", "I love, love, love! Whoooooooooooooooooo! Spank! Elton has no clue! I have Loved him forever! Talent!~ ~!", "Spank! This Man has worked forever! I love his talent and tune! :-)", "love ♥", "水 *.* 水 *.* 代 *.* 代 *.**.**.* 挤 *.* 挤 *.* ☼ *.* ☼", "\"If I were a sculptor,heh heh.\". ..Always loved that line. ( :", "One of the only love songs that could actually woo a woman.", "Makes me smile", "Hola quiero saber si solo puedo escuchar música o puedo descargarlos también y como gracias", "One! of my favorite songs of all time man", "Elton John is super great.", "♥"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/elton%20john", "name": "elton john"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/piano", "name": "piano"}]}, "mbid": "02e80856-4c7f-41f0-b2d1-314927782c0f", "duration": "240000", "playcount": "2363912", "id": "1016174"}}