{"track": {"album": {"@attr": {"position": "1"}, "title": "Falling Into You", "url": "http://www.last.fm/music/C%C3%A9line+Dion/Falling+Into+You", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/44486327.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/44486327.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/44486327.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/44486327.png", "size": "extralarge"}], "artist": "Céline Dion", "mbid": "16612555-afa6-4196-a184-2b255a22f712"}, "wiki": {"content": "“It's All Coming Back to Me Now” is a cover version of the original Pandora's box song, written by Jim Steiman. According to Steinman the song was inspired by Wuthering Heights, and was an attempt to write &quot;the most passionate, romantic song&quot; he could ever create. Meat Loaf has said the song was intended for Bat out of Hell II and given to the singer in 1986, but that they both decided to use &quot;I'd Do Anything for Love (But I Won't Do That)&quot; for Bat II, and save this song for Bat III.\n \n Celine Dion released the song on her &quot;Falling into you&quot; album on July 29, 1996.\n \n The song was the first on Dion's album Falling into You. Steinman produced the track, with Steven Rinkoff and Roy Bittan as co-producers. Bat out of Hell and Meat Loaf collaborators Todd Rundgren, Eric Troyer, Rory Dodd, Glen Burtnick and Kasim Sulton provided backing vocals. The single version of &quot;It's All Coming Back to Me Now&quot; was included also on Dion's greatest hits: All the Way… A Decade of Song (1999) and My Love: Essential Collection (2008), while the song itself was a smash hit around the world, reaching No. 1 in Belgium (5 weeks at the top), No. 2 in the United States, Canada and Ireland, No. 3 in the United Kingdom, No. 5 in the Netherlands, and so on. It has sold 1,180,000 copies in the U.S. and was certified platinum, as well as being certified gold in Australia (35,000) and New Zealand (5,000), and silver in the UK (350,000). The track reached No. 1 in some other American charts, such as Billboard Hot 100 Airplay (2 weeks), Hot Adult Contemporary Tracks (5 weeks) or Top 40 Mainstream (1 week). It also peaked at No. 3 on the Hot 100 Singles Sales. &quot;It's All Coming Back to Me Now&quot; topped the Canadian Adult Contemporary Chart as well.\n \n Finally, it was also recorded as a duet by Meat Loaf and Marion Raven for the album Bat out of Hell III: The Monster Is Loose, produced by Desmond Child. Raven had been working on her solo album with Child, and was chosen because the timbre of her voice starkly contrasts to Meat Loaf's. In promotional interviews, Meat Loaf said that &quot;I believe that the version that Marion Raven and myself did on this album is the definitive version.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "“It's All Coming Back to Me Now” is a cover version of the original Pandora's box song, written by Jim Steiman. According to Steinman the song was inspired by Wuthering Heights, and was an attempt to write &quot;the most passionate, romantic song&quot; he could ever create. Meat Loaf has said the song was intended for Bat out of Hell II and given to the singer in 1986, but that they both decided to use &quot;I'd Do Anything for Love (But I Won't Do That)&quot; for Bat II, and save this song for Bat III.  Celine Dion released the song on her &quot;Falling into you&quot; album on July 29, 1996. ", "published": "Mon, 16 Feb 2009 21:51:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "It's All Coming Back to Me Now", "artist": {"url": "http://www.last.fm/music/C%C3%A9line+Dion", "mbid": "847e8a0c-cc20-4213-9e16-975515c2a926", "name": "Céline Dion"}, "url": "http://www.last.fm/music/C%C3%A9line+Dion/_/It%27s+All+Coming+Back+to+Me+Now", "listeners": "118991", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/celine%20dion", "name": "celine dion"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/ballad", "name": "ballad"}]}, "mbid": "032658ec-a0cb-479b-af00-33bdf275b8e6", "duration": "456000", "playcount": "561547", "id": "4068536"}}