{"track": {"album": {"@attr": {"position": "16"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Elton+John/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/80757967.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/80757967.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/80757967.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/80757967.png", "size": "extralarge"}], "artist": "Elton John", "mbid": "c6ea842d-3e3f-4725-962d-93628f9d6a0a"}, "wiki": {"content": "&quot;Don't Go Breaking My Heart&quot; is a duet by Elton John and Kiki Dee. It was written by Elton John without Bernie Taupin under the pseudonym &quot;Ann Orson&quot; and &quot;Carte Blanche&quot; (a pun on the expression &quot;an horse and cart, blanche&quot;), and intended as an affectionate pastiche of the Tamla Motown style, notably the various duets recorded by Marvin Gaye and singers such as Tammi Terrell and Kim Weston. It is not to be confused with the Burt Bacharach/Hal David song of the same title recorded in 1966 by Dionne Warwick.\n \n Like many of Elton John's singles from the 1970s, it was never included on any of his original albums (though it was recorded during the same sessions that produced Blue Moves). However, it was included on the original version of Elton John's Greatest Hits Volume II in 1977. It has since been shifted to the &quot;Volume 3&quot; compilation, Greatest Hits 1976–1986. In 2002, it also appeared on Elton John's 2-disc greatest hits album, Elton John's Greatest Hits 1970-2002. A demo version of the song was recorded by John as a solo artist. This version has not been released commercially. The song was also covered by Ol' Dirty Bastard with Macy Gray, and by Anne Hathaway and Jesse McCartney for the 2004 film Ella Enchanted and its soundtrack.\n \n &quot;Don't Go Breaking My Heart&quot; was also John's first No. 1 single in the UK, topping the chart for six weeks in mid 1976. He would not enjoy a solo British chart-topper until 1990. It also became his sixth No. 1 single in the US, topping the Billboard Hot 100 for four weeks.\n \n The b-side &quot;Snow Queen&quot; has yet to be released on CD.[citation needed] The song was supposedly inspired by Cher, with Elton's improvising past Sonny &amp; Cher hits I Got You Babe, and The Beat Goes On as well as the solo Cher song Bang Bang (My Baby Shot Me Down) during the fadeout of the song.\n \n In 1985, John and Dee performed the track to the crowd at Wembley Stadium during John's set at Live Aid (where Dee sang backup). In 1987, Elton appeared with Minnie Mouse on the NBC series Totally Minnie performing the track. Almost 20 years after the initial release, John re-recorded the song with RuPaul and re-issued it. He also performed it with the Spice Girls on his ITV tribute programme An Audience With Elton John.\n \n The song’s promotional film has been cited among the cheapest music videos ever produced[citation needed]. The circumstances behind its conception were detailed on an episode of Pop-Up Video. The video’s director was found in the midst of filming a Rod Stewart television special. He was pulled aside, located an unused soundstage, hastily dressed it to give the appearance of a recording studio, setup three cameras and had the two singers pretend to record their vocals. Shot in a single take while being told to ‘improvise’, Elton John and Kiki Dee often missed their cues and John’s attempt to lead Dee in a very haphazard dance sequence caught his companion off guard.\n \n \n \n \n \n \n \n \n \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Don't Go Breaking My Heart&quot; is a duet by Elton John and Kiki Dee. It was written by Elton John without Bernie Taupin under the pseudonym &quot;Ann Orson&quot; and &quot;Carte Blanche&quot; (a pun on the expression &quot;an horse and cart, blanche&quot;), and intended as an affectionate pastiche of the Tamla Motown style, notably the various duets recorded by Marvin Gaye and singers such as Tammi Terrell and Kim Weston. It is not to be confused with the Burt Bacharach/Hal David song of the same title recorded in 1966 by Dionne Warwick. ", "published": "Fri, 22 Oct 2010 01:15:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Don't Go Breaking My Heart", "artist": {"url": "http://www.last.fm/music/Elton+John", "mbid": "334c2c2c-2ae3-4b69-8f38-167d07f83d25", "name": "Elton John"}, "url": "http://www.last.fm/music/Elton+John/_/Don%27t+Go+Breaking+My+Heart", "listeners": "106664", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/70s", "name": "70s"}, {"url": "http://www.last.fm/tag/duets", "name": "duets"}, {"url": "http://www.last.fm/tag/elton%20john", "name": "elton john"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "mbid": "05923cfc-25ac-4122-abc1-9a6c2fc2f644", "duration": "274000", "playcount": "339444", "id": "1265568"}}