{"track": {"album": {"@attr": {"position": "1"}, "title": "Confessions on a Dance Floor", "url": "http://www.last.fm/music/Madonna/Confessions+on+a+Dance+Floor", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87971881.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87971881.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87971881.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87971881.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "8eb5bdf9-9679-4916-869e-3becfa427599"}, "wiki": {"content": "&quot;Hung Up&quot; is a electropop song written by American singer-songwriter Madonna, Stuart Price, Benny Andersson and Björn Ulvaeus, and produced by Madonna and Price. The song was released in October 2005, the first single to be lifted from Madonna's tenth studio album Confessions on a Dance Floor.\n &quot;Hung Up&quot; is Madonna's biggest selling single to date, reaching number one in a record-breaking 45 countries.\n \n <strong>Song information</strong>\n \n &quot;Hung Up&quot; was inspired by the 1970s disco era, in particular ABBA, <a href=\"http://www.last.fm/music/Giorgio+Moroder\" class=\"bbcode_artist\">Giorgio Moroder</a> and Saturday Night Fever. A sample of <a href=\"http://www.last.fm/music/ABBA\" class=\"bbcode_artist\">ABBA</a>'s 1979 hit &quot;<a title=\"ABBA &ndash; Gimme! Gimme! Gimme! (A Man After Midnight)\" href=\"http://www.last.fm/music/ABBA/_/Gimme!+Gimme!+Gimme!+(A+Man+After+Midnight)\" class=\"bbcode_track\">Gimme! Gimme! Gimme! (A Man After Midnight)</a>&quot; featuring a flute hook forms the basis of the song. After The <a href=\"http://www.last.fm/music/Fugees\" class=\"bbcode_artist\">Fugees</a>, who got written permission to sample a bit from <a title=\"ABBA &ndash; The Name of the Game\" href=\"http://www.last.fm/music/ABBA/_/The+Name+of+the+Game\" class=\"bbcode_track\">The Name of the Game</a> for their 1996 hit &quot;<a title=\"Fugees &ndash; Rumble in the Jungle\" href=\"http://www.last.fm/music/Fugees/_/Rumble+in+the+Jungle\" class=\"bbcode_track\">Rumble in the Jungle</a>&quot;,  Madonna is only the second artist the Swedish band has allowed to sample its music, as ABBA songwriters Benny Andersson and Bjorn Ulvaeus have a strict &quot;no sample&quot; policy.\n \n According to Madonna, she approached Andersson and Ulvaeus by sending her &quot;emissary to Stockholm with a letter and the record imploring them, telling them how much I worship their music; telling them it was a homage to them, which is all true&quot;. Andersson and Ulvaeus quickly gave their permission. They stated, &quot;'Hung Up' is really good. If it wasn't any good we would not have said yes. It is a wonderful track - 100% solid pop music.&quot;  Andersson and Ulvaeus asked for co-writer credits and a percentage of the profits.\n \n Following the ABBA reunion at the Swedish premiere of &quot;Mamma Mia!&quot; on July 4, 2008, Ulvaeus spoke to the Sunday Telegraph about the song. &quot;Madonna wrote a very, very nice letter saying please please we have had a wonderful idea which involves Gimme Gimme,&quot; Ulvaeus said. &quot;We said we would have to listen to it first but after half a minute I knew it was brilliant. That is one of the few we have allowed. Five years earlier we said yes to the Fugees. But to everyone else we said No. I think the Madonna record shows that ABBA is part of the DNA set up of Pop.&quot;\n \n Madonna also samples herself in the song, with references to her previous recordings in the lyrics, including &quot;Don't Cry for Me Argentina&quot; and &quot;Love Song&quot; (her 1989 duet with Prince).\n \n &quot;Hung Up&quot; became Madonna's first single to be released digitally through online stores before a physical format was available.\n \n Madonna opened the 2005 MTV Europe Music Awards and the 2006 Grammy Awards with &quot;Hung Up&quot;. She also performed this song at the Coachella Valley Music and Arts Festival in Indio, California, and it was the finale for her Confessions Tour, (available in DVD/CD). She also ended the London leg of Live Earth concert with &quot;Hung Up&quot;. A rock version of the song was included in her 2008 world tour, the Sticky &amp; Sweet Tour in the closing segment.\n \n The song was used on the commercial for Motorola which also features Madonna in the commercial. The song also appeares in two related television series episodes in a CSI: Miami and CSI: NY crossover. Both episodes feature Carlos Leon.\n \n In Costa Rica, the song had a limited edition re-release of the CD single in January 2009. It was released along with Madonna's third single from Hard Candy, &quot;Miles Away&quot;.\n \n <strong>Chart performance</strong>\n \n &quot;Hung Up&quot; reached number one in 45 countries, Madonna's first international chart-topper since &quot;Music&quot; in 2000.\n \n In the United States, &quot;Hung Up&quot; debuted at #20 on the Billboard Hot 100 — one of the highest debuts of 2005 — due to strong digital downloads. It became Madonna's 36th Top 10 single when it reached #7, tying her with <a href=\"http://www.last.fm/music/Elvis+Presley\" class=\"bbcode_artist\">Elvis Presley</a>'s record of 36 Top 10 hits. Its success was also significant as her previous three singles failed to reach the Billboard Hot 100. &quot;Hung Up&quot; went on to become her biggest single since &quot;Die Another Day&quot; in late 2002.\n \n In the UK, &quot;Hung Up&quot; debuted at number one, where it remained for three weeks, Madonna's 11th number one single there. It remained in the chart for 29 weeks, her longest run on the singles chart. It spent what was at the time a record seven weeks at number-one on the UK Download Chart. Upon the 2008 release of 4 Minutes, Madonna's first single from her 11th studio album Hard Candy, Hung Up re-entered the UK Charts at #183 and has since peaked at #153 on the May 18th chart.\n \n In France, &quot;Hung Up&quot; debuted at number one, where it remained for five non-consecutive weeks, becoming one of her biggest selling songs in the French market to date.\n \n In Germany, &quot;Hung Up&quot; debuted at number one and stayed on the top position for 9 weeks.\n &quot;Hung Up&quot; also reached number one in Australia (one week, and the tenth chart-topper of her career), \n \n Canada (fifteen weeks, her longest stay atop the singles chart), and South Africa (two weeks). In Italy, &quot;Hung Up&quot; spent 14 consecutive weeks at the top of the chart.\n \n In Latin America, &quot;Hung Up&quot; topped the chart for eight weeks in a row, and spent 15 weeks in the Top 10. It was also Madonna's first number one on the Latin American chart.\n \n In Russia, &quot;Hung Up&quot; became Madonna's first number one single and the second song by an American artist to reach number-one (the first being <a href=\"http://www.last.fm/music/Cher\" class=\"bbcode_artist\">Cher</a> with her 2001 hit single &quot;<a title=\"Cher &ndash; The Music's No Good Without You\" href=\"http://www.last.fm/music/Cher/_/The+Music%27s+No+Good+Without+You\" class=\"bbcode_track\">The Music's No Good Without You</a>&quot;).  It is also the longest chart run at number-one for a song performed in a language other than Russian.\n \n In Romania, the song debuted at #65 reaching No.1 after only 7 weeks, and stayed in the top spot for 9 consecutive weeks. It's also her first #1 since Die Another Day.\n \n Due to the single's worldwide success, it currently holds the record of reaching the number-one position in the most countries for a single. This record was listed in the 2007 edition of &quot;Guinness Book of World Records&quot;.  &quot;Hung Up&quot; is also the second biggest-selling dance single of all time. With this song, Madonna achieved her 25th gold single, surpassing the Beatles for the most gold singles of all time.\n \n <strong>Music video</strong>\n \n Originally the video for &quot;Hung Up&quot; was scheduled to be directed by photographer David LaChapelle. LaChapelle wanted the video to have a &quot;documentary&quot;-style look, much like that of his film Rize, of which five of the dancers in the &quot;Hung Up&quot; video appeared. LaChapelle and Madonna disagreed on the concept, prompting the project to be reassigned to Johan Renck. The video was filmed from October 8-10, 2005 at Pineapple Dance Studios, Great Guildford Street SE1, Redcross Way SE1, the London Underground and Trocadero Centre, while other location scenes were shot in Los Angeles, California. Most of the dancers that appeared in the video followed Madonna on tour and also appeared in the music video for the follow up single, &quot;Sorry&quot;.\n \n Madonna broke eight bones in a horseback-riding accident a few weeks before shooting the video for &quot;Hung Up&quot;. She stated: &quot;When I shot the video, none of the bones had gone together. Pharmaceuticals and my will got me through the shoot.&quot;\n \n The video also contained several scenes of the physical discipline parkour. It premiered worldwide on October 27, 2005. It was nominated for five MTV Video Music Awards and two MuchMusic Video Awards in 2006.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Hung Up&quot; is a electropop song written by American singer-songwriter Madonna, Stuart Price, Benny Andersson and Björn Ulvaeus, and produced by Madonna and Price. The song was released in October 2005, the first single to be lifted from Madonna's tenth studio album Confessions on a Dance Floor.\n &quot;Hung Up&quot; is Madonna's biggest selling single to date, reaching number one in a record-breaking 45 countries.  Song information  ", "published": "Tue, 10 Nov 2009 11:43:31 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Hung Up", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Hung+Up", "listeners": "519743", "toptags": {"tag": [{"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/disco", "name": "disco"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "059debe6-26b4-4e2f-bae6-0b5a42207658", "duration": "336000", "playcount": "3342899", "id": "24409932"}}