{"track": {"album": {"@attr": {"position": "3"}, "title": "Let Go", "url": "http://www.last.fm/music/Avril+Lavigne/Let+Go", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90850477.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90850477.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90850477.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90850477.png", "size": "extralarge"}], "artist": "Avril Lavigne", "mbid": "1fa4bdc1-cd16-4bcb-bc41-f3e4338b6701"}, "wiki": {"content": "&quot;Sk8er Boi&quot; is a song by Avril Lavigne, and was the second single from her debut album, Let Go (2002). It was written by Avril Lavigne and The Matrix (Scott Spock, Lauren Christy, and Graham Edwards), and produced by The Matrix. Released in 2002, the single reached number ten on the United States Billboard Hot 100 (becoming Lavigne's second top ten single there), number eight in the United Kingdom, number three in Australia, number thirteen in Canada and number one in Spain, becoming her second successful song to date after Girlfriend and Complicated.\n \n During a 2008 interview Lavigne confirmed the song was about the award-winning performance poet Gerard McKeown, who she had not met, but had seen him performing in Belfast, Northern Ireland while on tour there.\n \n The music video, directed by Francis Lawrence, begins with a man in the alley of a city with a pile of spray paint on the ground. The video continues with posters that have a star on them advertising a concert Lavigne hosts, where people use their cars and amps to have the concert on the streets. The police arrive and attempt to stop it. At the end of the video, Lavigne crashes her guitar into the car windscreen and a helicopter appears overhead.\n \n While singing, Lavigne wears a t-shirt with the logo for Wilkesboro Elementary School, a North Carolina elementary school. After the video was released, the school was flooded with so many requests for the t-shirts that they were able to buy computers with the extra revenue from t-shirt sales.\n \n The compilation album A Japanese Tribute to Avril Lavigne features a cover version of &quot;Sk8er Boi&quot; by Becky. Eurodance group Cascada recorded a dance cover of the song for the European and Japanese editions of their 2007 album Perfect Day. A cover version of the song by Angela Michael appears in the video game Elite Beat Agents for the Nintendo DS. The song is also included in SingStar Pop, a PlayStation 2 game.\n \n &quot;Sk8er Boi&quot; is featured in the television series Cold Case (Season 3, &quot;The Promise&quot;, October 2, 2005). In the HBO miniseries Generation Kill, a U.S. Marine sings the song during the episode &quot;Get Some&quot;.\n \n In 2003, Paramount Pictures optioned the song for adaptation into a feature film.[4] As of April 2008, the film has apparently been abandoned or is in development hell.[5]\n \n Also in 2003, Australian Sketch Show Big Bite did a sendup of Sk8ter Boi that was called 'It's just the sales boy'.\n \n In 2006, Criterion Games included the song in Burnout Paradise. The song was cited in many reviews as one of the worst shortcomings of the game. However, the song can be removed from the game's music playlist and both the Xbox 360 and Playstation 3 versions of the game support custom soundtracks.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Sk8er Boi&quot; is a song by Avril Lavigne, and was the second single from her debut album, Let Go (2002). It was written by Avril Lavigne and The Matrix (Scott Spock, Lauren Christy, and Graham Edwards), and produced by The Matrix. Released in 2002, the single reached number ten on the United States Billboard Hot 100 (becoming Lavigne's second top ten single there), number eight in the United Kingdom, number three in Australia, number thirteen in Canada and number one in Spain, becoming her second successful song to date after Girlfriend and Complicated. ", "published": "Thu, 5 Mar 2009 23:04:22 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Sk8er Boi", "artist": {"url": "http://www.last.fm/music/Avril+Lavigne", "mbid": "0103c1cc-4a09-4a5d-a344-56ad99a77193", "name": "Avril Lavigne"}, "url": "http://www.last.fm/music/Avril+Lavigne/_/Sk8er+Boi", "listeners": "331785", "comments": ["not bad like her first album", "My childhood [28]", "lmaoooo fuck i loved this song", "I was pleasantly surprised that they played this on kiss fm rather than the same five songs they always play OVER again.", "sweet revenge..  That's what this song is allll about LOL", "My childhood [27]", "memories ; ;", "My childhood [26]", "Nice....", "My childhood [25] yup.", "My childhood [24]", "My childhood [22]", "<3", "<3", "My childhood [21]", "I wish we had more music like THIS now in 2012. :( [4]", "My childhood [20]", "i see the soul that is inside", "My childhood [19] sdds dessa época <3", "Does your pretty face see what he's worth?"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/pop%20rock", "name": "pop rock"}, {"url": "http://www.last.fm/tag/avril%20lavigne", "name": "avril lavigne"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "05abff48-b624-4a73-b8e7-49fb5b38bdd3", "duration": "202000", "playcount": "1850764", "id": "1022678"}}