{"track": {"album": {"@attr": {"position": "16"}, "title": "The Best Of Culture Club", "url": "http://www.last.fm/music/Culture+Club/The+Best+Of+Culture+Club", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92176985.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92176985.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92176985.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92176985.png", "size": "extralarge"}], "artist": "Culture Club", "mbid": "8680e61c-7e6b-4dc3-a42d-cd2172de3bb5"}, "wiki": {"content": "&quot;Karma Chameleon&quot; is a song from British band Culture Club. The song spent three weeks at number one on the US Billboard Hot 100 in 1984 (see 1984 in music), becoming the group's biggest hit and only US number one. The song hit number one in sixteen countries worldwide. In their home country, the single became Culture Club's second song to top the UK singles chart, staying there for six weeks in September and October 1983 and becoming the biggest selling single of 1983. The single came from their 1983 Colour by Numbers album.\n \n The B-side of &quot;Karma Chameleon&quot; is &quot;That's the Way (I'm Only Trying to Help You)&quot; (in an alternate and shorter version). In an interview, Boy George explained: &quot;The song is about the terrible fear of alienation that people have, the fear of standing up for one thing. It's about trying to suck up to everybody. Basically, if you aren't true, if you don't act like you feel, then you get Karma-justice, that's nature's way of paying you back.&quot; \n \n The prominent harmonica part was played by Judd Lander, who had been a member of Merseybeat group The Hideaways in the 1960s. He had also played the harmonica part on &quot;Church of the Poison Mind&quot;, and would later play on the <a href=\"http://www.last.fm/music/Spice+Girls\" class=\"bbcode_artist\">Spice Girls</a> 1996 hit &quot;<a title=\"Spice Girls &ndash; Say You'll Be There\" href=\"http://www.last.fm/music/Spice+Girls/_/Say+You%27ll+Be+There\" class=\"bbcode_track\">Say You'll Be There</a>&quot;.\n \n The song was originally to be called &quot;Cameo Chameleon&quot;. The band were recorded in interviews in late 1983 stating this was to be the title of their next single.\n \n In 2006, the Labour Party used Karma Chameleon as the theme song for a series of political advertisements against Conservative party leader David Cameron in the 2006 UK Elections.\n \n In the Internet game RuneScape, the character Party Pete has a pet Chameleon named Karma; a reference to the song.\n \n The song won Best British Single at the 1984 Brit Awards.\n \n <strong>Music video</strong>\n \n The &quot;Karma Chameleon&quot; music video is set in Mississippi in 1870, according to caption. It depicts people in colourful costumes, including dancers in &quot;red, gold and green&quot;, waiting on a riverbank. Boy George is dressed in a colourful costume and is depicted singing the title song. A pickpocket is seen wandering through the crowd.\n \n A riverboat, &quot;The Chameleon&quot;, arrives and people board. A game of cards takes place, with Boy George still singing in the background. The pickpocket is discovered cheating and is forced to walk the plank. Throughout the video, black and white people are depicted singing and dancing together.\n \n The boat used in the video belongs to Turk Launches of Kingston-upon-Thames, and it is still in use, mainly on the Kingston to Hampton Court route during the summer months.\n \n It was filmed at Desborough Island in Weybridge during the summer of 1983.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Karma Chameleon&quot; is a song from British band Culture Club. The song spent three weeks at number one on the US Billboard Hot 100 in 1984 (see 1984 in music), becoming the group's biggest hit and only US number one. The song hit number one in sixteen countries worldwide. In their home country, the single became Culture Club's second song to top the UK singles chart, staying there for six weeks in September and October 1983 and becoming the biggest selling single of 1983. The single came from their 1983 Colour by Numbers album. ", "published": "Sun, 19 Apr 2009 20:20:23 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Karma Chameleon", "artist": {"url": "http://www.last.fm/music/Culture+Club", "mbid": "81435053-e1a2-48a4-adfd-e89f310c7b38", "name": "Culture Club"}, "url": "http://www.last.fm/music/Culture+Club/_/Karma+Chameleon", "listeners": "288868", "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/new%20wave", "name": "new wave"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/culture%20club", "name": "culture club"}]}, "mbid": "069cad30-f59d-4ae6-8aab-91e8eb29cdc5", "duration": "246000", "playcount": "1131060", "id": "1057885"}}