{"track": {"album": {"@attr": {"position": "12"}, "title": "Number Ones", "url": "http://www.last.fm/music/Michael+Jackson/Number+Ones", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/30645577.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/30645577.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/30645577.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/30645577.png", "size": "extralarge"}], "artist": "Michael Jackson", "mbid": "340bd9c2-14e5-4dec-b002-6599e953b7c3"}, "wiki": {"content": "&quot;Black or White&quot; is the lead single from Michael Jackson's Dangerous album. It was released in November, 11 1991. &quot;Black or White&quot; is a mix of rock, and dance-pop.Written, composed, and arranged by Jackson with the rap lyrics by Bill Bottrell, it is a song that promotes racial harmony. The song's introduction and main riff are performed by guitarist Slash and Bill Bottrell.\n \n The song peaked at number one on the US Billboard Hot 100, the UK Singles Chart and in 20 other countries. It reached #1 on many singles charts in 1991, as well as becoming the second-best selling single of 1991.\n \n To prepare the audience for the special occasion of the televised premiere of the &quot;Black or White&quot; video, Epic records released the song (without the accompanying images) to radio stations just two days in advance. In a period of twenty-four hours, &quot;Black or White&quot;, described by the record company as &quot;a rock 'n' roll dance song about racial harmony&quot;, had been added to the playlists of 96 percent of 237 of the United States of America's top forty radio stations the first day of release.\n \n &quot;Black or White&quot; was the first single off of Dangerous, produced by Michael Jackson and Bill Bottrell, it began to be promoted on radio stations the first week of November 1991 in New York and Los Angeles. &quot;Black or White&quot; was officially released one week later. It was written and composed by Jackson with rap lyrics by Bill Bottrell, the song's introduction and main riff were played by Guns N' Roses guitarist Slash and Bill Bottrell.\n \n &quot;Black or White&quot; is also described as a mix of hard rock, dance and rap, but basically it is a hard rock song like &quot;Beat It&quot;. These songs are also compared by Rolling Stone's Allan Light in his Dangerous review, he says, &quot;Neither this slow-burn solo nor the Stones-derived riff on 'Black or White' offers the catharsis of Eddie Van Halen's blazing break on 'Beat It'&quot;.\n \n &quot;Black or White&quot; stormed into Billboard's Hot 100 at number thirty five. A week later it shot up to number three and on its third week, December 7 1991, it ascended to number one, making it the fastest chart topper since the Beatles' &quot;Get Back&quot; also won the Hot 100 in just three weeks in 1969. It achieved the year at number one, and remained at the top of the singles chart into 1992, for a total of seven weeks, making Michael Jackson the first artist to get number one popular hits in the 1970s, 1980s and 1990s.\n \n The single also made an extraordinary and amazing debut in the UK, where it became the first single by an American to go into the singles chart at number one since 1960, when &quot;It's Now Or Never&quot; by Elvis Presley did in the same manner. Around the world, &quot;Black or White&quot; hit number one in the US, UK, Mexico, Cuba, Zimbabwe, Australia, New Zealand, Austria, Belgium, Denmark, Finland, France, Israel, Italy, Norway, Spain, Sweeden, Switzerland and the Euro Chart Hot 100, number two in Germany and number three in Holland. The single was certified platinum in the US, selling over one million copies.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Black or White&quot; is the lead single from Michael Jackson's Dangerous album. It was released in November, 11 1991. &quot;Black or White&quot; is a mix of rock, and dance-pop.Written, composed, and arranged by Jackson with the rap lyrics by Bill Bottrell, it is a song that promotes racial harmony. The song's introduction and main riff are performed by guitarist Slash and Bill Bottrell.  The song peaked at number one on the US Billboard Hot 100, the UK Singles Chart and in 20 other countries. It reached #1 on many singles charts in 1991, as well as becoming the second-best selling single of 1991. ", "published": "Thu, 2 Dec 2010 19:51:11 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Black or White", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Black+or+White", "listeners": "572708", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/michael%20jackson", "name": "michael jackson"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}]}, "mbid": "071fa60b-652a-4d67-b7e4-58a63a1bbe6f", "duration": "201000", "playcount": "2907282", "id": "1094940"}}