{"track": {"album": {"@attr": {"position": "13"}, "title": "Circus (UK Deluxe Edition)", "url": "http://www.last.fm/music/Britney+Spears/Circus+(UK+Deluxe+Edition)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/50946291.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/50946291.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/50946291.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/50946291.png", "size": "extralarge"}], "artist": "Britney Spears", "mbid": ""}, "wiki": {"content": "&quot;Radar&quot; is a song by American recording artist Britney Spears. It was written and produced by Bloodshy &amp; Avant and The Clutch in November 2006 as a record that did not relate to any of her personal problems at the time. The recording sessions took place the day after Spears filed for divorce from Kevin Federline, and members of The Clutch claimed to be surprised by her work ethic. &quot;Radar&quot; was originally planned to be released as the third single from Blackout, but &quot;Break the Ice&quot; was released instead. The song was then planned as the fourth single; in July 2008, a CD single was released in some countries, but a wider release was cancelled. &quot;Radar&quot; was later included as a bonus track on her sixth studio album Circus, and was released in June 2009 as the fourth single from that album.\n \n Musically, &quot;Radar&quot; is an electropop and synthpop song, that runs through a midtempo dance groove. Spears' vocals are auto tuned and accompanied by sonar pulses and a heavy usage of distorted synthesizers. The song is influenced by the works of Rihanna. The lyrics refer to an attraction between the protagonist and a man, while she wonders if he knows what she is feeling. &quot;Radar&quot; received mixed reviews from critics; some called it one of the highlights of Blackout, while others felt that it was over-produced and also criticized her vocals for being processed. In July 2008, &quot;Radar&quot; charted in the top forty of Ireland and New Zealand, and inside the top-ten in Sweden. After it was released as a single from Circus, the track performed poorly on the charts and did not manage to enter the top forty in most countries. However, it became her 21st hit on the US Billboard's Pop Songs chart, the most for any artist of the decade.\n \n The single's accompanying music video was directed by Dave Meyers, and pays tribute to the music video of Madonna's &quot;Take a Bow&quot; (1994). In the video, Spears is an aristocratic woman involved in a love triangle with two men who are polo players. The video received mixed reviews from critics, who complimented the fashion but called the idea unoriginal. &quot;Radar&quot; was performed by Spears at The Circus Starring Britney Spears (2009), with the accompanying dance routine featuring her pole dancing.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Radar&quot; is a song by American recording artist Britney Spears. It was written and produced by Bloodshy &amp; Avant and The Clutch in November 2006 as a record that did not relate to any of her personal problems at the time. The recording sessions took place the day after Spears filed for divorce from Kevin Federline, and members of The Clutch claimed to be surprised by her work ethic. &quot;Radar&quot; was originally planned to be released as the third single from Blackout, but &quot;Break the Ice&quot; was released instead.", "published": "Sun, 5 Aug 2012 00:16:06 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Radar", "artist": {"url": "http://www.last.fm/music/Britney+Spears", "mbid": "2f4f5d16-7102-4110-97fd-f5c365d6bb26", "name": "Britney Spears"}, "url": "http://www.last.fm/music/Britney+Spears/_/Radar", "listeners": "251672", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "072b433d-5403-4d6f-badf-b84a9e5ceae3", "duration": "227000", "playcount": "3084049", "id": "122756740"}}