{"track": {"album": {"@attr": {"position": "4"}, "title": "The Fame", "url": "http://www.last.fm/music/Lady+Gaga/The+Fame", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92535051.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92535051.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92535051.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92535051.png", "size": "extralarge"}], "artist": "Lady Gaga", "mbid": "9d898a2a-6ca2-3ae6-a16d-b2677b8004f3"}, "wiki": {"content": "&quot;Poker Face&quot; is an electropop song by American pop singer-songwriter Lady Gaga from her debut album, The Fame. Produced by RedOne, it was released as the album's second single in late 2008 for some markets and in early 2009 for the rest of the world. The song is an uptempo dance song following in the footsteps of her previous single &quot;Just Dance&quot; but has a darker musical tone. The main idea behind the song is bisexuality and was a tribute by Gaga to her rock 'n' roll boyfriends. Lyrically &quot;Poker Face&quot; is about sex and gambling.\n \n &quot;Poker Face&quot; has been well-received by the critics most of whom have praised the robotic hook and the chorus. The song has attained worldwide success, topping the charts in more than seventeen countries including the United States, United Kingdom, Australia, New Zealand, Canada and many European countries. &quot;Poker Face&quot; is also the most downloaded song in the British chart history. The accompanying music video for the song portrays Gaga singing it in various costumes and playing strip poker in a mansion.\n \n Gaga performed the song for the eighth season of American Idol and her first headlining Fame Ball Tour. The live performances included an electronic version performed as the last song of the tour, and an acoustic version she played on the piano.\n \n &quot;Poker Face&quot; was written by Red One and Gaga, while the music has been produced by RedOne. Gaga stated in an interview that &quot;Poker Face&quot; was written by her as a pop song and was a tribute to her rock 'n' roll boyfriends. She also stated that the main idea behind the song was sex and gambling. In an interview with UK's Daily Star, Gaga noted of the song, &quot;It's about a lot of different things. I gamble but I’ve also dated a lot of guys who are really into sex and booze and gambling, so I wanted to write a record my boyfriends would like too.&quot; In an interview with Rolling Stone magazine, when asked about the meaning of the line &quot;bluffin' with my muffin&quot;, Gaga explained that it really was a metaphor for her vagina. She explained,\n \n     &quot;Obviously, it's my pussy's poker face! I took that line from another song I wrote but never released, called 'Blueberry Kisses.' It was about a girl singing to her boyfriend about how she wants him to go down on her, and I used the lyric. [Gaga sings] 'Blueberry kisses, the muffin man misses them kisses'.&quot;\n \n During her Fame Ball Tour performance at Palm Springs, California, on April 11, 2009, Gaga explained to the crowd the true meaning behind the term &quot;Poker Face&quot; used in the song. She suggested that the song dealt with her personal experience with bisexuality. The idea behind the song was to be with a man but fantasizing about a woman, hence the man in the song needs to read her &quot;Poker Face&quot; to understand what is going through her mind.\n \n &quot;Poker Face&quot; is an uptempo dance-pop song, and follows the footsteps of the previous single &quot;Just Dance&quot;. Whereas &quot;Just Dance&quot; was predominately electropop, &quot;Poker Face&quot; carries a dark sound with clear vocals on the chorus and a pop hook while combining the synths from &quot;Just Dance&quot; and the more dance-oriented beat of the next single &quot;LoveGame&quot;. According to Kerri Mason of Billboard, the composition &quot;carr[ies] the pleather-and-sequins vibe of the downtown New York scene out of the underground and onto the FM dial without losing its smut and sass.&quot; The song is set in common time with a moderate tempo of 120 beats per minute and is written in the key of G-sharp minor. Gaga's vocal range spans from F♯3 to B4. It begins with a medium tempo followed by electronic chord arrangement and the &quot;Mum-mum-mum-mah&quot; hook. The chords follow in this order, G♯m—E—F♯—G♯m—E—F♯. This is followed by the sound of dance music, produced by a powerful beat from the instruments and a stuttering hook following the chorus.\n \n Lyrically, &quot;Poker Face&quot; is all about sexual innuendo and teasing. According to Daily Star, the chorus repeats two alternating lyrics. After the hook &quot;Can't read my Poker Face&quot; the backup singer says &quot;He's got me like nobody&quot; and then in the next line says &quot;She's got me like nobody&quot;. Gaga explained in an interview with them that the line carries a bit of an undertone of confusion about love and sex. However, the liner notes from the album booklet indicate both these lines only repeat &quot;she's got me like nobody&quot;. The &quot;Mum-mum-mum-mah&quot; hook used in the song is sampled from Boney M's 1977 hit &quot;Ma Baker.&quot;\n \n Priya Elan from The Times, in a review for The Fame, said that &quot;Poker Face&quot; was one of the finest moments of the album with its &quot;love-as-card-game cheek.&quot; BBC reviewed the &quot;strut-tastic&quot; single as &quot;expressing her overwhelming desire for celebrity and fortune.&quot; Bill Lamb of About.com said, &quot;'Poker Face' works well on pop radio, but with slight mixing alterations it would be equally at home in a dark, sweaty, late night party atmosphere. She has refreshed the pop world in the US and UK at one of the slowest times of the year. 'Poker Face' keeps the motors humming as everyone waits for the next step forward from Lady Gaga.&quot; Chris Williams of Billboard also gave a positive review of the song saying, &quot;Once again, hooks are aplenty, with '80s-inspired synthesizers, robotic verses and a warm, sunny hook in the chorus, which is even more addictive than the previous single ('Just Dance')...With a focused artistic vision, a swagger in her interview style and above all, a fantastic collection of diverse pop nuggets, Gaga is playing her cards right—and &quot;Poker&quot; is another obvious ace.&quot;\n \n Slant Magazine music reviewer Sal Cinquemani included &quot;Poker Face&quot; among the songs that work in The Fame, namely tracks like &quot;Starstruck,&quot; &quot;Paper Gangsta&quot; and &quot;Summerboy&quot;. Matthew Chisling from Allmusic called the song &quot;infectious&quot; and along with the title track &quot;The Fame&quot;, complimented them for &quot;rejuvenating the vibe on the album for its second half.&quot; Andy Downing from The Chicago Tribune called the song &quot;jaunty&quot; while reviewing Gaga's Fame Ball tour. Evan Sawdey from PopMatters.com felt that &quot;Poker Face&quot; along with the track &quot;Paparazzi&quot;, duplicate much of the same &quot;glitzy territory that previous single 'Just Dance' had covered, but never once does it feel like Gaga is deliberately repeating herself.&quot; Rolling Stone in a review for The Fame Ball Tour compared the live acoustic &quot;bluesy&quot; version of &quot;Poker Face&quot; with the music of singer Amy Winehouse. Erika Hobert from the New Times Broward-Palm Beach newspaper called the song &quot;trashtastic Europop.&quot;\n \n The music video for &quot;Poker Face&quot;, directed by Ray Kay and aided by Anthony Mandler, was filmed at the luxury villa on bwin PokerIsland. bwin also provided the poker equipment and obtained product placements in return. The video premiered on October 22, 2008. It is set by a pool, as well as in a mansion. It begins with Gaga emerging out of the pool wearing a shiny masquerade mask and a black full-body leotard, with two Great Danes beside her (Lava and her son Rumpus). She throws the mask aside and the song begins with a facial shot of Gaga singing it. Gaga wears a metallic sticker on her left cheek in this shot. Featured in the video are scenes of Gaga in a mansion and dancing poolside with her dancers in a turquoise leotard. Gaga attends a wild party where every man and woman tries their luck on a strip poker game. The party gets wilder when all the party's guests strip down to their underwear, dance around, and share kisses with each other. The video also features two harlequin Great Danes and several white mannequins on her swimming pool deck. During the musical interlude before the &quot;I won't tell you that I love you&quot; hook, Gaga is shown in her trademark &quot;Pop Music Will Never Be Low Brow&quot; sunglasses while sitting beside the pool. The video ends with the head shot of Gaga singing the Mum-mum-mum-ma hook.\n \n Gaga explained in the nineteenth episode of her &quot;Transmision Gagavision&quot; series, the main idea behind the music video of &quot;Poker Face&quot;. She said that &quot;I knew I wanted it to be sexy, so I thought no pants, because that's sexy, [...]And I knew I wanted it to be futuristic, so I thought shoulder pads, because that's my thing.&quot; The music video premiered on MTV UK on February 17, 2009. In some versions of the song, the words &quot;muffin&quot; (being a slang term for the woman's vagina), &quot;Russian Roulette&quot; and &quot;gun&quot; are censored out (bleeped). On June 21, 2009, the video won the Best International Artist Video at the 2009 MuchMusic Video Awards. The video has received four nominations at the 2009 MTV Video Music Awards, in the categories of Video of the Year, Best New Artist, Best Female Video and Best Pop Video. Along with five other nominations for &quot;Paparazzi&quot;, Gaga is tied with Beyoncé for most nominations each for that year.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Poker Face&quot; is an electropop song by American pop singer-songwriter Lady Gaga from her debut album, The Fame. Produced by RedOne, it was released as the album's second single in late 2008 for some markets and in early 2009 for the rest of the world. The song is an uptempo dance song following in the footsteps of her previous single &quot;Just Dance&quot; but has a darker musical tone. The main idea behind the song is bisexuality and was a tribute by Gaga to her rock 'n' roll boyfriends. Lyrically &quot;Poker Face&quot; is about sex and gambling. ", "published": "Sun, 21 Feb 2010 02:39:10 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Poker Face", "artist": {"url": "http://www.last.fm/music/Lady+Gaga", "mbid": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "name": "Lady Gaga"}, "url": "http://www.last.fm/music/Lady+Gaga/_/Poker+Face", "listeners": "1242225", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/lady%20gaga", "name": "lady gaga"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/party", "name": "party"}]}, "mbid": "080975b0-39b1-493c-ae64-5cb3292409bb", "duration": "238000", "playcount": "11625493", "id": "217401556"}}