{"track": {"album": {"@attr": {"position": "9"}, "title": "B'Day", "url": "http://www.last.fm/music/Beyonc%C3%A9/B%27Day", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/9825341.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/9825341.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/9825341.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/9825341.jpg", "size": "extralarge"}], "artist": "Beyoncé", "mbid": "292b3e85-3b42-3e16-a083-849c69040a3e"}, "wiki": {"content": "&quot;<strong>Irreplaceable</strong>&quot; is a song recorded by American R&amp;B singer Beyoncé Knowles for her second studio album, B'Day (2006). The song was written by Knowles, Shaffer &quot;Ne-Yo&quot; Smith, Tor Erik Hermansen, Mikkel S. Eriksen, Espen Lind, Amund Bjørklund, and produced by Stargate and Knowles herself. Originally not created for Knowles, it was initially presented as a country record. &quot;Irreplaceable&quot; then was turned into a mid-tempo pop ballad with R&amp;B influences. Lyrically, the song refers to breaking up with an unfaithful man and consists of a female empowerment theme. The single was released on December 5, 2006, in the United States as the album's third major release, and as the second single in most international music markets through Columbia Records.\n \n &quot;Irreplaceable&quot; was generally well-received by music critics, some of them even called it the most memorable track on the album, and added that it manages to recapture Knowles' debut single &quot;Crazy in Love&quot;'s &quot;near-perfection&quot;. In 2009, Pitchfork Media and Rolling Stone ranked it on their respective lists of Best Songs of the 2000s decade. &quot;Irreplaceable&quot; won at the 2007 Soul Train Music Award for Best R&amp;B/Soul Single, and the 2007 Nickelodeon Kid's Choice Award for Favorite Song. It was also nominated for Record of the Year in the 2008 Grammy Awards, and for Song of the Year at the VH1 Soul Vibe awards show.\n \n &quot;Irreplaceable&quot; was a worldwide commercial success. It became Knowles' second best-selling single in her solo career after &quot;Crazy in Love&quot; and B'Day's most successful release. The single remained at the top of the US Billboard Hot 100 chart for ten consecutive weeks. Certified multi-platinum, &quot;Irreplaceable&quot; emerged as the best-selling single in 2007 and the twenty-fifth most successful song of the 2000s decade in the United States. The single also passed the 200 million audience impressions mark towards the end of 2006, while another single of Knowles, &quot;Check on It&quot; (2005), also surpassed the same mark earlier that year. Eventually, Knowles became the second female singer to achieve this in the United States, after Mariah Carey. &quot;Irreplaceable&quot; peaked at number one in Australia, at number four in the United Kingdom, and generally inside the top twenty across European music markets.\n \n The single's accompanying music video was directed by Anthony Mandler and it features the debut performance of Knowles' all-female band, Suga Mama. The video was included on the 2007 B'Day Anthology Video Album and a video edit was produced for &quot;Irreemplazable&quot;, the Spanish version of the song. The video earned Knowles a Video of the Year award at the 2007 Black Entertainment Television (BET) Awards, and it was nominated for Video of the Year during the 2007 MTV Video Music Awards. The song was promoted by Knowles with live performances, including the The Ellen DeGeneres Show and the American Music Awards of 2007. The song was also a part of her set list on The Beyoncé Experience in Los Angeles and her world tour I Am... Tour. The American Society of Composers, Authors, and Publishers (ASCAP) recognized the song as one of the most performed songs of 2008 at the ASCAP Pop Music Awards.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Irreplaceable&quot; is a song recorded by American R&amp;B singer Beyoncé Knowles for her second studio album, B'Day (2006). The song was written by Knowles, Shaffer &quot;Ne-Yo&quot; Smith, Tor Erik Hermansen, Mikkel S. Eriksen, Espen Lind, Amund Bjørklund, and produced by Stargate and Knowles herself. Originally not created for Knowles, it was initially presented as a country record. &quot;Irreplaceable&quot; then was turned into a mid-tempo pop ballad with R&amp;B influences. Lyrically, the song refers to breaking up with an unfaithful man and consists of a female empowerment theme.", "published": "Tue, 8 Mar 2011 21:44:10 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Irreplaceable", "artist": {"url": "http://www.last.fm/music/Beyonc%C3%A9", "mbid": "183105b5-3e68-4748-9086-2c1c11bf7a3d", "name": "Beyoncé"}, "url": "http://www.last.fm/music/Beyonc%C3%A9/_/Irreplaceable", "listeners": "679977", "comments": ["So since I'm not your everything,\r\nHow about I'll be nothing,\r\nNothing at all to you ♥", "To The Left, To The Left ♥ [83]", "To The Left, To The Left ♥ [82]", "To The Left, To The Left ♥ [81]", "To The Left, To The Left ♥ [80]", "To The Left, To The Left ♥ [79]", "H-I-N-O", "To The Left, To The Left ♥ [78]", "To The Left, To The Left ♥ [77]", "To The Left, To The Left ♥ [76]", "To The Left, To The Left ♥ [75]", "To The Left, To The Left ♥ [74]", "To The Left, To The Left ♥ [73]", "\"So since I'm not your everything, how about I'll be nothing?\" <3", "one of her best!", "To The Left, To The Left ♥ [72]", "To The Left, To The Left ♥ [71]", "FUCKING LOVE IT !!!!!!!!!!!!!!!!!!!!!!!!!", "To The Left, To The Left ♥ [70]", "To The Left, To The Left ♥ [69] lucky number 69..lol"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/beyonce", "name": "beyonce"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}]}, "mbid": "086549d2-b449-4cad-a189-a92c7a70bb8f", "duration": "228000", "playcount": "3507237", "id": "65853131"}}