{"track": {"album": {"@attr": {"position": "12"}, "title": "The Singles Collection", "url": "http://www.last.fm/music/Britney+Spears/The+Singles+Collection", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88145569.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88145569.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88145569.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88145569.png", "size": "extralarge"}], "artist": "Britney Spears", "mbid": "dc441808-1cf6-4487-a605-f7caa896da33"}, "wiki": {"content": "&quot;Gimme More&quot; is a song by American pop singer Britney Spears. The song was recorded for her fifth album, Blackout. The song was written during her second pregnancy and features racy lyrics backed with breathy vocals and uptempo beats.\n \n On recording the album with Britney, Danja talks about &quot;Gimme More.&quot;  &quot;It's a lot of negativity on her sometimes and you can't forget who she is, and that's kind of what I wanted to state at the end of the song [&quot;Gimme More&quot;], this is who, she is a legend, regardless you're gonna love her. We've been in and out of the studio for, like a year. I don't know it was real, real calm I think for everybody at that point, and we was able to get in and really focus on the recording. She wanna dance, she wanna dance, she wanna dance, she wanna dance, she wanna dance. She wanna be in the club, she wanna dance, that's all she wanted to say, she just wanted up-tempo, high-energy music and that's what we did. We did about five of 'em, so, we did a bunch of ideas but we got about four or five strong ones and I'm excited about 'em, the label's excited about 'em, they're excited, and ready to unleash it.&quot;\n \n &quot;Gimme More&quot; was a commercial success with radio stations and digital stores during its pre-singles release. Announced as the lead single from the album, &quot;Gimme More&quot; was first released in Australia on October 6, 2007. It performed well, reaching the top ten on many international charts. &quot;Gimme More&quot; topped Billboard's Canadian chart and reached number three in the US Billboard Hot 100, making it Spears' highest-peaking single in the United States since her 1999 number-one debut &quot;...Baby One More Time&quot;. It also peaked at number three in Australia and the United Kingdom. In Australia and the US, the single was certified platinum.\n \n 'Gimme More' is taken from Britney's highly anticipated fifth studio album, '<a title=\"Britney Spears - Blackout\" href=\"http://www.last.fm/music/Britney+Spears/Blackout\" class=\"bbcode_album\">Blackout</a>', which refers to “blocking out negativity and embracing life fully”. Despite the lack of positive press coverage recently, the fans still showed they love Britney as the song raced to No.3 in Britain in October 2007.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Gimme More&quot; is a song by American pop singer Britney Spears. The song was recorded for her fifth album, Blackout. The song was written during her second pregnancy and features racy lyrics backed with breathy vocals and uptempo beats.  On recording the album with Britney, Danja talks about &quot;Gimme More.&quot;  &quot;It's a lot of negativity on her sometimes and you can't forget who she is, and that's kind of what I wanted to state at the end of the song [&quot;Gimme More&quot;], this is who, she is a legend, regardless you're gonna love her.", "published": "Tue, 16 Apr 2013 15:16:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Gimme More", "artist": {"url": "http://www.last.fm/music/Britney+Spears", "mbid": "2f4f5d16-7102-4110-97fd-f5c365d6bb26", "name": "Britney Spears"}, "url": "http://www.last.fm/music/Britney+Spears/_/Gimme+More", "listeners": "424532", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "09e07c50-04ed-4f7e-b1bc-bad22d316ebe", "duration": "249000", "playcount": "4709695", "id": "125434571"}}