{"track": {"album": {"@attr": {"position": "1"}, "title": "Life for Rent", "url": "http://www.last.fm/music/Dido/Life+for+Rent", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87678095.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87678095.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87678095.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87678095.png", "size": "extralarge"}], "artist": "Dido", "mbid": "dd4298a2-07f6-411a-8725-bfe78593064a"}, "wiki": {"content": "&quot;White Flag&quot; is a song by Dido, released as the lead single from her second album, Life for Rent. &quot;White Flag&quot; is the biggest hit of Dido's career. It is considered one of her signature songs, and helped Life for Rent sell over ten million copies worldwide. The song was nominated for Best Female Pop Vocal Performance on the 47th Annual Grammy Awards, losing to &quot;<a title=\"Christina Aguilera &ndash; Beautiful\" href=\"http://www.last.fm/music/Christina+Aguilera/_/Beautiful\" class=\"bbcode_track\">Beautiful</a>&quot; by <a href=\"http://www.last.fm/music/Christina+Aguilera\" class=\"bbcode_artist\">Christina Aguilera</a>.\n \n The single fared very well on the charts around the world, peaking at number one in Australia, Germany, and France, number two in the UK and Ireland, and number eighteen in the U.S.\n \n The song won Best British Single at the 2004 Brit Awards.\n \n The video for the song features an appearance by actor David Boreanaz.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;White Flag&quot; is a song by Dido, released as the lead single from her second album, Life for Rent. &quot;White Flag&quot; is the biggest hit of Dido's career. It is considered one of her signature songs, and helped Life for Rent sell over ten million copies worldwide. The song was nominated for Best Female Pop Vocal Performance on the 47th Annual Grammy Awards, losing to &quot;<a title=\"Christina Aguilera &ndash; Beautiful\" href=\"http://www.last.fm/music/Christina+Aguilera/_/Beautiful\" class=\"bbcode_track\">Beautiful</a>&quot; by <a href=\"http://www.last.fm/music/Christina+Aguilera\" class=\"bbcode_artist\">Christina Aguilera</a>.  The single fared very well on the charts around the world, peaking at number one in Australia, Germany, and France, number two in the UK and Ireland, and number eighteen in the U.S. ", "published": "Sun, 24 May 2009 21:16:46 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "White Flag", "artist": {"url": "http://www.last.fm/music/Dido", "mbid": "518531b7-cb73-4307-b13e-c716471539a8", "name": "Dido"}, "url": "http://www.last.fm/music/Dido/_/White+Flag", "listeners": "500316", "comments": ["old but gold", "great!!!!!!!!!!!!!", "awesome", "Memories. :'(", "Great song ♥", "<3", "♥", "it's a masterpiece.", "I listen to this song for 10 years now *_* still good", "•*¨*•.¸¸❤¸¸.•*¨*", "Nice song, but I prefer the non-EDM version.", "i'm in love, and always will be<3", "One of the best songs I have ever heard ♥ [5]", "I never was in love but I love this song. :D", "I understand what the previous post is getting at. Although my first love broke off our relationship, no longer wanting to marry me, I remained in love. When I married, and the magic never happened, I thought about her often and knew I was still in love...a couple decades passed before I accepted that there was no hope for a relationship. I'm sure songs like this still bring up such thoughts of once-upon-a-times and never-weres, but I can't not listen to a lovely song. If it makes me sad, another song can bring me back to an even plane. The one that has brightened my mood lately is \"I make my own Sunshine\", a sweet little tune by Alyssa Bonagura. I adopted it as an anthem. She, like Dido, has a beautiful voice. Some of the songs on her CD also bring an emotional response, but I'm drawn to the beauty of great lyrics and a lovely voice. Take heart, xCUDDLECOREx. You will never forget, but you can find new love. And enjoy Dido. She's wonderful.", "So this is basically how I feel about my ex. He's half a world away, with someone else and I would never try to ruin that but for some awful reason I can't stop thinking about him. It's been a year. I know I need to move on. Time to stop listening to songs like this.", "One of the best songs I have ever heard ♥ [4]", "Klasse !", "One of the best songs I have ever heard ♥ [3]", "YAY IT'S PLAYING THE GOOD VERSION FOR A CHANGE! ♫♪♫♪♪♫ Based on the comments below it appears this page is both for the good version and the HORRIBLE version.... so I still don't know if I BAN that horrible version, it will also ban the AWESOME version."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/dido", "name": "dido"}, {"url": "http://www.last.fm/tag/chillout", "name": "chillout"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0a2feaab-af49-4e25-8b97-1b3aa4ef68ea", "duration": "238000", "playcount": "2775095", "id": "2544186"}}