{"track": {"album": {"@attr": {"position": "13"}, "title": "The Singles Collection", "url": "http://www.last.fm/music/Britney+Spears/The+Singles+Collection", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88145569.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88145569.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88145569.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88145569.png", "size": "extralarge"}], "artist": "Britney Spears", "mbid": "dc441808-1cf6-4487-a605-f7caa896da33"}, "wiki": {"content": "&quot;Piece of Me&quot; is a song written by Christian Karlsson, Pontus Winnberg, and Klas Åhlund and recorded by American singer Britney Spears. It is the second single (except in France where it hasn't been released) from Spears' fifth studio album .\n \n The song was successful reaching number one in South Africa, Ireland and Brazil. It was also successful in clubs, reaching number one in various Dance Club Play charts, including in the United States and in Australia. It was also one of her most successful singles in the UK, peaking at a high number two, and staying in the top seventy-five for twenty-nine consecutive weeks. \n \n Although Spears was not credited as writer of the song, her A&amp;R rep, Teresa LaBarbera Whites, stated that she was involved in the songs and how they turned out. In this song, Britney responds to the obsessive media attention she receives by listing the violations for which the American Pop singer has been cited. In 2007, Spears had some very public meltdowns and provided lots of content for gossip magazines and entertainment television shows. She has a very defiant attitude in this song, explaining that she's still successful despite the constant harassment and the challenges of raising children. Despite her personal struggles, this song and the Blackout album did very well.  In a radio interview with Ryan Seacrest, Spears said of the song: &quot;wherever you go there's a lot of people who ask questions and sometimes you don't know their intentions and stuff like that. So, it's kind of a cute way of putting it out there you know like, 'You want a piece of me', you know in a cool, cute and clever way. It's a cute song... I like it.&quot; \n \n Swedish pop singer <a href=\"http://www.last.fm/music/Robyn\" class=\"bbcode_artist\">Robyn</a> originally recorded a demo of this song after Klas Åhlund wrote it, then when Britney recorded the song, Robyn's original vocals were kept as background. The track was produced by Bloodshy &amp; Avant, who produced Spears' Grammy Award-winning single &quot;Toxic&quot;.\n \n The catchy upbeat, electro 'Piece Of Me' hit No.2 in the UK charts in Jan 2008, giving Britney her 20th UK hit single. The song, produced by the '<a title=\"Britney Spears &ndash; Toxic\" href=\"http://www.last.fm/music/Britney+Spears/_/Toxic\" class=\"bbcode_track\">Toxic</a>' team of Bloodshy and Avant, is about the media circus that constantly surrounds her and was voted one of 'Rolling Stone' magazine's best songs of the year for 2007.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Piece of Me&quot; is a song written by Christian Karlsson, Pontus Winnberg, and Klas Åhlund and recorded by American singer Britney Spears. It is the second single (except in France where it hasn't been released) from Spears' fifth studio album .  The song was successful reaching number one in South Africa, Ireland and Brazil. It was also successful in clubs, reaching number one in various Dance Club Play charts, including in the United States and in Australia.", "published": "Tue, 16 Apr 2013 15:14:57 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Piece of Me", "artist": {"url": "http://www.last.fm/music/Britney+Spears", "mbid": "2f4f5d16-7102-4110-97fd-f5c365d6bb26", "name": "Britney Spears"}, "url": "http://www.last.fm/music/Britney+Spears/_/Piece+of+Me", "listeners": "448387", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}]}, "mbid": "0aac7690-8b1e-4ebf-8cc4-e135155c09c7", "duration": "212000", "playcount": "4709750", "id": "133671042"}}