{"track": {"album": {"@attr": {"position": "10"}, "title": "Ray of Light", "url": "http://www.last.fm/music/Madonna/Ray+of+Light", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87971851.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87971851.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87971851.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87971851.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "08dcbc7b-2cd6-3155-bd02-631124dfa493"}, "wiki": {"content": "&quot;The Power of Good-Bye&quot; (released as double A-side single with &quot;Little Star&quot; in the UK) is a pop ballad written by American singer Madonna and Rick Nowels for Madonna's seventh album Ray of Light (1998). It was produced by Madonna, William Orbit and Patrick Leonard, and received a positive reception from music critics. The song was released as a single in the fall of 1998 (see 1998 in music), and although it failed to match the chart success of its predecessor &quot;Ray of Light&quot;, which reached the top five in several countries, it reached number four in Germany, the top ten in the United Kingdom and Canada, and the top twenty in the United States, where it became Madonna's thirty-seventh top-twenty single.\n \n Song information\n &quot;The Power of Good-Bye&quot; is a ballad featuring numerous string instruments and an electronic music sound, with lyrics reflecting on a painful breakup. Australian music critic and friend of Madonna, Molly Meldrum claimed the lyrics were about Sean Penn. The version that was released as a single and included on the album Ray of Light is quite different from the original demo version. In the summer of 2002, demos recorded during the Ray of Light recording sessions were leaked to the Internet, with one of the demos being for &quot;The Power of Good-Bye&quot;. The demo version features a stronger rhythm and more drum and bass. The lyrics are also different, including the sentence 'Walk away' instead of 'Do you wanna go higher' (in the album's booklet, the lyrics 'Walk away' were never changed) and the final message: 'God help me, learn to say goodbye, please give me the power of goodbye'.\n \n In the UK, &quot;The Power of Good-Bye&quot; was released as a double A-side with &quot;Little Star&quot;, a track from Ray of Light. In the rest of Europe, the song was included on the major single releases as a B-side. Also notable is that the European releases included several experimental remixes of the song by Luke Slater plus one remix by Dallas Austin, who previously worked with Madonna on her Bedtime Stories (1994) album.\n \n Chart performance\n In the United Kingdom, the song debuted at number six and stayed on the singles chart for nine weeks, selling 175,095 copies. Elsewhere the song was also a success, usually charting within the top twenty. Among the countries where the song charted in the top twenty are Canada, Germany, Japan and the United States (just missing the top-ten, peaking at number eleven).\n \n The success of the song brought Ray of Light back into the top ten on many album charts - more than seven months after its release. The success of the single was also influenced by Madonna's one month European promotional tour, which took her across Europe promoting the album and the song on a variety of music television shows.\n \n Music video\n The music video for &quot;The Power of Good-Bye&quot; was directed by Matthew Rolston, and was filmed from August 8-10, 1998 at Silvertop House in Los Angeles, California and Malibu Beach. Madonna's lover in the video is played by Goran Višnjić. The video was premiered on MTV on September 10, 1998, a few minutes before the MTV Video Music Awards show began. The video was occasionally played on The WB Network after the television show Felicity, which played the song as the background music during its TV ads. It is available on Madonna's DVD compilation The Video Collection 93:99.\n \n The Power Of Good-bye is one of the few singles that Madonna has performed on the BBC program Top of the Pops.\n \n Director: Matthew Rolston \n Producer: Nicola Doring \n Director of Photography: Pascal Lebegue \n Editor: Dustin Robertston \n Production Company: HSI Productions \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;The Power of Good-Bye&quot; (released as double A-side single with &quot;Little Star&quot; in the UK) is a pop ballad written by American singer Madonna and Rick Nowels for Madonna's seventh album Ray of Light (1998). It was produced by Madonna, William Orbit and Patrick Leonard, and received a positive reception from music critics. The song was released as a single in the fall of 1998 (see 1998 in music), and although it failed to match the chart success of its predecessor &quot;Ray of Light&quot;, which reached the top five in several countries...", "published": "Sun, 6 Mar 2011 04:08:10 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "The Power of Good-Bye", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/The+Power+of+Good-Bye", "listeners": "108890", "comments": ["beautiful contralto", "Madonna's best ballad. Ever. (2)", "Madonna's best ballad. Ever.", "It's an impossible task if you ask me, to name Madonna's best track- there are so many to choose from. [4]", "It's an impossible task if you ask me, to name Madonna's best track- there are so many to choose from. [3]", "Hino ♥", "Pure Shores, anyone?", "the power of this song.", "I miss when pop songs were as good as this... [12] Great song <3", "I miss when pop songs were as good as this... [11]", "Pain is a warning that something's wrong, I pray to God that it won't be long.", "I miss when pop songs were as good as this... [10]", "I miss when pop songs were as good as this... [9]", "My fav song and video...", "love!!!", "my favourite song... ♥ [1]", "It's an impossible task if you ask me, to name Madonna's best track- there are so many to choose from. [2] But i stand for \"Frozen\"", "one of her best songs.", "\"you are my lesson, I have to learn..\"", "It's an impossible task if you ask me, to name Madonna's best track- there are so many to choose from."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/ballad", "name": "ballad"}]}, "mbid": "0b1779f9-9c1f-41ac-853e-0b18b6d6e43e", "duration": "252000", "playcount": "648139", "id": "34205"}}