{"track": {"album": {"@attr": {"position": "3"}, "title": "Millennium", "url": "http://www.last.fm/music/Backstreet+Boys/Millennium", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/81899087.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/81899087.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/81899087.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/81899087.png", "size": "extralarge"}], "artist": "Backstreet Boys", "mbid": "bf594062-27f5-4500-a86d-1a9af8da169f"}, "wiki": {"content": "Released December 21, 1999.\n \n &quot;Show Me the Meaning of Being Lonely&quot; is the third single off Backstreet Boys' 1999 album, Millennium. It is a significant hit, second only to the first single I Want It That Way from the same album, becoming one of the most successful singles of the boy band. It was released on December 10, 1999, the video was released in early 2000 and peaked at #3 on the UK Singles Chart, and #6 on the Billboard Hot 100. It also reached #2 in Switzerland, the Netherlands, Sweden and New Zealand, and #3 in Finland and Norway. \n \n The music video for &quot;Show Me The Meaning of Being Lonely&quot; was directed by Stuart Gosling in December 1999 in Los Angeles, CA. It follows each of the band members separately until the instrumental break and final choruses.\n \n The video begins at a hospital, in which Brian Littrell watches doctors try to save a patient, also portrayed by Littrell. A. J. McLean's scenes take place on a coach bus, mourning the loss of a girl whose photo he carries. He sees her appear on the bus, but she fades away. Kevin Richardson watches film of himself and his father in an apartment. Nick Carter walks down a city street in the rain and saves a girl from almost being hit by the bus McLean is on. Howie Dorough drinks from a teacup at an old-style bar as a girl in red runs towards him, but fades away before she reaches him.\n \n Richardson arrives to meet Dorough and the two leave the building together. McLean's bus arrives, and Littrell exits the hospital. The five band members congregate and begin walking down the street together.\n \n Most of the video is shot in a desaturated scheme in which only certain red elements were brightly colored, until the very end of the video when the band walks out of the city into a brightly coloured field. Whereas each band member has a lead vocal part in the song, each of their separate scenes is introduced at or just before their verse begins.\n \n The video, somewhat darker in tone than any of the band's previous releases, touches on several of the band's real-world issues. Littrell had undergone open heart surgery the previous year for a defect he'd had since birth. The video used actual footage of Richardson and his deceased father. The girl Dorough sees represents his sister, who dies a year earlier. Additionally, the bus McLean rides is marked for &quot;Denniz St.&quot;, and is driven by an actor who resembles Denniz PoP; PoP had died in 1998.\n \n A second cut of the video was released some time after the first. The video added a dedication before the video: &quot;This video is dedicated to Denniz POP [sic], and to all those who have lost a loved one&quot;. The second cut also altered the special effect used when the girls disappear from a fade in which the girls' shape distorts in a &quot;ripple&quot; effect to just fading away.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Released December 21, 1999.  &quot;Show Me the Meaning of Being Lonely&quot; is the third single off Backstreet Boys' 1999 album, Millennium. It is a significant hit, second only to the first single I Want It That Way from the same album, becoming one of the most successful singles of the boy band. It was released on December 10, 1999, the video was released in early 2000 and peaked at #3 on the UK Singles Chart, and #6 on the Billboard Hot 100. It also reached #2 in Switzerland, the Netherlands, Sweden and New Zealand, and #3 in Finland and Norway.  ", "published": "Thu, 5 Mar 2009 23:18:25 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Show Me the Meaning of Being Lonely", "artist": {"url": "http://www.last.fm/music/Backstreet+Boys", "mbid": "2f569e60-0a1b-4fb9-95a4-3dc1525d1aad", "name": "Backstreet Boys"}, "url": "http://www.last.fm/music/Backstreet+Boys/_/Show+Me+the+Meaning+of+Being+Lonely", "listeners": "166171", "comments": ["Classic <3", "Bring back the boybands of the 90's!", "BSB and NKOTB are like the godfathers of boy bands. What's more is that, unlike today's boy bands, these guys got famous through music, not by selling images.", "this song keeps me alive [2]", "is good song.....", "There's something missing in my heart ♥", "i love i love", "*♥~♥ ♥~♥* ♫ღ ℓσνє ιт ღ ♫*♥~♥ ♥~♥*", "my feeeeeeeeelss", "It's like I can hear a sample from the beginning of  'Golden Eye' by Tina Turner...", "BSB super!!!!!!!!!!!!!!!!!! It's the best boys band all over the world!", "Love this song! Ah, the 90's were great. [3] ♥", "<3", "super", "show me the meaning of being lonely...\nI should move on, maybe", "this song keeps me alive", "Já chorei demais ouvindo essa música, linda demais *-------------* ♥", "lol", "Fresh Music :)", "This song is so haunting. When it came out, my friends and I used to practice singing it. I was always given Kevin's part, since it was my favorite."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/backstreet%20boys", "name": "backstreet boys"}, {"url": "http://www.last.fm/tag/boybands", "name": "boybands"}, {"url": "http://www.last.fm/tag/slow", "name": "slow"}]}, "mbid": "0b79346c-828e-4698-824a-a16e18793a6c", "duration": "232000", "playcount": "739721", "id": "1358532"}}