{"track": {"album": {"@attr": {"position": "2"}, "title": "Let Go", "url": "http://www.last.fm/music/Avril+Lavigne/Let+Go", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90850477.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90850477.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90850477.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90850477.png", "size": "extralarge"}], "artist": "Avril Lavigne", "mbid": "1fa4bdc1-cd16-4bcb-bc41-f3e4338b6701"}, "wiki": {"content": "Released April 23, 2002\n \n &quot;Complicated&quot; is a song by Avril Lavigne and was her first single, released in 2002 from her debut album, Let Go. It was written by Lavigne and The Matrix (Scott Spock, Lauren Christy, and Graham Edwards), and produced by The Matrix. The single reached number one in Australia, New Zealand and Mexico, number two on the Billboard Hot 100, spending 16 consecutive weeks in the Top Ten of the Billboard Hot 100 and 13 weeks in the Top Five, and number three in the United Kingdom. Based on its chart performance, the song is Lavigne's second most successful single and was one of the most successful releases of 2002.\n \n The song was ranked at number 197 in Blender magazine's &quot;The 500 Greatest Songs Since You Were Born&quot;.\n \n &quot;Complicated&quot; was parodied by &quot;Weird Al&quot; Yankovic on his 2003 album Poodle Hat. The parody called &quot; A Complicated Song&quot; is a comedy/rock song that focuses on a group of stories that have absolutely nothing to do with each other.\n \n The video, directed by The Malloys, starts with Lavigne asking her bandmates if they want to &quot;crash&quot; the mall. They respond with enthusiasm, and skateboard there. The video features Lavigne and the band harrassing shoppers and employees, causing havoc around the mall. This is intercut with footage of Lavigne and the band performing the song at a skatepark.\n \n The video was shot in 2 days and during the shooting, the mall remained open.\n \n The Canadian single of &quot;Complicated&quot; has shipped over 100,000 copies in Canada, where the song has been awarded the gold and platinum single certifications by the CRIA for, respectively, shipments of at least 50,000 and 100,000 singles shipped.\n \n The song was certified 2× Platinum in Australia[2]. Lavigne won Best New Artist at the 2002 MTV Video Music Awards for &quot;Complicated&quot;[5]. &quot;Complicated&quot; won in the Single of the Year category at the 2003 Juno Awards. In the United States, the song was nominated at the 2003 Grammy Awards for Best Female Pop Vocal Performance and Song of the Year[6]; it lost both awards to Norah Jones's &quot;Don't Know Why&quot;. In Brazil hit that was nominated in the category of best VMB video of the year in 2003.\n \n The song was featured on the trailer and on the commercials of the 2003 movie Uptown Girls.\n \n It is also featured on the video games Karaoke Revolution and Buzz!: The Music Quiz. The &quot;Pablo La Rossa Vocal mix&quot; of the song was used on the video game FIFA Football 2003.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Released April 23, 2002  &quot;Complicated&quot; is a song by Avril Lavigne and was her first single, released in 2002 from her debut album, Let Go. It was written by Lavigne and The Matrix (Scott Spock, Lauren Christy, and Graham Edwards), and produced by The Matrix. The single reached number one in Australia, New Zealand and Mexico, number two on the Billboard Hot 100, spending 16 consecutive weeks in the Top Ten of the Billboard Hot 100 and 13 weeks in the Top Five, and number three in the United Kingdom.", "published": "Sun, 13 Mar 2011 02:26:12 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Complicated", "artist": {"url": "http://www.last.fm/music/Avril+Lavigne", "mbid": "0103c1cc-4a09-4a5d-a344-56ad99a77193", "name": "Avril Lavigne"}, "url": "http://www.last.fm/music/Avril+Lavigne/_/Complicated", "listeners": "533597", "comments": ["Cool So cool Im a death metal fan and this is great", "<3", "Classic forever! [71]", "Classic forever! [69]", "Is this a different mix or something... it sounds different from the one i got off the album??", "this titel is good..", "nice", "Classic forever! [68]", "Great song", "Classic forever! [67]", "luv this song", "Hino :3", "Classic forever! [66]", "Classic forever! [65]", "great little tune. Great to see Ms. Lavigne hanging out with the guys in the video. :-) 'Dude, you wanna go crash the mall? Yeah, niiiiiceeee.' :-D", "Classic forever! [64]", "Classic forever! [63] I am positive I will always love this song with a passion.", "Take off...all your preppy clothes!", "Classic forever! [62]", "Classic forever! [61]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/avril%20lavigne", "name": "avril lavigne"}, {"url": "http://www.last.fm/tag/pop%20rock", "name": "pop rock"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "0c54b6ad-fc83-4fcc-a6a2-e5b0997e369e", "duration": "245000", "playcount": "3479921", "id": "1003543"}}