{"track": {"album": {"@attr": {"position": "3"}, "title": "Oral Fixation Vol. 2 (Reloaded Edition)", "url": "http://www.last.fm/music/Shakira/Oral+Fixation+Vol.+2+(Reloaded+Edition)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/70446652.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/70446652.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/70446652.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/70446652.png", "size": "extralarge"}], "artist": "Shakira", "mbid": ""}, "wiki": {"content": "&quot;Hips Don't Lie&quot; is a Latin pop song based in a salsa and Cumbia mix and fused with reggaeton beat (reggaeton pop) performed by Colombian singer Shakira and Haitian rapper Wyclef Jean. The song is a remake of Jean's 2004 song &quot;Dance Like This&quot; and takes some of its instrumentation from Jerry Rivera's &quot;Amores Como El Nuestro&quot; (which was also used for Lord Tariq and Peter Gunz's hit single &quot;Déjà Vu (Uptown Baby)&quot;) and lyrics from Dominican composer Luis Dias' &quot;Carnaval (Baila en la Calle)&quot;.Shakira wrote the verses (keeping the original chorus) and co-produced the song. The song was released as the second single from Shakira's second English album Oral Fixation Vol. 2 in 2006. &quot;Hips Don't Lie&quot; became a global success, topping the charts in at least 55 countries. It became Shakira and Wyclef's first (and to date, only) number-one single in the U.S. The song became one of the world's best-selling singles of all time and one of the hottest songs of summer 2006. In the UK, this was Wyclef's third number-one hit (after The Fugees' &quot;Killing Me Softly&quot; and &quot;Ready Or Not&quot;) and Shakira's first. In many other countries, it became Shakira's second number one, (following the massive success of &quot;Whenever, Wherever&quot;) and her third number-one single in other countries such as Australia and Netherlands (after &quot;Underneath Your Clothes&quot;).\n \n The song made Shakira the only Colombian and South American artist in history to top the U.S. Hot 100. An international remix was released digitally and produced by Boston's DJ Niso International on April 21, 2006.\n \n There is also a lesser known Spanish version of the song called &quot;Será, Será (Las Caderas No Mienten)&quot; which can be translated to &quot;Will Be, Will Be (Hips Don't Lie)&quot;. It was released in Latin America, although some radios preferred to play the original version. This version has different verses and a different chorus, whilst the rap by Wyclef Jean is kept in English. The Fray has covered this song in Jo Whiley's live lounge.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Hips Don't Lie&quot; is a Latin pop song based in a salsa and Cumbia mix and fused with reggaeton beat (reggaeton pop) performed by Colombian singer Shakira and Haitian rapper Wyclef Jean. The song is a remake of Jean's 2004 song &quot;Dance Like This&quot; and takes some of its instrumentation from Jerry Rivera's &quot;Amores Como El Nuestro&quot; (which was also used for Lord Tariq and Peter Gunz's hit single &quot;Déjà Vu (Uptown Baby)&quot;) and lyrics from Dominican composer Luis Dias' &quot;Carnaval (Baila en la Calle)&quot;.Shakira wrote the verses (keeping the original chorus) and co-produced the song.", "published": "Tue, 5 Jan 2010 20:47:21 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Hips Don't Lie", "artist": {"url": "http://www.last.fm/music/Shakira", "mbid": "726cb350-d775-4e07-b006-898555f24b0d", "name": "Shakira"}, "url": "http://www.last.fm/music/Shakira/_/Hips+Don%27t+Lie", "listeners": "349258", "comments": ["although her hips don't lie, i still find them UNBELIEVABLE!!!!!!!!", "@EvilMaleKikyo lol", "Awesome Song!", "Sounds like Bjork.", "I haven't heard this song in forever... I stopped listening to it after my trip to Florida; where they played it NON-STOP", "This is the first Shakira song I ever heard and still love it & her .Shakira Shakira ♪[2]", "I've always loved this song, and always will. And Shakira's belly-dancing... damn wonderful.", "Temperamentvoll 's Shakira ;))", "Shakira Shakira ♪ [2]", "perfecta", "DIVA", "Great Diva and song.", "Recuerdo escucharla en todo el Mundo!!", ";)", "Histórica!", "I'm really out of this genre, but this song is classic.", "This is the first Shakira song  I ever heard and still love it & her .Shakira Shakira ♪", "♥", "this ia like the best song in the world!!!!!!    Lol!!!!!!", "Please vote for these pics of Shakira\r\n http://www.lastfm.com.br/music/Shakira/+images/85384679 http://www.lastfm.com.br/music/Shakira/+images/85384729 http://www.lastfm.com.br/music/Shakira/+images/85384697"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/latin", "name": "latin"}, {"url": "http://www.last.fm/tag/shakira", "name": "shakira"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}]}, "mbid": "0c818ac1-9ece-42e1-9d2c-3f7890e83a3c", "duration": "217000", "playcount": "2277587", "id": "43082121"}}