{"track": {"album": {"@attr": {"position": "0"}, "title": "Ladies & Gentlemen: The Best of George Michael", "url": "http://www.last.fm/music/George+Michael/Ladies+&+Gentlemen:+The+Best+of+George+Michael", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/58267113.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/58267113.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/58267113.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/58267113.png", "size": "extralarge"}], "artist": "George Michael", "mbid": "48e7491c-3c0c-4178-9ae3-df320ae5c72e"}, "wiki": {"content": "&quot;Faith&quot; was a number-one song, written and performed by George Michael, released as a single on Columbia Records, from his 1987 Faith album. According to Billboard magazine, it was the top-selling single of the year in the United States in 1988.\n \n Having disbanded Wham! the previous year, there was a keen expectation for Michael's solo career and &quot;Faith&quot; would go on to become one of his most popular and enduring songs, as well as being the most simplistic in its production. It was the second of six singles released from the well-received album.\n \n \n &quot;Faith&quot; is just over three minutes long, the first 37 seconds of which is taken up by a straightforward, fade-up music on organ introduction based on the Wham song &quot;Freedom&quot;. Eventually, a two chord progression takes up the song with Michael singing an extremely mature and meaningful lyric about having the &quot;faith&quot; to leave a relationship that he knows is not working, and not giving into to the temptation of going back to his partner no matter how much he desires her as someone better is out there and does not want to be trapped in a situation that is not working. This shows true faith and strength of character in Michael and his ability to deal with really deep emotional issues. Interestingly this song appears to resolve the 'dilemma' which Michael talks about in the original 'Freedom Song', while on the surface this appears to be a fizzy pop song, the lyrics are extremely deep and it appears that Michael is struggling here with the conflict involved in being in love with a person who is not returning the affection in a way that is desired and causing immense discomfort, so while in his heart he knows he wants his 'freedom' he also wants the person he loves, but being trapped in this dichotomy he knows causes immense suffering and pain and knows in his heart the only resolution is to have 'Faith' to meet someone new.\n \n A famous video was made, which provided some definitive images of the 1980s music industry in the process - Michael in shades, a leather jacket and a particularly memorable pair of tight Levi's blue jeans and cowboy boots, playing a guitar near a classic-design jukebox.\n \n The video for &quot;Freedom! '90&quot;, released three years later, used some of the elements used in the &quot;Faith&quot; video, from the guitar, jeans, jacket all the way to the jukebox.\n \n The song reached number one on the U.S. Billboard Hot 100 singles chart and number two on the UK Singles Chart.\n \n On the Hot 100 chart, &quot;Faith&quot; rocketed from #54 to #37, the week of October 31, 1987, reaching #1 on December 12, 1987 and remaining there for four consecutive weeks, easily becoming the longest running chart topper of 1987. Altogether, &quot;Faith&quot; lingered in the top 10 for 9 weeks, the Top 20 for 11 weeks and the Top 40 for 15 weeks.\n \n &quot;Faith&quot; was covered by the Nu metal/Rapcore band Limp Bizkit on their 1997 album Three Dollar Bill, Yall$. The video (released November 20, 1998) shows scenes of Limp Bizkit by their tour bus at the Family Values Tour 1998. It features Fred Durst and Wes Borland dressed up as their alter egos 'The Weapon' and 'The Liquidator' at the beginning, with Borland explaining that he &quot;...hates Limp Bizkit.&quot;. Jonathan Davis Fieldy and Brian &quot;Head&quot; Welch from Korn also make an appearance.\n \n The song is followed by a hidden track, &quot;Blind&quot;, which is 1:25 long (not to be confused by Korn's song, also named &quot;Blind&quot;).\n \n This version of &quot;Faith&quot; is featured in the promo of the 2008 film Religulous.\n \n     * Alvin and the Chipmunks covered the song in their signature style. on their 1988 album Born to Rock. It is the opening track on this album.\n     * At the 2003 BRIT Awards, a re-worded version of the song was performed by Ms. Dynamite, in order to show opposition to the 2003 invasion of Iraq. George, himself a vocal campaigner against the war, did not appear at the ceremony, but duetted on the song via a pre-recorded video.\n     * Korean girl group, The Grace, made an a cappella cover of the song, which was included in their Korean single, &quot;My Everything&quot;. The single was released on November 6, 2006.\n     * Turkish band, Dolapdere Big Gang, made an alaturca cover of &quot;Faith&quot; in their second album, Just Feel, in December 2007.\n     * The Boy Least Likely To recorded a light-hearted cover, as a homage to the song in 2006. The song is available on their album The Best B-Sides Ever, and it can be streamed directly from their Facebook profile page. The band occasionally plays their version live.\n     * Lloyd Daniels sung this song on the X Factor Week 7 of 2009. It was Wham! and George Michael week.\n \n     * The song was featured at the opening of the Scrubs episode, &quot;My Own American Girl&quot;, being sung by the main character, J.D.\n     * Michael appeared performing the song in the pilot episode of ABC's Eli Stone. &quot;Faith&quot; was heavily used in TV commercials for the series, along with the episode footage of Michael singing. Future episodes of Eli Stone were all based on and feature George Michael's songs.\n     * The song was sung by Hugh Laurie as Dr. Gregory House on the House (TV series) episode &quot;Wilson&quot;\n     * The song is featured in the movie Rules of Attraction with two of the main characters dancing together while it plays.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Faith&quot; was a number-one song, written and performed by George Michael, released as a single on Columbia Records, from his 1987 Faith album. According to Billboard magazine, it was the top-selling single of the year in the United States in 1988.  Having disbanded Wham! the previous year, there was a keen expectation for Michael's solo career and &quot;Faith&quot; would go on to become one of his most popular and enduring songs, as well as being the most simplistic in its production. It was the second of six singles released from the well-received album. ", "published": "Mon, 14 Dec 2009 16:19:32 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Faith", "artist": {"url": "http://www.last.fm/music/George+Michael", "mbid": "a752d086-a265-4968-a882-2f69e9bc8f3b", "name": "George Michael"}, "url": "http://www.last.fm/music/George+Michael/_/Faith", "listeners": "350373", "comments": ["well i guess it would be nice", "I looooove this song, even i don't have a faith.", "Yay Wham!  LOL!  <3 GM.  I still have my Faith cassette :)", "One of the best. amazing.", "<3", "많은 프랑스 인들은 작은 개구리를 죽일 다리에서 그들을 찢어하고 드세요. 그 역겨운 않습니까? 그리고 사람들은 자신의 문화와 어떤 전화하십시오. 나는 웃지 마! 그리고 그들은 네덜란드 인 대통령 있습니다. 그들은 세계를기만하려는 사람들은 치즈를 먹을 것입니다.", "One of my least liked GM songs, yet was such a huge hit!", "Shake it!", "♥", "Oh George Michael of the guilty pleasures.   ( :", "It makes me wanna dance ;))) ♥", ":)", "I hope George is doing well. He was really sick for a month over the holidays.", "I gotta have faith..", "Love this song sooo much!!", "this is for me  LORA  not Kee   oh well    shake it", "I gotta have faith, faith!", "love goerge michael!", "He still has the greatest beard ever.  ( :", "my fav song of george michael! : )  makes me wanna get moving!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/george%20michael", "name": "george michael"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0d86110b-579d-4e3b-88ef-29f0404d1913", "duration": "195000", "playcount": "1324380", "id": "1067343"}}