{"track": {"album": {"@attr": {"position": "7"}, "title": "Thriller", "url": "http://www.last.fm/music/Michael+Jackson/Thriller", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88008107.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88008107.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88008107.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88008107.png", "size": "extralarge"}], "artist": "Michael Jackson", "mbid": "031c1f26-ab8b-488c-b793-e34a9340d245"}, "wiki": {"content": "&quot;Human Nature&quot; is a song by American recording artist Michael Jackson. It was written and composed by Steve Porcaro and John Bettis, and produced by Quincy Jones. It is the fifth single from the singer's sixth solo album, Thriller (1982). Initially, Porcaro had recorded a rough demo of the song on a cassette, which was then given to Jones. Enjoying the demo, Jones had the ballad included on the Thriller album. The song was the last selected for the album, removing &quot;Carousel&quot; from the final track listing.\n  \n &quot;Human Nature&quot; was released on July 3, 1983, as the album's fifth single. Although not released in the UK, the song achieved chart success in the US. Reaching number two on Billboard's Hot Adult Contemporary chart and number seven on the Hot 100, the song became Jackson's fifth Top 10 hit from Thriller. In New Zealand the single reached number 11. The ballad garnered many positive reviews from music critics. &quot;Human Nature&quot; has been covered and sampled by numerous artists, including Stevie Wonder, John Mayer, Miles Davis, SWV, Nas, and Chris Brown.\n  \n &quot;Human Nature&quot; was written and composed by Steve Porcaro of Toto and John Bettis for Michael Jackson's Thriller album. Initially, Porcaro recorded a rough demo of the song on a cassette. Fellow Toto band member David Paich then gave the demo, along with two songs written by Paich, to producer Quincy Jones, hoping they would be included on Thriller. Jones didn't like Paich's songs, but enjoyed the rough demo of &quot;Human Nature&quot; at the end of the cassette. Jones explained, &quot;All of a sudden, at the end, there was all this silence, there was: 'why, why, dah dah da-dum dah dah, why, why'. Just a dummy lyric and a very skeletal thing—I get goosebumps talking about it. I said, 'This is where we wanna go, because it's got such a wonderful flavor.'&quot; Bettis, who had written lyrics for hits by The Carpenters and The Pointer Sisters, among others, was asked to add lyrics to the song. He completed the song in two days. The producer asked if the song could be included on Jackson's album, to which Porcaro and Bettis agreed. &quot;Human Nature&quot; was the last song selected for Thriller, ousting &quot;Carousel&quot; from the final track listing.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Human Nature&quot; is a song by American recording artist Michael Jackson. It was written and composed by Steve Porcaro and John Bettis, and produced by Quincy Jones. It is the fifth single from the singer's sixth solo album, Thriller (1982). Initially, Porcaro had recorded a rough demo of the song on a cassette, which was then given to Jones. Enjoying the demo, Jones had the ballad included on the Thriller album. The song was the last selected for the album, removing &quot;Carousel&quot; from the final track listing.\n ", "published": "Tue, 17 Jan 2012 16:04:48 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Human Nature", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/Human+Nature", "listeners": "406300", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/michael%20jackson", "name": "michael jackson"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}]}, "mbid": "0de7c8da-4ca4-460d-971f-c110bc51c135", "duration": "226000", "playcount": "1986697", "id": "1066784"}}