{"track": {"album": {"@attr": {"position": "1"}, "title": "Taller In More Ways", "url": "http://www.last.fm/music/Sugababes/Taller+In+More+Ways", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/89592135.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/89592135.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/89592135.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/89592135.png", "size": "extralarge"}], "artist": "Sugababes", "mbid": "7cf0187a-e610-4023-b452-7bb48b29f499"}, "wiki": {"content": "&quot;Push the Button&quot; is a pop song written by Dallas Austin, Mutya Buena, Keisha Buchanan, and Heidi Range for the Sugababes' fourth studio album Taller in More Ways (2005). Produced by Dallas, the song was released to positive reaction from music critics as the album's lead single in September 2005. It reached number one in Austria, Ireland, Poland, New Zealand, and the United Kingdom, becoming the group's fourth number one single domestically. Thematically, the electro influenced pop song focuses upon how a girl tries to wrap a man around the little finger, prompting him to &quot;push the button&quot; instead of hesitating any longer.\n \n In the UK the maxi CDs release was on September 26, 2005. The single was featured on the soundtrack for the 2006 romantic comedy It's a Boy/Girl Thing, and in a commercial for Tassimo coffee machines.\n \n Music video\n  \n The music video for &quot;Push the Button&quot; was directed by American director Matthew Rolston and produced by Lindsay Turnham for Exposure Films. It was filmed in various locations throughout Shepherds Bush, London in July 2005 and first aired in the United Kingdom in the week of September 12, 2005. The video primarily focuses around Buena, Buchanan and Range dancing in an elevator for an extremely tall (and computer animated) building. &quot;So there's Keisha, Heidi in a lift and on each floor that the lifts stops at, a different guy gets in, one for each of us,&quot; Mutya Buena told in an interview with the band's official website. &quot;We end up with Mr 'Too Cool', Mr 'Perfect' and Mr 'Shy Guy' (Emrhys Cooper) and of course we flirt with them, tease them and push them away... all in a fun way.&quot;\n \n Chart performance\n \n &quot;Push The Button&quot; became the Sugababes' most successful single to date worldwide peaking at #1 the singles charts in the UK, Republic of Ireland, New Zealand,Croatia,Serbia, Austria and Poland. &quot;Push the button&quot; also peaked at #2 in Germany with sales over 150,000 and also peaked at #2 in Norway, and #3 in Switzerland. The girls received their second 'best British single' nomination at the 2006 BRIT Awards, but lost the award to Coldplay's Speed of Sound. It has sold 410000 copies in the UK.\n \n &quot;Push the Button&quot; debuted at #24 and peaked at #3 in Australia, making it their highest charting Australian single and biggest hit. It was certified Platinum by ARIA making it their best selling Australian single ahead of &quot;Round Round&quot; which peaked at #13 in 2002, which was certified gold. The single was also a club hit in the United States. The song was also successful in France, a difficult market for the group in the past, peaking at #17 and where it is their highest peaking single to date. Also in Sweden, &quot;Push the Button&quot; peaked at #4 to become the Sugababes' most successful single to date. In the Netherlands, &quot;Push the Button&quot; peaked at #3 spending 23 weeks on the chart, and is tied with &quot;Hole in the Head&quot; as their biggest hit, which peaked at #3 in 2003.Song also topped MTV Adria top 20 Chart.\n \n The song became the group's first top 10 single on the Romanian Singles Chart since &quot;Round Round&quot; in 2002. \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Push the Button&quot; is a pop song written by Dallas Austin, Mutya Buena, Keisha Buchanan, and Heidi Range for the Sugababes' fourth studio album Taller in More Ways (2005). Produced by Dallas, the song was released to positive reaction from music critics as the album's lead single in September 2005. It reached number one in Austria, Ireland, Poland, New Zealand, and the United Kingdom, becoming the group's fourth number one single domestically.", "published": "Tue, 29 Dec 2009 02:46:39 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Push The Button", "artist": {"url": "http://www.last.fm/music/Sugababes", "mbid": "dfa715ac-b536-44df-af43-570d3ea3edec", "name": "Sugababes"}, "url": "http://www.last.fm/music/Sugababes/_/Push+The+Button", "listeners": "204373", "comments": ["Their best along with Denial.", "HIT <3", "★★★Klasse★★★", "Not their worst, but certainly the most annoying. [2] I agree. It's a good song but majorly overrated and very annoying now :\\", "Not their worst, but certainly the most annoying. Holy crap.", "Well, we must all trust that Obama will not need to do this..........", "This one became my new year song 2012/2013. Played exactly when we went into 2013.", "Push the Bottom and let take Music conrol", "This was a personal favourite from the moment I heard it in 2005. Hot video, too...", "Nice beat!!!", "Nice!", "A classic.", "Seven years later, still utterly devoid of flaws.", "ElevatorHo's", "Olympicbabes. [2]", "Olympicbabes.", "It's not overrated. It's simply one of their best songs.", "heidi's button anytime", "Old but gold", "Plain and simple. How hard can it be?"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/sugababes", "name": "sugababes"}, {"url": "http://www.last.fm/tag/british", "name": "british"}]}, "mbid": "0f658701-8afc-40cc-9005-4c2227aac003", "duration": "220000", "playcount": "892544", "id": "23559439"}}