{"track": {"album": {"@attr": {"position": "4"}, "title": "Let Go", "url": "http://www.last.fm/music/Avril+Lavigne/Let+Go", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/90850477.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/90850477.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90850477.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90850477.png", "size": "extralarge"}], "artist": "Avril Lavigne", "mbid": "1fa4bdc1-cd16-4bcb-bc41-f3e4338b6701"}, "wiki": {"content": "Released \tNovember 19, 2002 .\n \n &quot;I'm With You&quot; is a Moderate Waltz song written by Canadian singer Avril Lavigne and The Matrix (Scott Spock, Lauren Christy, Graham Edwards) for Lavigne's debut album, Let Go, and was Lavigne's first ballad released as a single.\n \n It was released as the album's third single in 2002 and 2003 (see 2002 in music and 2003 in music). It reached number one in Mexico, number four on the U.S. Billboard Hot 100 (Lavigne's third single to reach the top ten), number seven in the United Kingdom, number thirteen in Canada, and number one on the Global song chart. &quot;I'm With You&quot; received radio and television airplay in Australia, but it was not officially released there.\n \n The single's music video, directed by renowned photographer David LaChapelle, involves Lavigne, who is seen alone, trying to find someone. Most of the video is in slow motion but Lavigne's mouth movements are in sync with the song's vocals. This was achieved by recording the footage while the song was played twice as fast.\n \n &quot;I'm With You&quot; was nominated for the 2004 Grammy Award for Song of the Year, and for Best Female Pop Vocal Performance but lost to Luther Vandross's &quot;Dance with My Father&quot; and Christina Aguilera's &quot;Beautiful&quot; respectively.\n \n &quot;I'm With You&quot; was later featured in the season 3 Scrubs episode &quot;My Tormented Mentor&quot;,[1] and in the Smallville episode &quot;Accelerate&quot;.It was used in the film Bruce Almighty. The song was used too on the 2003 Brazilian soap opera Mulheres Apaixonadas[2].\n \n It was also featured on the video game Karaoke Revolution Volume 2.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=2752\" rel=\"nofollow\">I'm With You Songfacts</a>, Barbadian recording artist <a href=\"http://www.last.fm/music/Rihanna\" class=\"bbcode_artist\">Rihanna</a>  sampled this song for her 2010 track <a title=\"Rihanna &ndash; Cheers (Drink to That)\" href=\"http://www.last.fm/music/Rihanna/_/Cheers+(Drink+to+That)\" class=\"bbcode_track\">Cheers (Drink to That)</a>. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Released \tNovember 19, 2002 .  &quot;I'm With You&quot; is a Moderate Waltz song written by Canadian singer Avril Lavigne and The Matrix (Scott Spock, Lauren Christy, Graham Edwards) for Lavigne's debut album, Let Go, and was Lavigne's first ballad released as a single.  It was released as the album's third single in 2002 and 2003 (see 2002 in music and 2003 in music). It reached number one in Mexico, number four on the U.S. Billboard Hot 100 (Lavigne's third single to reach the top ten), number seven in the United Kingdom, number thirteen in Canada, and number one on the Global song chart.", "published": "Wed, 5 Jan 2011 18:05:05 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "I'm With You", "artist": {"url": "http://www.last.fm/music/Avril+Lavigne", "mbid": "0103c1cc-4a09-4a5d-a344-56ad99a77193", "name": "Avril Lavigne"}, "url": "http://www.last.fm/music/Avril+Lavigne/_/I%27m+With+You", "listeners": "399998", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/pop%20rock", "name": "pop rock"}, {"url": "http://www.last.fm/tag/avril%20lavigne", "name": "avril lavigne"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "19a8a5ee-1d2a-4035-bce8-d312d02cc5a5", "duration": "223000", "playcount": "2619027", "id": "1012564"}}