{"track": {"album": {"@attr": {"position": "3"}, "title": "Hard Candy", "url": "http://www.last.fm/music/Madonna/Hard+Candy", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/74348764.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/74348764.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/74348764.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/74348764.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "cd2c4216-f748-4199-b675-cf7f977abcd4"}, "wiki": {"content": "Give It 2 Me is the second single by American singer-songwriter Madonna from her eleventh studio album, Hard Candy. It was released in mid-2008 by Warner Bros. Records, and the music video features American singer-songwriter Pharrell, who co-wrote and co-produced the song. The song was performed during the Hard Candy Promo Tour and then the Sticky &amp; Sweet Tour as the closing song of the show. Williams made a guest appearance and co-performed the song with Madonna on October 11, 2008 at her concert in New York City and again on November 26, 2008 in Miami, Florida. The song received a Grammy nomination in 2009 for Best Dance Recording.\n \n The music video was filmed on April 3, 2008 in London, co-directed by fashion photographer Tom Munro and Nathan Rissman. Pharrell's part of the video was used during the performances of &quot;Give It 2 Me&quot; on the Hard Candy promotional tour. The full video was leaked on the video-sharing website YouTube on May 31, but was later removed by Warner Bros. The video was officially released on Yahoo!, AOL and iTunes stores worldwide on June 4, and premiered on Channel 4 in the UK on June 5. A teaser for the video was released on June 6. It premiered on MTV's TRL in the U.S. on June 10. The video featured Madonna and Pharrell singing in various backdrops while singing to the camera. Madonna's retro-chic look in the video was inspired by her photosession with Tom Munro for Elle magazine.\n \n The video starts with Madonna doing stretches infront of a wall-mirror in a short dress ala &quot;Hung Up&quot; as noises of traffic from the street is heard. Then the song starts and Madonna gyrates to the music. At the first verse Madonna is shown in a chic black dress with only stockings on the leg and retro makeup. As the bridge builds up, she is shown in front of a white screen dancing, also wearing a French cap and on a sofa. On the chorus, she dances and plays with an archlight and fondles with a long black fur. The second verse shows Madonna and Pharell trading video shots with Pharell wearing sunglasses in some of them. At the &quot;Get stupid&quot; interlude Pharell is shown getting stupid while dragging a Hermès Birkin bag along the floor behind Madonna. The video continues through Madonna's dancings through these scenes and ends with Madonna finally getting tired and falls asleep on the studio floor.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Give It 2 Me is the second single by American singer-songwriter Madonna from her eleventh studio album, Hard Candy. It was released in mid-2008 by Warner Bros. Records, and the music video features American singer-songwriter Pharrell, who co-wrote and co-produced the song. The song was performed during the Hard Candy Promo Tour and then the Sticky &amp; Sweet Tour as the closing song of the show. Williams made a guest appearance and co-performed the song with Madonna on October 11, 2008 at her concert in New York City and again on November 26, 2008 in Miami, Florida.", "published": "Wed, 25 Feb 2009 09:17:10 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Give It 2 Me", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Give+It+2+Me", "listeners": "190043", "comments": ["\"Is it me or Blurred Lines does really sound like Give It 2 Me?\" it does. pharrell produced both.", "♥", "GIVE IT TO ME, YEAAAAAAH. [9]", "Is it me or Blurred Lines does really sound like Give It 2 Me?", "Blurred Lines could never  [2]", "Blurred Lines could never", "love this", "GIVE IT TO ME, YEAAAAAAH. [8]", "GIVE IT TO ME, YEAAAAAAH. [7]", "Give me a record and I'll break it!", "GIVE IT TO ME, YEAAAAAAH. [6]", "Get stupid", "still so addicted to this song", "Amazing song! One of my favorites. I love Queen Madonna!", "GIVE IT TO ME, YEAAAAAAH. [5]", "Nice!", "Got no boundaries and no limits, if there's excitement, put me in it, if it's against the law, arrest me, if you can handle it, undress me.", "GIVE IT TO ME, YEAAAAAAH. [4]", "Madonna 22 A.C.", "Join please http://www.lastfm.es/group/%E2%99%A7++The+Pop+Royalty+%E2%99%A7"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}]}, "mbid": "1c172554-236a-4522-b467-e3db569b12ae", "duration": "286000", "playcount": "1456368", "id": "176796732"}}