{"track": {"album": {"@attr": {"position": "4"}, "title": "Femme Fatale", "url": "http://www.last.fm/music/Britney+Spears/Femme+Fatale", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/62804639.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/62804639.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/62804639.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/62804639.png", "size": "extralarge"}], "artist": "Britney Spears", "mbid": "9d789329-a57a-3776-aa97-908cd7e2deeb"}, "wiki": {"content": "&quot;I Wanna Go&quot; is a song by American recording artist Britney Spears, released as the third single from her seventh studio album, &quot;Femme Fatale&quot;. It was written and produced by Max Martin and Shellback, with additional writing by Savan Kotecha. Spears first posted a snippet of the track in February 2011, prior to the album's release. Following a poll on her official website in which fans could choose the third single of the album, &quot;I Wanna Go&quot; was announced as a single on May 13, 2011.\n \n &quot;I Wanna Go&quot; is a dance and Hi-NRG song that features a heavy bassline and drum fills reminiscent of New Order. The pre-chorus has a whistled hook that received comparisons to the music of Bob Sinclar and Frankie Knuckles. Spears' vocals are processed, and she squeals and stutters throughout the song. The lyrics of &quot;I Wanna Go&quot; feature Spears singing about losing inhibitions. The song received mixed to positive reviews from critics. Some praised it for being effective and highlighted its hook, while others dismissed the processed vocals. The song was treated with different remixes, including a Bollywood mix with guest vocals by Sonu Nigam, and another one by DJ Frank E and Alex Dreamz.\n \n After the release of Femme Fatale, &quot;I Wanna Go&quot; charted due to digital sales in the lower regions of the US Billboard Hot 100 and the Canadian Hot 100, and also topped the South Korean International chart. Following its release as a single, the song reached the top ten in several music markets, including Canada, France, Finland and the United States. However, it became one of her lowest peaking singles in countries such as Australia and New Zealand, and was the first single of her career that failed to chart in the United Kingdom. In the United States, &quot;I Wanna Go&quot; made Femme Fatale the first album by Spears to have three top ten singles.\n \n An accompanying music video for the song, directed by Chris Marrs Piliero, premiered on June 22, 2011. It depicts Spears daydreaming at a press conference about a series of events, including being chased by paparazzi cyborgs and being rescued by actor Guillermo Díaz. Piliero explained the video as &quot;a ridiculous, exaggerated rumor about her life and career.&quot; The video references films such as Half Baked, Crossroads, Terminator 2: Judgement Day and Michael Jackson's Thriller. It received positive reviews from critics, who praised its fun spirit. Spears has performed &quot;I Wanna Go&quot; at the Femme Fatale Tour (2011).\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;I Wanna Go&quot; is a song by American recording artist Britney Spears, released as the third single from her seventh studio album, &quot;Femme Fatale&quot;. It was written and produced by Max Martin and Shellback, with additional writing by Savan Kotecha. Spears first posted a snippet of the track in February 2011, prior to the album's release. Following a poll on her official website in which fans could choose the third single of the album, &quot;I Wanna Go&quot; was announced as a single on May 13, 2011.  ", "published": "Wed, 5 Oct 2011 23:56:07 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "I Wanna Go", "artist": {"url": "http://www.last.fm/music/Britney+Spears", "mbid": "2f4f5d16-7102-4110-97fd-f5c365d6bb26", "name": "Britney Spears"}, "url": "http://www.last.fm/music/Britney+Spears/_/I+Wanna+Go", "listeners": "262961", "comments": ["SHAME ON ME [2]", "best ff single [2]", "Masterpiece ♥ [24]", "NEW GREATEST HITS ON ITUNES! BUY NOW! \r\nhttps://itunes.apple.com/us/album/the-essential-britney-spears/id686778973?affId=2049132", "best ff single", "Masterpiece ♥ [23]", "Masterpiece ♥ [22]", "Masterpiece ♥ [21]", "Masterpiece ♥ [20]", "SHAME ON ME", "this song is good.....", "too need releaaase", "Hey other Brit fans - add me so I can listen to your radio and find more sweet pop tunes <3 TEAM BRITNEY", "Kool beat", "One of my pop pet peeves. sshh! ;)", "nice voice", "still good", "HINO! Brit <3", "Her best song since Piece of Me *-*", "Classic ♥"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/femme%20fatale", "name": "femme fatale"}]}, "mbid": "21047875-0f1c-4f3c-8887-5f2b6551e3b2", "duration": "207000", "playcount": "3495452", "id": "485778321"}}