{"track": {"album": {"@attr": {"position": "10"}, "title": "Change", "url": "http://www.last.fm/music/Sugababes/Change", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/61546321.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/61546321.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/61546321.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/61546321.png", "size": "extralarge"}], "artist": "Sugababes", "mbid": "0e6ddd9c-3c7c-4b86-8034-d903db63c0ce"}, "wiki": {"content": "&quot;Overload&quot; is a pop song performed and co-written by British group Sugababes. It was penned and co-produced by Jony Lipsey, Cameron McVey, Felix Howard and Paul Simm for the band's debut studio album One Touch (2001), and released as the Sugababes' debut single in the summer of 2000, receiving a generally positive reception from music critics.\n \n The song reached a peak position of number 6 on the UK Singles Chart, where it sold a total of 138,000 copies. It also reached the top ten in Austria, New Zealand, Switzerland, and Germany, where it peaked at number 3 and was certified gold by the IFPI with sales over 150,000 copies.\n \n Critical response\n \n &quot;Overload&quot; received a generally positive response from music critics. A review by Aidin Vaziri from Rolling Stone called the song &quot;a pulsating, cool-headed R&amp;B concoction&quot; and praised the group for their mature sound which made &quot;other girl groups...look utterly lightweight in comparison&quot;. \n \n Debbie Guirand, in a review for ManHunt.com, called the song &quot;catchy&quot; and was impressed by the Sugababes' ability to write their own lyrics as they had done for &quot;Overload&quot;. James Kimmitt, in a review for Drowned in Sound, was also impressed by the group's writing abilities and called the song &quot;brilliant&quot;. \n \n Although The Portland Mercury was not impressed by the Sugababes' debut album, giving it only two and a half stars out of five, the online entertainment website did give &quot;Overload&quot; positive reviews. The website called the song &quot;joyously overwhelming&quot; and gave it four out of five stars.\n \n Music video\n  \n Sugababes in the music video for &quot;Overload&quot;. From left to right: Mutya Buena &amp; Keisha Buchanan.The music video for &quot;Overload&quot; was directed by Phil Poynter and filmed in London, England in mid-2000.\n \n The video has no plot and is known for its fresh and simplistic style, a theme that they would continue in their early videos. It features the group in a variety of ever-changing outfits, singing the song in front of a plain white background, either by themselves or together as a group.\n \n \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Overload&quot; is a pop song performed and co-written by British group Sugababes. It was penned and co-produced by Jony Lipsey, Cameron McVey, Felix Howard and Paul Simm for the band's debut studio album One Touch (2001), and released as the Sugababes' debut single in the summer of 2000, receiving a generally positive reception from music critics.  The song reached a peak position of number 6 on the UK Singles Chart, where it sold a total of 138,000 copies.", "published": "Sat, 21 Feb 2009 16:13:35 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Overload", "artist": {"url": "http://www.last.fm/music/Sugababes", "mbid": "dfa715ac-b536-44df-af43-570d3ea3edec", "name": "Sugababes"}, "url": "http://www.last.fm/music/Sugababes/_/Overload", "listeners": "104726", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/sugababes", "name": "sugababes"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "23913c7d-4f2c-45ba-9b39-842f35f79f33", "duration": "275000", "playcount": "387343", "id": "1068070"}}