{"track": {"album": {"@attr": {"position": "8"}, "title": "Bad", "url": "http://www.last.fm/music/Michael+Jackson/Bad", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/91836323.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/91836323.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/91836323.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/91836323.png", "size": "extralarge"}], "artist": "Michael Jackson", "mbid": "609ed40f-0f1e-4ced-8397-43fe1e90a8ee"}, "wiki": {"content": "&quot;I Just Can't Stop Loving You&quot; is a popular ballad by singers Michael Jackson and <a href=\"http://www.last.fm/music/Siedah+Garrett\" class=\"bbcode_artist\">Siedah Garrett</a>. It was recorded in 1982 with overdubbed vocals by Siedah Garrett in 1987. Written and composed by Jackson, it was originally intended to be a duet between Jackson and his woman of choice: either Barbra Streisand or Whitney Houston. Even Aretha Franklin and Agnetha Fältskog (formally of ABBA) were offered the song, but all four had other obligations. However, songwriter and Quincy Jones protege Garrett, who wrote Jackson's memorable &quot;Man in the Mirror&quot;, volunteered to sing with Jackson thus giving Garrett her first hit since Dennis Edwards' 1984 hit, &quot;Don't Look Any Further&quot;. \n Garrett is quoted in The Billboard Book of Number One Hits by Fred Bronson that she was unaware she would be singing the song - although she had received a tape of it - until the day of the recording session, when Jones told her to step up to the microphone and sing it with Jackson. The song became the first of five consecutive number-one Billboard Hot 100 singles from Jackson's Bad album. It also reached number one on the R&amp;B and Adult Contemporary charts, Jackson's second number-one song on the AC chart (his first, coincidentally, had also been a duet: 1982's &quot;The Girl Is Mine&quot; with Paul McCartney). It was released without an accompanying music video.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=109\" rel=\"nofollow\"> I Just Can't Stop Loving You Songfacts</a>, on the album, this song begins with a spoken intro: Jackson saying, &quot;A lot of people misunderstand me. That's because they don't know me at all.&quot; His producer Quincy Jones had the idea to insert this intro, which gave a telling insight into Jackson's personality.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;I Just Can't Stop Loving You&quot; is a popular ballad by singers Michael Jackson and <a href=\"http://www.last.fm/music/Siedah+Garrett\" class=\"bbcode_artist\">Siedah Garrett</a>. It was recorded in 1982 with overdubbed vocals by Siedah Garrett in 1987. Written and composed by Jackson, it was originally intended to be a duet between Jackson and his woman of choice: either Barbra Streisand or Whitney Houston. Even Aretha Franklin and Agnetha Fältskog (formally of ABBA) were offered the song, but all four had other obligations.", "published": "Thu, 16 Dec 2010 19:21:52 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "I Just Can't Stop Loving You", "artist": {"url": "http://www.last.fm/music/Michael+Jackson", "mbid": "210769a3-4aca-4199-a2e1-676ef376e078", "name": "Michael Jackson"}, "url": "http://www.last.fm/music/Michael+Jackson/_/I+Just+Can%27t+Stop+Loving+You", "listeners": "261109", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/michael%20jackson", "name": "michael jackson"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/soul", "name": "soul"}, {"url": "http://www.last.fm/tag/king%20of%20pop", "name": "king of pop"}]}, "mbid": "2b79a846-06d6-41ac-b427-bad7dc118469", "duration": "259000", "playcount": "1111962", "id": "1031547"}}