{"track": {"album": {"@attr": {"position": "4"}, "title": "A Tribute to the Greatest Hits", "url": "http://www.last.fm/music/Madonna/A+Tribute+to+the+Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/41442107.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/41442107.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/41442107.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/41442107.png", "size": "extralarge"}], "artist": "Madonna", "mbid": ""}, "wiki": {"content": "Madonna cover\n American pop star Madonna released a cover version of the song in March 2000 to promote the soundtrack to her film The Next Best Thing (2000). Her cover is much shorter than the original (it contains only the beginning of the first verse and all of the second and sixth verses) and was recorded as a pop-dance song. Don McLean himself praised the cover, saying it was &quot;a gift from a goddess&quot;, and that her version is &quot;mystical and sensual.&quot;\n Due to the success of the single, it was included as a bonus track on her 2000 studio album Music, however this was not available on the North American version. Madonna explained in a 2001 interview on BBC Radio 1 with Jo Whiley, the reason that the song was omitted from her 2001 greatest hits compilation GHV2: &quot;It was something a certain record company executive twisted my arm into doing, but it didn't belong on the (Music) album so now it's being punished&quot;.\n \n Cover history::\n \n The cover was produced by Madonna and William Orbit, who had previously worked with her on the 1998 studio album Ray of Light and 1999 single &quot;Beautiful Stranger&quot;. Released in March 2000, the song was a big worldwide hit, reaching number one in many countries, including the United Kingdom, Canada, Australia, Italy, Germany (her first since &quot;La Isla Bonita&quot;, in 1987), Switzerland, Austria and Finland. The song was the 19th best selling of 2000 in the UK. There was no commercial single release in the US, but the single still reached the number twenty-nine spot on Billboard's Hot 100, based on airplay alone.\n \n The music video, directed by Philipp Stölzl, depicts a diverse array of Americans, including a scene showing a lesbian couple kissing, which resulted in the video being censored on certain music shows in the United States.[citation needed] Two official versions of the video were produced, the first of which now appears on Madonna's greatest-hits DVD compilation, Celebration, and was released as the official video worldwide. The second version was issued along with the &quot;Humpty Remix&quot;, a more upbeat and dance-friendly version of the song. This video was aired on MTV's dance channel in the United States to promote the film The Next Best Thing, starring Madonna and Rupert Everett; it contains totally different footage and new outtakes of the original and omits the lesbian kiss. Everett, who provides backing vocals in the song, is also featured in the video.\n \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Madonna cover\n American pop star Madonna released a cover version of the song in March 2000 to promote the soundtrack to her film The Next Best Thing (2000). Her cover is much shorter than the original (it contains only the beginning of the first verse and all of the second and sixth verses) and was recorded as a pop-dance song. Don McLean himself praised the cover, saying it was &quot;a gift from a goddess&quot;, and that her version is &quot;mystical and sensual.&quot;\n ", "published": "Thu, 18 Mar 2010 01:01:27 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "American Pie", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/American+Pie", "listeners": "115939", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/cover", "name": "cover"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "32a57ea4-57ba-476c-ba8e-30272623ab88", "duration": "276000", "playcount": "622291", "id": "15422"}}