{"track": {"album": {"@attr": {"position": "1"}, "title": "The Fame", "url": "http://www.last.fm/music/Lady+Gaga/The+Fame", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92535051.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92535051.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92535051.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92535051.png", "size": "extralarge"}], "artist": "Lady Gaga", "mbid": "9d898a2a-6ca2-3ae6-a16d-b2677b8004f3"}, "wiki": {"content": "&quot;Just Dance&quot; is an electropop/dance-pop song and lead single from Lady GaGa's first album, The Fame. The song is written by Lady GaGa and features Colby O'Donis, who is signed to the same label as Lady GaGa, and Akon, who provides backing vocals through Colby's verse and shortly afterwards. \n \n The track is co-written and produced by RedOne (most known for working with Akon, MJ, Shakira, Kat DeLuna). The song is said to be about a girl who is in a club, and she has apparently had so much to drink she cannot even remember what the club's name is.\n \n According to the <a href=\"http://www.songfacts.com/detail.php?id=12724\" rel=\"nofollow\">Just Dance Songfacts</a>, this was not only the breakthrough hit for Lady Gaga, but was also instrumental in introducing to the Top 40 a techno-synth sound that had been popular in Europe for the previous decade. Lady Gaga’s frequent co-writer and producer RedOne told Billboard the song, “was essentially a rock track but with synths instead of guitars. Big drums. The vocals were the melody, with a simple chorus. Thank God we were lucky and it was perfect timing. The moment the public heard it, they bought into it.”\n \n The song was featured in the final audition scene of <em>Make It Happen</em>, a 2008 film starring Mary Elizabeth Winstead.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Just Dance&quot; is an electropop/dance-pop song and lead single from Lady GaGa's first album, The Fame. The song is written by Lady GaGa and features Colby O'Donis, who is signed to the same label as Lady GaGa, and Akon, who provides backing vocals through Colby's verse and shortly afterwards.   The track is co-written and produced by RedOne (most known for working with Akon, MJ, Shakira, Kat DeLuna). The song is said to be about a girl who is in a club, and she has apparently had so much to drink she cannot even remember what the club's name is. ", "published": "Wed, 13 Apr 2011 17:19:27 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Just Dance", "artist": {"url": "http://www.last.fm/music/Lady+Gaga", "mbid": "650e7db6-b795-4eb5-a702-5ea2fc46c848", "name": "Lady Gaga"}, "url": "http://www.last.fm/music/Lady+Gaga/_/Just+Dance", "listeners": "872587", "toptags": {"tag": [{"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/lady%20gaga", "name": "lady gaga"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "", "duration": "242000", "playcount": "7450885", "id": "171956812"}}