{"track": {"wiki": {"content": "&quot;Scream &amp; Shout&quot; is a song by American recording artist will.i.am and Britney Spears, taken from the will's upcoming studio album #willpower (2012). After RCA Records executive vice president of promotions announced that Spears was going to take a break in 2012, the singer signed a contract to be a judge on the second season of American music competition show The X Factor. A few months later, she announced that she had collaborated with will.i.am on a new track; they worked together the previous year on two tracks for Femme Fatale , with one called &quot;Big Fat Bass&quot; making the final cut. Initially rumored to be called &quot;Sexy Sexy&quot; and set to be released on October 15, 2012, will.i.am pushed back the release date following unauthorized leaks of the album. &quot;Scream and Shout&quot; was then confirmed as a single, premiering on US and UK radio on November 19, 2012 and will officially be sent to mainstream radio through Interscope Records on November 27, 2012.\n \n &quot;Scream and Shout&quot; is is an upbeat dance song with lyrics about having a great time on a night out. The song's composition was compared to the ones of Azealia Banks, Madonna, Nicki Minaj, and P!nk. It interpolates a sample of the lyric &quot;It's Britney bitch&quot;, which was used on Spears' 2007 single &quot;Gimme More&quot;. Music critics were mostly positive towards the song's direction, deeming it as a dark, club track, despite noting the use of Auto-Tune on the vocals. An accompanying music video was shot on October 2012, and will be released following a live episode of The X Factor on November 2012.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Scream &amp; Shout&quot; is a song by American recording artist will.i.am and Britney Spears, taken from the will's upcoming studio album #willpower (2012). After RCA Records executive vice president of promotions announced that Spears was going to take a break in 2012, the singer signed a contract to be a judge on the second season of American music competition show The X Factor. A few months later, she announced that she had collaborated with will.i.am on a new track; they worked together the previous year on two tracks for Femme Fatale , with one called &quot;Big Fat Bass&quot; making the final cut.", "published": "Tue, 20 Nov 2012 00:11:51 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Scream & Shout (feat. Britney Spears)", "artist": {"url": "http://www.last.fm/music/will.i.am", "mbid": "005aa561-e596-47e4-b7f5-e680673cbfd6", "name": "will.i.am"}, "url": "http://www.last.fm/music/will.i.am/_/Scream+&+Shout+(feat.+Britney+Spears)", "listeners": "32229", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/farofa", "name": "farofa"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/stupid%20lyrics", "name": "stupid lyrics"}]}, "mbid": "", "duration": "127000", "playcount": "568503", "id": "616063905"}}