{"track": {"album": {"@attr": {"position": "8"}, "title": "So Fresh - The Hits of Summer 2008 & The Hits of 2007", "url": "http://www.last.fm/music/Gwen+Stefani/So+Fresh+-+The+Hits+of+Summer+2008+&+The+Hits+of+2007", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/69759756.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/69759756.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/69759756.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/69759756.png", "size": "extralarge"}], "artist": "Gwen Stefani", "mbid": ""}, "wiki": {"content": "&quot;About You Now&quot; is a BRIT Award-nominated pop song by British pop band Sugababes, written by Cathy Dennis and producer Dr. Luke for the group's fifth studio album, Change (2007). The song is the album's opening track, and was released as its leading single between September and October 2007.\n \n Upon its release, the song became the group's highest-charting single since 2005's &quot;Push the Button,&quot; reaching the top of the charts in Croatia, Estonia, Slovenia, Hungary and the UK, as well as the top 10 in Austria, Cyprus, Germany, Ireland, Norway, Poland, Spain, and others. An acoustic version of the song appears as a bonus track on the group's sixth studio album Catfights and Spotlights (2008).\n \n Release and reception\n \n The song itself combines &quot;pop,&quot; &quot;rock&quot; and &quot;electro,&quot; much like other songs produced by Dr. Luke. The album version, which is used in the music video, is longer than the radio version and includes an extra verse by Amelle and an extra bridge by Keisha. On September 8, 2007, Sugababes performed &quot;About You Now&quot; live on Ant &amp; Dec's Saturday Night Takeaway.\n \n &quot;About You Now&quot; received generally good reviews from both critics and fans. PopJustice described the song as a &quot;pop-electro-rock masterpiece.&quot; The blog's author Peter Robinson also stated that it &quot;wasn't trying to be clever and was simply an amazing pop song.&quot;\n Alex Fletcher of Digital Spy said &quot;the lyrics are Waterman-esque perfect pop with the added spice of Sugababes kinkiness.&quot;\n \n In January 2008 &quot;About You Now&quot; was nominated for a BRIT Award for Best British Single.\n \n \n Chart performance\n \n &quot;About You Now&quot; was released in the United Kingdom on September 17, 2007, debuting on the UK Singles Chart at number thirty-five on September 23, 2007 after the release of the remix package for legal download. A week later the official download of the song was released, and it climbed a record 34 places to the top of the chart, which was later outdone by Pink's &quot;So What&quot; which climbed 37 places. This feat made the Sugababes only the fourth act and second British act (behind Mika and his single &quot;Grace Kelly&quot;) to chart at number-one on download sales alone, thus making it the group's sixth number-one single domestically. The single spent four weeks at the top, surpassing the success of their previous biggest hit, 2005's &quot;Push the Button.&quot; According to VH1, it was ranked both the sixth most-downloaded and sixth best-selling single in the UK in the year of 2007. As of 31 December 2008, &quot;About You Now&quot; has sold 453,170 copies in the UK, and has become the girls' best selling single.\n \n In Ireland, &quot;About You Now&quot; debuted at number ten on the Irish Singles Chart on downloads alone. A week later, it climbed to number five with the physical release, and later peaked at number two for two weeks, becoming the Sugababes' fourth single to peak on particular position. In Austria, it debuted at number 13 on the Austrian Singles Chart where it peaked at number 4 in its third week, becoming the band's third biggest hit there after &quot;Push the Button&quot; and &quot;Overload&quot;. &quot;About You Now&quot; saw similar success in Germany where it also peaked at number four on German Singles Chart, eventually becoming the Sugababes' third biggest hit there, again behind &quot;Push the Button&quot; and &quot;Overload&quot;.[3] On the Australian ARIA chart, the song peaked at number 57.[3] In New Zealand despite spending 21 weeks on the charts it only mannaged to peak a 18.This Song Peaked AT MTV Adria Top 20 Chart At Number 2.In Serbia,song was two weeks number one on KG9 flash list.\n \n On 13 July, 2008, &quot;About You Now&quot; re-entered the UK Singles Chart at No. 48, moving to No. 34 the next week after being prominently featured in an episode of Hollyoaks. This version, recorded for Radio 1's Live Lounge, was used for the funeral of Max Cunningham. Chart show host Reggie Yates said it was one of a number of recent examples of songs seeing a download boost being used on television shows (e.g. Mint Royale's version of &quot;Singin' in the Rain&quot;).\n \n Music video\n \n The music video for &quot;About You Now&quot; was directed by Marcus Adams and shot on August 24, 2007 at the Festival Hall in Waterloo in London, England. Although various pictures of the clip were leaked on the net the following days, it was not until September 6 the full video made its world premiere via internet. By September 7, 2007 the video had also debuted on music channels. The video is dedicated to the late Tim Royes, who directed the videos for the Sugababes's 2006 singles &quot;Red Dress&quot; and &quot;Easy.&quot;\n The video has been viewed 13,877, 407 times, as of 30 January 2009. It is their most watched and most popular video.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;About You Now&quot; is a BRIT Award-nominated pop song by British pop band Sugababes, written by Cathy Dennis and producer Dr. Luke for the group's fifth studio album, Change (2007). The song is the album's opening track, and was released as its leading single between September and October 2007.  Upon its release, the song became the group's highest-charting single since 2005's &quot;Push the Button,&quot; reaching the top of the charts in Croatia, Estonia, Slovenia, Hungary and the UK, as well as the top 10 in Austria, Cyprus, Germany, Ireland, Norway, Poland, Spain, and others.", "published": "Sat, 21 Feb 2009 16:22:07 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "About You Now", "artist": {"url": "http://www.last.fm/music/Sugababes", "mbid": "dfa715ac-b536-44df-af43-570d3ea3edec", "name": "Sugababes"}, "url": "http://www.last.fm/music/Sugababes/_/About+You+Now", "listeners": "190720", "comments": ["Still one of the absolute best pop songs of the last decade. [2]", "Dance to it on the Dancefloor with that grazzy chicks-", "Still one of the absolute best pop songs of the last decade.", "This is still hands down one of their best singles. Simply gorgeous ♥", "Diction needs to improve.... it is 'you', not 'choo' [2]", "Timeless pop. [3]", "Timeless pop. [2]", "Can we bring yesterday back around? ♥", "Love this song!", "Diction needs to improve.... it is 'you', not 'choo'", "1 Million Scrobbles ♥", "Here's a cover I recorded of this song: http://soundcloud.com/vaev/about-you-now-sugagbes-cover", "All Fired Up nos parecidos :)", "\"I know everything changes\" (the lineup) joke\ni love this", "always sing this song. such a funky song", "ladyinskyblue: i don't agree; i don't really care either though ha.", "I like the Suabaes but this song is done better by Miranda Cosgrove sorry my opinion don't agree don't care.", "Heidi is now skating...........", "So pop-ish. But it's funky and happy.. and weeeeeeeeeeeeeee.... -_-\r\n\r\ndon't get me wrong i like it. i'm a girl. that's my excuse.", "pfff sugababes.... u.U"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/sugababes", "name": "sugababes"}]}, "mbid": "455af4df-93e0-42f0-b1ef-f98d1bd628cf", "duration": "212000", "playcount": "1114073", "id": "119935369"}}