{"track": {"album": {"@attr": {"position": "6"}, "title": "One of the Boys", "url": "http://www.last.fm/music/Katy+Perry/One+of+the+Boys", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92216597.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92216597.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92216597.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92216597.png", "size": "extralarge"}], "artist": "Katy Perry", "mbid": "7242d95b-7602-31d3-a296-4d804f70723f"}, "wiki": {"content": "&quot;Ur So Gay&quot; is the debut promotional single released by pop singer Katy Perry, produced by Greg Wells and engineered by Drew Pearson. The song was Perry's first major label release, and was later placed on her major label album, One of the Boys. The song was released digitally as well as a 12&quot; EP. Capitol Records offered this song as a free download on her website. The song failed to enter the Billboard Hot 100.\n \n When asked about her debut single, Perry said the song was a &quot;soft hello&quot;. The song &quot;wasn't meant to be a big single or show what the album is going to be all about. That was for my Internet bloggers, so I'm not coming out of nowhere.&quot; Perry's A&amp;R Chris Anokute confirmed this by saying that they had no plans for radio coverage but just wanted to put this &quot;novelty&quot; song out online as an introduction to see &quot;what the attraction was&quot;. As expected sales were low, but Anokute said the EP did well in terms of building a press story.\n \n For the release of the single, Perry's label told her to include a cover. She originally wanted to cover a Queen song, but couldn't think of a particularly club-worthy song. While at a club with her friends, The Outfield's &quot;Your Love&quot; was played. Perry said that when the song came on, every girl in the place went onto the dance floor, and she wanted to have that same effect.\n \n Promotion and reception\n A female blond performer onstage wearing a white tuxedo and singing to a microphone in her left hand. A similarly dressed woman claps on her left. They are encircled by a group of guys in roller skates. The backdrop display disco lights in red and yellow.\n Katy Perry perfoming &quot;Ur So Gay&quot; in the California Dreams Tour\n \n The song's lyrics have been described in a positive review as &quot;eighteen different kinds of wrong&quot;. The song itself has been described as an &quot;emo-bashing anthem that's either horribly homophobic, a sly piece of social commentary or, possibly, both&quot;. The St. Petersburg Times writes that the &quot;boyfriend-skewering...isn't homophobic, but it does pummel straight guys who can't handle her edge&quot;.\n \n Some critics, however, conclude the song is homophobic. Ugo.com says the song settles for &quot;catchphrase-homophobia&quot; while Allmusic describes the lyrics as &quot;gay-baiting&quot;\n \n \n Released -November 20, 2007 (2007-11-20)\n Format-Digital download\n Recorded-2007\n Genre-Pop rock\n Length-3:39\n Label-Capitol\n Writer-Katy Perry, Greg Wells\n Producer-Greg Wells\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Ur So Gay&quot; is the debut promotional single released by pop singer Katy Perry, produced by Greg Wells and engineered by Drew Pearson. The song was Perry's first major label release, and was later placed on her major label album, One of the Boys. The song was released digitally as well as a 12&quot; EP. Capitol Records offered this song as a free download on her website. The song failed to enter the Billboard Hot 100.  ", "published": "Sat, 18 Jun 2011 00:03:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Ur So Gay", "artist": {"url": "http://www.last.fm/music/Katy+Perry", "mbid": "122d63fc-8671-43e4-9752-34e846d62a9c", "name": "Katy Perry"}, "url": "http://www.last.fm/music/Katy+Perry/_/Ur+So+Gay", "listeners": "426653", "comments": ["\"I'm gay, and don't find this offensive, it's only straights that do. \"\r\n>I'm gay and I find this song extremely offensive. It's clearly using the word \"gay\" as a insult, the same word shouted at me and a lot of friends when we were bullied in high school.\r\nIt gets worse because she never ever apologized for it, yet she released the videoclip of firework as if she was always a LGBT-friendly singer.", "penis are ugly", "no, you dont even like...... penis!", "Oh I loooove it! Every Summer ♥", "I can't believe how good this song is. Makes me smile every time I listen to it.", "Grrr! Now I can't listen to Mozart without remeniscing about this song. :-) I love it!", "You're so indie rock it's almost an art. ♥", "Lyrically it's meh, but the singing and song itself are actually pretty good.", "Лол", "this is related to seth putnam", "plebs", "This song is amazing, shut up bitches! u.u", "the tags^^", "“uses the term gay as an insult unrelated to homosexuality and through this causes a significant amount of confusion”\r\nO________o", "Musa dos GAYS S2", "you are so faggot.", "eu sou gay", "Such a beautiful song and great vocals,wicked Katy!!!!", "\"Why is this on my satan metal station\" Hahahaha [2]", "i think this song using the newer version of gay, which means stupid or bad. Or gay as in the stereotypical homosexual man who is flamboyant, loves clothes, just an all around feminine guy. So she's calling him feminine (gay) but he's﻿ straight he just acts like a gay guy. If that makes sense. not sure"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/katy%20perry", "name": "katy perry"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/uses%20the%20term%20gay%20as%20an%20insult%20unrelated%20to%20homosexuality%20and%20through%20this%20causes%20a%20significant%20amount%20of%20confusion", "name": "uses the term gay as an insult unrelated to homosexuality and through this causes a significant amount of confusion"}, {"url": "http://www.last.fm/tag/funny", "name": "funny"}]}, "mbid": "458e2ec1-1852-466c-a94b-34b5dd9344ae", "duration": "219000", "playcount": "2126533", "id": "109862012"}}