{"track": {"album": {"@attr": {"position": "14"}, "title": "Katy Perry - Teenage Dream: The Complete Confection", "url": "http://www.last.fm/music/Katy+Perry/Katy+Perry+-+Teenage+Dream:+The+Complete+Confection", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/77841458.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/77841458.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/77841458.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/77841458.png", "size": "extralarge"}], "artist": "Katy Perry", "mbid": ""}, "wiki": {"content": "&quot;Part of Me&quot; is a song by American recording artist Katy Perry. The dance-pop and pop rock song was written by Perry and Bonnie Mckee, while production and additional songwriting was done by Lukasz Gottwald and Max Martin. In late 2010, the entire demo of the song leaked online, with music critics comparing the song to Perry's previous single &quot;California Gurls&quot; (2010) and speculating that the lyrics are addressed to the singer's ex-boyfriend Travis McCoy. However, it is clear from a reworked version of the song, leaked on February 11, 2012, that the track is directed at her ex-husband Russell Brand with the lyrics &quot;Keep your diamond ring&quot;.\n \n Background\n \n The track was written as part of the Teenage Dream sessions involving Perry, Dr. Luke, Bonnie Mckee, and Max Martin, along with &quot;Teenage Dream&quot;, &quot;Last Friday Night (T.G.I.F.)&quot; &amp; &quot;California Gurls&quot;. Katy and Bonnie McKee had been casual friends before Katy called her because she wanted help on a song called “Part of Me&quot;. According to Rolling Stone magazine McKee stayed up all night writing lyrics. By the time Perry heard the third line, she shouted, “We’re buying you a car!”. In an interview with blogger Akex Kazemi, McKee said about the song: &quot;The other one I wrote on, 'Part of Me' I heard is gonna be on a bonus version or something. That one is beautiful. Katy sings with so much emotion and when I heard the chorus for the first time it gave me chills. It is a very real, raw song.&quot; On December 30, 2010, the full demo of the track leaked online. According to MTV.com the song was rumored to be a leftover cut from her Teenage Dream recording sessions. However, fans have speculated that the track may be included in a re-release of the Grammy-nominated LP, which was unconfirmed at that time.\n \n In 2012, &quot;Part of Me&quot; received an official release as the lead single from the album's re-release. It will be available for digital download on February 21, 2012. On February 11, 2012, a day before the performance of new single on Grammy Award, final and complete version leaked on the internet with inclusion of new lines and changing the musical structure of music. On February 11, 2012, Capital Records announced Part Of Me would now be released on February 13, 2012\n \n According to James Dinh of MTV, the dance-pop, pop rock, and house song was produced &quot;by pop mastermind Dr. Luke&quot;, and noted that &quot;the pop star appears strong, bold and just a tad resentful after a breakup&quot; on the track. The singer declares herself unbreakable after a breakup, singing about it in lines such as &quot;Days like this I want to drive away/ Pack my bags and watch your shadow fade/ 'Cause you chewed me up and spit me out/ Like I was poison in your mouth/ You took my light, you drink me down/ That was then and this is now, now look at me.&quot; Dinh also compared &quot;Part of Me&quot; to Perry's previous single &quot;California Gurls&quot; (2010), stating that &quot;the tune's steady beat amplifies&quot; as the chorus starts. &quot;This is the part of me/ That you're never gonna ever take away from me/ Throw your sticks in the stones/ Throw your palms in your clothes/ But you're not gonna break my soul/ This is the part of me that you're never gonna ever take away from me,&quot; she sings. Chris Ryan also of MTV speculated that the song is directed to Perry's ex-boyfriend Travis McCoy, while New York magazine journalist Amanda Dobbis considered it as &quot;another break-up anthem&quot;.\n \n \n Released \tFebruary 13, 2012\n Genre \tDance-pop, pop rock\n Length \t3:35\n Label \tCapitol\n Writer(s) \tKaty Perry, Bonnie McKee, Lukasz Gottwald, Max Martin\n Producer \tDr. Luke, Max Martin\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Part of Me&quot; is a song by American recording artist Katy Perry. The dance-pop and pop rock song was written by Perry and Bonnie Mckee, while production and additional songwriting was done by Lukasz Gottwald and Max Martin. In late 2010, the entire demo of the song leaked online, with music critics comparing the song to Perry's previous single &quot;California Gurls&quot; (2010) and speculating that the lyrics are addressed to the singer's ex-boyfriend Travis McCoy.", "published": "Mon, 13 Feb 2012 15:38:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Part of Me", "artist": {"url": "http://www.last.fm/music/Katy+Perry", "mbid": "122d63fc-8671-43e4-9752-34e846d62a9c", "name": "Katy Perry"}, "url": "http://www.last.fm/music/Katy+Perry/_/Part+of+Me", "listeners": "234481", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/katy%20perry", "name": "katy perry"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/for%20aerobics", "name": "for aerobics"}]}, "mbid": "48d61e94-f8b5-49b1-8cb8-4952193de592", "duration": "215000", "playcount": "2373858", "id": "430057546"}}