{"track": {"album": {"@attr": {"position": "1"}, "title": "4 Minutes - Single", "url": "http://www.last.fm/music/Madonna/4+Minutes+-+Single", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/45497985.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/45497985.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/45497985.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/45497985.png", "size": "extralarge"}], "artist": "Madonna", "mbid": ""}, "wiki": {"content": "&quot;4 Minutes&quot; is a song by American singer-songwriter Madonna from her eleventh studio album Hard Candy. It was released as the lead single from the album on March 17, 2008, by Warner Bros. Records. The song's development was motivated by a sense of urgency to save the planet from destruction, and how people can enjoy themselves in the process. The writing was completed through discussions between Madonna and Justin Timberlake about different situations, issues and relationships. According to Madonna, the song inspired her to produce the documentary I Am Because We Are.\n \n The song features vocals by American musicians Timberlake and Timbaland. It was recorded at Sarm West Studios in London, while the mixing of the track was finished at The Hit Factory studio in Miami. Sound engineer Demacio &quot;Demo&quot; Castellon first worked on the vocals of the track, by honing them according to his instincts, and then worked on the beats and the synths composed by Timbaland and Danja. An uptempo dance song with an urban, hip hop style, &quot;4 Minutes&quot; also incorporates Timbaland's characteristic bhangra beats and the instrumentation used in the song includes brass, foghorns and cow bells. The song's lyrics carry a message of social awareness, inspired by Madonna's visit to Africa and the human suffering she witnessed there.\n \n &quot;4 Minutes&quot; has been praised by many contemporary critics who called it a busy, dance track and complimented its music, which was compared to that of a marching band. Some however noted that Madonna, rather than Timberlake, appeared as more of a featured artist in the song. &quot;4 Minutes&quot; achieved worldwide success by reaching number one in twenty-one countries, including Australia, Canada, Germany, Italy, Spain and the United Kingdom. In the United States, &quot;4 Minutes&quot; peaked at number three on the Billboard Hot 100, giving Madonna her 37th top-ten single, breaking the record previously held by Elvis Presley as the artist with most top-ten hits. It is also her second multi-platinum certified single in that country, after &quot;Vogue&quot; from 1990.\n \n In the song's accompanying music video, Madonna and Timberlake sing and run away from a giant black screen that devours everything in its path. At the end of the video, Madonna and Timberlake are consumed by the screen. &quot;4 Minutes&quot; was performed by Madonna on the promotional tour for Hard Candy and the Sticky &amp; Sweet Tour. In the latter, the song served as the opener of the rave segment, where Madonna wore a futuristic robotic dress. During performances of the song, Timberlake and Timbaland appeared on video screens and sang their lines. The song received two Grammy Award nominations for &quot;Best Pop Collaboration with Vocals&quot; and &quot;Best Remixed Recording, Non-Classical.&quot;\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;4 Minutes&quot; is a song by American singer-songwriter Madonna from her eleventh studio album Hard Candy. It was released as the lead single from the album on March 17, 2008, by Warner Bros. Records. The song's development was motivated by a sense of urgency to save the planet from destruction, and how people can enjoy themselves in the process. The writing was completed through discussions between Madonna and Justin Timberlake about different situations, issues and relationships. According to Madonna, the song inspired her to produce the documentary I Am Because We Are. ", "published": "Wed, 21 Dec 2011 18:33:13 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "4 Minutes", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/4+Minutes", "listeners": "218409", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/timbaland", "name": "timbaland"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "", "duration": "243000", "playcount": "1788416", "id": "170334644"}}