{"track": {"album": {"@attr": {"position": "15"}, "title": "Hits", "url": "http://www.last.fm/music/Phil+Collins/Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87831627.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87831627.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87831627.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87831627.jpg", "size": "extralarge"}], "artist": "Phil Collins", "mbid": ""}, "wiki": {"content": "In the Air Tonight is a song by Phil Collins which first appeared on his 1981 album, Face Value. It was the first single of Collins' solo career, and remains one of his best known hits.\n \n The recording is notable for its atmospheric production and macabre theme. Released in January 1981 in the UK, the single was an instant hit, quickly climbing to Number 2 in the Singles Chart. It was also an international hit, reaching the top 20 on the Billboard Chart in the summer of 1981.\n \n &quot;In the Air Tonight&quot; remains, alone among Collins' solo oeuvre, a popular selection on many classic rock radio stations. It is the song most often associated with Collins' solo career, and he has performed versions of it at many events, notably at Live Aid, where he played the song on the same calendar day in both Philadelphia and London. He also performed the song at The Secret Policeman's Ball.\n \n The lyrics of the song take the form of a dark monologue directed towards an unnamed, possibly prominent person.\n \n Musically the song consists of a series of ominous chords played over a simple drum machine pattern (the Roland CR-78 Disco-2 pattern, plus some programming); processed electric guitar sounds and vocoded vocals on key words add additional atmosphere. The mood is one of restrained anger until the final chorus when an explosive burst of drums releases the musical tension, and the instrumentation builds to a thundering final chorus.\n \n Collins wrote the song in the wake of a failing relationship with his then-wife. Collins has described obtaining the drum machine specifically to deal with these personal issues through songwriting, telling Mix magazine: &quot;I had to start writing some of this music that was inside me.&quot;\n \n The song's popularity in the 1980s increased after a nearly complete recording of it was featured in the pilot episode of the American television show Miami Vice (&quot;Brother's Keeper&quot;), thus becoming one of the first pop/rock songs to be featured as part of a TV programme in this manner. On the heels of this successful merging of media, Collins became associated with the show; other Collins tracks including &quot;Take Me Home&quot; were later featured and Collins himself also acted in an episode, &quot;Phil the Shill&quot;.\n \n The song was remixed in 1988 by Ben Liebrand for his weekly appearance in the Curry &amp; van Inkel radio show on Dutch radio. The mix was completed and then taken by Liebrand to be part of a mix showcase at the DMC Mixing Championship Finals in London. This mix was picked up by Virgin records for an official release, which hit Number 4 in the UK charts.\n \n Interestingly, Phil Collins maintains the song was originally written for Genesis's 1980 album Duke but was rejected by fellow members Tony Banks and Mike Rutherford.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "In the Air Tonight is a song by Phil Collins which first appeared on his 1981 album, Face Value. It was the first single of Collins' solo career, and remains one of his best known hits.  The recording is notable for its atmospheric production and macabre theme. Released in January 1981 in the UK, the single was an instant hit, quickly climbing to Number 2 in the Singles Chart. It was also an international hit, reaching the top 20 on the Billboard Chart in the summer of 1981.  ", "published": "Tue, 24 Jul 2012 14:42:56 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "In the Air Tonight", "artist": {"url": "http://www.last.fm/music/Phil+Collins", "mbid": "401c3991-b76b-499d-8082-9f2df958ef78", "name": "Phil Collins"}, "url": "http://www.last.fm/music/Phil+Collins/_/In+the+Air+Tonight", "listeners": "508969", "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/phil%20collins", "name": "phil collins"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}]}, "mbid": "506d3eff-43f8-4857-90ca-6abc706576c8", "duration": "329000", "playcount": "2477745", "id": "1004233"}}