{"track": {"album": {"@attr": {"position": "14"}, "title": "Ultimate Kylie", "url": "http://www.last.fm/music/Kylie+Minogue/Ultimate+Kylie", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/72341670.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/72341670.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/72341670.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/72341670.png", "size": "extralarge"}], "artist": "Kylie Minogue", "mbid": "eb44f52f-9bcc-4efe-84a4-0b609c1f7265"}, "wiki": {"content": "Come into My World was the fourth and final single from Kylie Minogue's 2001 album, Fever, released in 2002. It won the 2004 Grammy Award for Best Dance Recording.\n \n The accompanying video features Kylie strolling around a city block within the Boulogne-Billancourt suburb of Paris, France. Each time she completes a circuit of the area, a new Kylie emerges from one of the stores (which is in fact the 'old' Minogue, that did the circuit the first time around), and each of the people in the background are also duplicated in slightly different positions. By the time the video concludes there are four unpertubed Minogues amidst an extremely chaotic scene with each background extra also depicted four times. The video ends as a fifth Minogue emerges. The video was directed by Michel Gondry and updated a concept that he had used in Neneh Cherry's Feel It music video.\n \n It bears noting that the video is also similar to a past video, Did It Again, where there were four Minogues. The video was filmed on September 8, 2002 with 50 extras on hand, including actor Sacha Bourdo. It took over fifteen takes to create the desired effect. Fifteen days were required for the video's special effects. The video placed at #3 in a countdown of greatest music videos in Channel 9's countdown show 20 to 1.\n \n The video was directed in Paris on October 21, 2002.\n \n In November 2002, the single debuted and peaked at number eight on the UK Singles Chart and number four on the Australian ARIA Chart. The song has been certified Gold in Australia.\n \n In early 2003, the song reached number 91 on the Billboard Hot 100 and number 20 on the Billboard Dance/Club Play chart. The song also charted in the Top in many other countries including South Africa, Slovenia, Israel, Singapore, Romania, Russia and it hit number-one also in Mexico[1].\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Come into My World was the fourth and final single from Kylie Minogue's 2001 album, Fever, released in 2002. It won the 2004 Grammy Award for Best Dance Recording.  The accompanying video features Kylie strolling around a city block within the Boulogne-Billancourt suburb of Paris, France. Each time she completes a circuit of the area, a new Kylie emerges from one of the stores (which is in fact the 'old' Minogue, that did the circuit the first time around), and each of the people in the background are also duplicated in slightly different positions.", "published": "Mon, 21 Jul 2008 12:59:35 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Come Into My World", "artist": {"url": "http://www.last.fm/music/Kylie+Minogue", "mbid": "2fddb92d-24b2-46a5-bf28-3aed46f4684c", "name": "Kylie Minogue"}, "url": "http://www.last.fm/music/Kylie+Minogue/_/Come+Into+My+World", "listeners": "165112", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/kylie%20minogue", "name": "kylie minogue"}]}, "mbid": "50f7db6f-10e2-4b8e-b804-1734dcdc8fd3", "duration": "249000", "playcount": "827001", "id": "1014188"}}