{"track": {"album": {"@attr": {"position": "1"}, "title": "The Best Damn Thing (Deluxe Edition)", "url": "http://www.last.fm/music/Avril+Lavigne/The+Best+Damn+Thing+(Deluxe+Edition)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/84574227.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/84574227.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/84574227.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/84574227.png", "size": "extralarge"}], "artist": "Avril Lavigne", "mbid": ""}, "wiki": {"content": "&quot;Girlfriend&quot; a song by Canadian Pop Rock superstar singer Avril Lavigne, is the lead single from her third album, The Best Damn Thing (2007). It was produced by Lukasz Gottwald. &quot;Girlfriend&quot; became Lavigne's biggest hit in the United States, where it reached number one on the U.S. Billboard Hot 100. It topped the chart in Australia for 6 weeks, and reached number two in the United Kingdom. A remix featuring rapper Lil Mama was released in June 2007.\n \n &quot;Girlfriend&quot; was premiered on Edmonton radio station The Bounce 91.7 before the official date it was supposed to be aired; the two DJs who played it were taken off the air shortly after. The single appeared and was available for download on the U.S. iTunes Store on February 23, but was subsequently removed the following day. It was made available again on February 27.\n \n Because of digital download sales in excess of 122,000, the song debuted at number five on the U.S. Billboard Hot 100 chart, the highest debut of her career.[18] Afterwards it became Lavigne's first song to reach number one on the Hot 100, in the issue dated May 5, 2007; her previous highest peak on the chart was with 2002's &quot;Complicated&quot;, which reached number two.[19] It remained in the top ten for eighteen weeks,[20] and has since been downloaded over 2.6 million times. [21]\n \n &quot;Girlfriend&quot; debuted on the Australian ARIA Singles Chart at number three. The following week it reached number-one, and it remained at the top for six non-consecutive weeks, equalling Lavigne's previous number-one single on the ARIA Charts, &quot;Complicated&quot;. After three weeks on the charts, it was certified gold by ARIA, then platinum after seven weeks for sales in excess of 70,000 copies.[22] It was then certified double platinum, sales in excess of 140,000. In 2008, it was certified quadruple platinum for sales of 280,000. [23]\n \n On the UK Singles Chart, &quot;Girlfriend&quot; peaked at number two, surpassing &quot;Complicated&quot; as Lavigne's highest peaking single on the chart. The song ended 2007 as the years 20th biggest-selling single in the UK.[24]\n \n In Latin America, the single peaked at number three.[25] In Mexico, the song became the second top ten single in English of 2007 when it climbed to number eight; it later peaked at number two.[26] It won the Award for &quot;Canción del Año&quot; (Song Of The Year) in &quot;Los Premios MTV Latinoamérica 2007&quot; (The Latin American MTV Awards) and was nominated for &quot;Monster Single&quot; in the MTV Video Music Awards 2007.[27][28] It won Most Addictive Track (Single Of The Year) at the MTV Europe Music Awards.\n \n 'Girlfriend' was the lead single from Avril's third album '<a title=\"Avril Lavigne - The Best Damn Thing\" href=\"http://www.last.fm/music/Avril+Lavigne/The+Best+Damn+Thing\" class=\"bbcode_album\">The Best Damn Thing</a>' and raced to No.2 in March 2007 – her biggest hit here to date. The track combines beefy power chords, hand-claps and a girl-group style chorus resulting in a fun, energetic sound with a punk-rock twist.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Girlfriend&quot; a song by Canadian Pop Rock superstar singer Avril Lavigne, is the lead single from her third album, The Best Damn Thing (2007). It was produced by Lukasz Gottwald. &quot;Girlfriend&quot; became Lavigne's biggest hit in the United States, where it reached number one on the U.S. Billboard Hot 100. It topped the chart in Australia for 6 weeks, and reached number two in the United Kingdom. A remix featuring rapper Lil Mama was released in June 2007.  ", "published": "Tue, 16 Apr 2013 14:27:08 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Girlfriend", "artist": {"url": "http://www.last.fm/music/Avril+Lavigne", "mbid": "0103c1cc-4a09-4a5d-a344-56ad99a77193", "name": "Avril Lavigne"}, "url": "http://www.last.fm/music/Avril+Lavigne/_/Girlfriend", "listeners": "478849", "comments": ["Still LOVE this song! Loads of memories ♥ (2)", "can't believe this is her biggest hit [2] this song really doesn't show off her talent ugh", "i'm the motherfucking princess [12]", "very good song", "love this song,is cool", "can't believe this is her biggest hit", "super song,hey hey", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK", "i'm the motherfucking princess [10]", "hell yeah I\"m the motherfucking princess", "i'm the motherfucking princess [9]", ">tfw no gf [2]", "This still slays me :(", "I love this song!", "i'm the motherfucking princess [8]", "Still LOVE this song! Loads of memories ♥", "Goddamn awful.", ">tfw no gf", "Still blows my mind that \"Girlfriend\" music video was the most watched video on Youtube.", "i'm the motherfucking princess [7]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/pop%20rock", "name": "pop rock"}, {"url": "http://www.last.fm/tag/avril%20lavigne", "name": "avril lavigne"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "521c0b73-d3a1-4fda-a7c4-71389c13b6ff", "duration": "256000", "playcount": "3627188", "id": "79231227"}}