{"track": {"wiki": {"content": "&quot;Stay&quot; is a song by Barbadian recording artist Rihanna from her seventh studio album Unapologetic (2012). Featuring guest vocals by Mikky Ekko, the song was released as the second single from the album on January 7, 2013. &quot;Stay&quot; was co-written by Mikky Ekko and Justin Parker. It is a pop and R&amp;B ballad, featuring piano and guitar chords. The lyrical content regards the temptation and failure of resisting a true love. The song garnered a mostly positive response from music critics. They were divided in their opinion regarding the balladry, with most describing it as a standout track on the album, while a few labeled it as boring. However, critics were unified in their opinion of praising the vocal performance and emotion.\n Upon the release of Unapologetic, &quot;Stay&quot; charted on multiple charts worldwide. Following its release as a single, it has reached number one in Denmark and Israel and the top ten in seventeen countries including Australia, France, Germany, New Zealand, Switzerland and the United Kingdom. It has also charted at number three on the US Billboard Hot 100, becoming Rihanna's twenty-fourth top ten on the chart, thus surpassing Whitney Houston's tally. Furthermore, it has charted at number 17 on the US Pop Songs chart, and marked top twenty positions in Norway and Spain.\n The song's music video, directed by Sophie Muller, depicts Rihanna naked in a bathtub filled with cloudy water, while Mikky Ekko performs in a separate bathroom. Critics compared the vulnerability and raw emotion in the video to the song itself. Rihanna premiered &quot;Stay&quot; on Saturday Night Live in the United States, while she performed the song in the United Kingdom on the ninth series of The X Factor. The track was also included on the set list of the majority of her 777 Tour promotional tour dates, in support of the album. Rihanna and Mikky Ekko also performed &quot;Stay&quot; at the 2013 Grammy Awards.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Stay&quot; is a song by Barbadian recording artist Rihanna from her seventh studio album Unapologetic (2012). Featuring guest vocals by Mikky Ekko, the song was released as the second single from the album on January 7, 2013. &quot;Stay&quot; was co-written by Mikky Ekko and Justin Parker. It is a pop and R&amp;B ballad, featuring piano and guitar chords. The lyrical content regards the temptation and failure of resisting a true love. The song garnered a mostly positive response from music critics.", "published": "Sat, 2 Mar 2013 21:45:57 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Stay (feat. Mikky Ekko)", "artist": {"url": "http://www.last.fm/music/Rihanna", "mbid": "69989475-2971-49aa-8c53-5d74af88b8be", "name": "Rihanna"}, "url": "http://www.last.fm/music/Rihanna/_/Stay+(feat.+Mikky+Ekko)", "listeners": "68996", "comments": ["Better than Diamonds [13]", "Better than Diamonds [12]", "fell in ♥ from the first listen", "i tend to avoid her music, but this song is really good and she made interesting and imo very good choices in how she sang it. :)", "♥", "♥", "Better than Diamonds [11]", "Two of my idols in one song <3 love this so much", "Rihanna my queen <3", "Never gets old.", "Ouço toda noite antes de dormir ♥", "1.015.112 :3  ♥", "You cant overplay a song with Rihanna cause her voice is magic and ones you listen to her you can't stop!", "♥", "Riri <3", "A song you can listen on forever.", "song of my life :(", "1 009 942 есь. подключаюсь и я", "Até que fim 1 milhão de scrobbles.", "JESUS!!! Finally 1M scrobbles"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rihanna", "name": "rihanna"}, {"url": "http://www.last.fm/tag/ballad", "name": "ballad"}, {"url": "http://www.last.fm/tag/stay", "name": "stay"}, {"url": "http://www.last.fm/tag/love", "name": "love"}]}, "mbid": "", "duration": "200000", "playcount": "1096758", "id": "619351996"}}