{"track": {"album": {"@attr": {"position": "10"}, "title": "NRJ Hits 13", "url": "http://www.last.fm/music/Eri+esitt%C3%A4ji%C3%A4/NRJ+Hits+13", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/59334703.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/59334703.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/59334703.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/59334703.jpg", "size": "extralarge"}], "artist": "Eri esittäjiä", "mbid": ""}, "wiki": {"content": "Fuck You (also known as the working title &quot;Guess Who Batman&quot;) is the third single by English singer Lily Allen from her second album It's Not Me, It's You. It's released only in some countries.\n \n The song originally appeared on her Myspace page in 2008 alongside the songs &quot;I Could Say&quot; and &quot;I Don't Know&quot; (now known as &quot;The Fear&quot;), the song appeared under the title &quot;Guess Who Batman&quot;. The song's title was then changed to &quot;Get Wit the Brogram&quot;, it was later changed to &quot;GWB&quot;.\n \n Allen wrote that:\n “This song is not a direct attack at anyone, it was originally written about the BNP in the UK but then I felt this issue has become relevant pretty much everywhere, we are the youth, we can make coolness for our future, its up to us. Go green and hate hate.”\n \n However, the song might seem like a direct attack at George W. Bush and his politics. The lyrics contain common criticisms of the former American president, such as accusations of small-mindedness and warmongering. The first letters of the words in the original titles were also the same as president Bush's initials: &quot;Guess Who Batman&quot; and George Walker Bush.\n \n The song was later re-titled as its current name &quot;Fuck You&quot;. The song has also been titled as &quot;F**k You&quot;, which is the censored version of the song. The song was written by Lily Allen and Greg Kurstin.\n \n The song debuted at 37 in Canada, it has so far charted higher than &quot;Smile&quot; (86) but not as high as &quot;The Fear&quot; (33) despite not being released as an actual single. The song debut at 68 on the US Billboard Hot 100, it has so far charted higher than &quot;The Fear&quot; (80). The song charted at 154 in the UK, it is one of two songs on Lily's new album not to be released as a single but charted, the other one is &quot;Everyone's at It&quot; that charted at 117 on the UK Singles Chart. So, it states that &quot;Fuck You&quot; is actually more successful that most of Allen's previous singles, although it is not an actual single yet. In The Netherlands, the song debuted at 52 and jumped to 11 the next week on the Mega Top 100 and was released as the official second single from the album. &quot;Fuck You&quot; reached the No. 1 spot on iTunes Netherlands and iTunes Finland. &quot;Fuck You&quot; to date is Allen's biggest hit single so far in the Netherlands reaching number #3 on the Dutch Top 40, seven spots higher than her biggest hit so far: &quot;Smile&quot;. According to Billboard magazine for the date 23rd May the song was Number 1 in the Netherlands, Belgium and Finland.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Fuck You (also known as the working title &quot;Guess Who Batman&quot;) is the third single by English singer Lily Allen from her second album It's Not Me, It's You. It's released only in some countries.  The song originally appeared on her Myspace page in 2008 alongside the songs &quot;I Could Say&quot; and &quot;I Don't Know&quot; (now known as &quot;The Fear&quot;), the song appeared under the title &quot;Guess Who Batman&quot;. The song's title was then changed to &quot;Get Wit the Brogram&quot;, it was later changed to &quot;GWB&quot;.  Allen wrote that:\n ", "published": "Sun, 28 Jun 2009 11:03:35 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Fuck You", "artist": {"url": "http://www.last.fm/music/Lily+Allen", "mbid": "6e0c7c0e-cba5-4c2c-a652-38f71ef5785d", "name": "Lily Allen"}, "url": "http://www.last.fm/music/Lily+Allen/_/Fuck+You", "listeners": "470363", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/lily%20allen", "name": "lily allen"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/fuck%20you", "name": "fuck you"}]}, "mbid": "54d3c9ca-b144-4cc0-a12c-849371b243b0", "duration": "219000", "playcount": "3432886", "id": "226561582"}}