{"track": {"album": {"@attr": {"position": "3"}, "title": "Loud", "url": "http://www.last.fm/music/Rihanna/Loud", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88146101.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88146101.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88146101.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88146101.png", "size": "extralarge"}], "artist": "Rihanna", "mbid": ""}, "wiki": {"content": "&quot;Cheers (Drink to That)&quot; is a song recorded by Barbadian recording artist Rihanna, from her fifth studio album Loud (2010). The song impacted US mainstream and rhythmic radio on August 2, 2011, as the seventh and final single released from Loud. The song was written by Andrew Harr, Jermaine Jackson, Stacy Barthe, LP, Corey Gibson, Chris Ivery, Lauren Christy, Graham Edwards, Avril Lavigne and Scott Spock, while production of the song was completed by Harr and Jackson under their stage name, The Runners. &quot;Cheers (Drink to That)&quot; contains interpolations of Lavigne's &quot;I'm with You&quot;, which is featured on her debut album Let Go (2002). Lyrically, &quot;Cheers (Drink to That)&quot; is a party-drinking song, with multiple references to drinking alcohol, including Jameson Irish Whiskey.\n \n The song has received positive reviews from music critics, who praised the interpolation of Lavigne's &quot;I'm with You&quot; and also commented that it would be a successful club song due to its lyrical content. &quot;Cheers (Drink to That)&quot; peaked inside the top ten in New Zealand and Australia, and charted at numbers 5 and 6, respectively. The song also peaked at number 7 on the US Billboard Hot 100 chart, becoming the singers nineteenth top ten song on the chart. The music video for the song, directed by Evan Rogers and Ciara Pardo, shows footage of Rihanna on tour and different activities during her homecoming trip to Barbados. &quot;Cheers (Drink to That)&quot; was included on the set list of the Loud Tour (2011). The song was also performed at V Festival in the United Kingdom on August 20 and 21, 2011.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Cheers (Drink to That)&quot; is a song recorded by Barbadian recording artist Rihanna, from her fifth studio album Loud (2010). The song impacted US mainstream and rhythmic radio on August 2, 2011, as the seventh and final single released from Loud. The song was written by Andrew Harr, Jermaine Jackson, Stacy Barthe, LP, Corey Gibson, Chris Ivery, Lauren Christy, Graham Edwards, Avril Lavigne and Scott Spock, while production of the song was completed by Harr and Jackson under their stage name, The Runners.", "published": "Fri, 27 Jan 2012 16:05:07 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Cheers (Drink to That)", "artist": {"url": "http://www.last.fm/music/Rihanna", "mbid": "69989475-2971-49aa-8c53-5d74af88b8be", "name": "Rihanna"}, "url": "http://www.last.fm/music/Rihanna/_/Cheers+(Drink+to+That)", "listeners": "242564", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rihanna", "name": "rihanna"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/avril%20lavigne", "name": "avril lavigne"}]}, "mbid": "5845ba30-3b19-4ecf-8d1c-9f199a760915", "duration": "262000", "playcount": "1709376", "id": "453442322"}}