{"track": {"album": {"@attr": {"position": "5"}, "title": "Lotus (Deluxe Version)", "url": "http://www.last.fm/music/Christina+Aguilera/Lotus+(Deluxe+Version)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83858119.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83858119.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83858119.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83858119.png", "size": "extralarge"}], "artist": "Christina Aguilera", "mbid": ""}, "wiki": {"content": "'Your Body' is a song recorded by American singer Christina Aguilera. The song was written by Tiffany Amber, Savan Kotecha, Shellback, and produced by Max Martin for Aguilera's seventh studio album titled 'Lotus'. The official demo of 'Your Body' leaked online August 23, 2012. The official music video for &quot;Your Body&quot; was filmed on August 20 and August 21, 2012 in Los Angeles. \n \n Billboard reported that Aguilera was working hard on the follow-up to 2010's Bionic; Billboard's source said the &quot;club banger,&quot; produced by Swedish pop hit-maker Max Martin, featured a chorus built around the line, 'All I want to do is fuck your body.&quot; On August 23, 2012, a demo version of the song was leaked online. On September 12, 2012, Aguilera took to Twitter to reveal details about the album and the song, including the cover art. RCA Records premiered the song on Ryan Seacrest and radio on September 14, and it was available for on-line purchase three days later. The song was also sent to Top 40 Mainstream radio and Rhythmic radio on September 18.\n The cover artwork features Aguilera wrapped in a sheer blush-colored piece of fabric. Aguilera's appearance in the artwork was well-received by critics. TJ of Neon Limelight called the cover &quot;sizzling&quot; and wrote that it features her &quot;bodacious curves on full display.&quot; Byron Flitsch of MTV News praised the track, calling it &quot;a stunning cover art that has rendered us totally speechless.&quot; Danica Bellini of Mstarz wrote that &quot;the photo reveals a rather curvaceous and sexy 'Stripped' star&quot; and that &quot;Aguilera looks fantastic. Maggie Malach of AOL Music said it was a &quot;throwback to her 'Genie in a Bottle' days&quot; while Nicole James of Fuse compared it to the Marilyn Monroe photo shoot The Last Sitting.\n \n The song has received very positive reviews from music critics. Katie Hasty of HitFix wrote that &quot;Aguilera's voice is crisp and up-front in this boudoir battle cry, and the shuffling early '00s beat is prime for any number of potential remixes. Story Gilmore of Neon Limelight called it &quot;smoking hot&quot;. The review from The Guardian Express was positive, writing that &quot;the lyrics are easy to learn and the hook is catchy as hell. It also wrote that &quot;All in all, the track achieves what it’s set to do: show off Christina’s vocal talent pairing it with Martin’s catchy beats ensuring that it will be a club anthem for a few months.Jason Lipshut of Billboard saw it is &quot;not as sexually demonstrative as, &quot;Dirrty,&quot; but it is a new suggestive anthem for a self-proclaimed 'freak'. Amy Sciarretto of Pop Crush called the song &quot;Uber catchy yet, sexy, and sultry at the same time&quot; and praised Aguilera for using her &quot;God given talent, and belter's voice&quot;. Sciarretto concluded: &quot;This is 2012′s club banger that does away with subtext and hints. Xtina manages to walk the tightrope between electronically enhanced dance music and pretty pop, and she does it while wearing six-inch stilettos. Nice work, girl!.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "'Your Body' is a song recorded by American singer Christina Aguilera. The song was written by Tiffany Amber, Savan Kotecha, Shellback, and produced by Max Martin for Aguilera's seventh studio album titled 'Lotus'. The official demo of 'Your Body' leaked online August 23, 2012. The official music video for &quot;Your Body&quot; was filmed on August 20 and August 21, 2012 in Los Angeles.   Billboard reported that Aguilera was working hard on the follow-up to 2010's Bionic; Billboard's source said the &quot;club banger...", "published": "Fri, 21 Sep 2012 18:29:37 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Your Body", "artist": {"url": "http://www.last.fm/music/Christina+Aguilera", "mbid": "b202beb7-99bd-47e7-8b72-195c8d72ebdd", "name": "Christina Aguilera"}, "url": "http://www.last.fm/music/Christina+Aguilera/_/Your+Body", "listeners": "107784", "comments": ["1.919.882\r\nscrobbles acumulados", "Hino merecia hitar horrores", "2 milhões ♥", "I think you already know my name", "this should have been a fucking smash hit [38]", "this should have been a fucking smash hit [37]", "this should have been a fucking smash hit [36]", "this should have been a fucking smash hit [34]", "♥", "♥", "This song still SLAYS.", "this should have been a fucking smash hit [32]", "this should have been a fucking smash hit", "this should have been a fucking smash hit [31]", "this should have been a fucking smash hit [30]", "Deserved flop", "this should have been a fucking smash hit [29]", "this should have been a fucking smash hit [28]", "this should have been a fucking smash hit [27]", "this should have been a fucking smash hit [26]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/love%20at%20first%20listen", "name": "love at first listen"}, {"url": "http://www.last.fm/tag/best%20of%202012", "name": "best of 2012"}]}, "mbid": "58c03cbb-b39c-429e-9f2f-d632285c0f38", "duration": "240000", "playcount": "1908687", "id": "554827812"}}