{"track": {"album": {"@attr": {"position": "1"}, "title": "Madonna", "url": "http://www.last.fm/music/Madonna/Madonna", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87971743.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87971743.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87971743.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87971743.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "e014ecac-be11-41aa-98d3-a97a3fbdac08"}, "wiki": {"content": "&quot;Lucky Star&quot; is a song by American recording artist Madonna from her debut studio album of the same name. Released on April 19, 1984, by Sire Records, it was the fifth and the last single from the album. The song also appears on her hits compilations The Immaculate Collection (1990) and Celebration (2009). &quot;Lucky Star&quot; was written by Madonna and produced by Reggie Lucas. However, during recording, Madonna was not impressed by Lucas' version. She called her then boyfriend John &quot;Jellybean&quot; Benitez to remix the track according to her ideas. &quot;Lucky Star&quot; is a medium-paced dance track and combines the heavy beats of a drum with the sounds of a guitar played in a high riff. The lyrics juxtapose the male body with the heavenly stars in the sky.\n \n Both contemporary and old critics have praised the song, heralding it as the introduction to upbeat dance music. &quot;Lucky Star&quot; became Madonna's first top-five hit on the Billboard Hot 100, when it reached the peak position of four. It had already become Madonna's first number-one song on the Billboard dance charts, when it peaked the chart alongside previously released single &quot;Holiday&quot;.\n \n The music video portrayed Madonna dancing in front of a white background, accompanied by her dancers. After the video was released, Madonna's style and mannerisms became a fashion trend among the younger generation. Scholars noted that in the video, Madonna portrayed to herself as narcissistic and an ambiguous character. She referred herself as the lucky star, unlike the lyrical meaning of the song. Madonna performed the song in a number of live appearances, most recently at the Confessions Tour (2006). It has also been covered by a number of artists.\n \n Musically a medium-paced dance track, it starts off with a sparkle of synth note and is followed by heavy beats of electronic drum and handclaps. A guitar is played in high riff and a bubbling bass synth is produced to accompany the guitar sound. The song revolves around the &quot;Starlight, starbright&quot; hook for more than a minute, before going to the chorus. According to author Rikky Rooksby, the lyrics are repetitive and inane and revolves around the transparent ambiguity of the stars and juxtaposition of the male character with being a heavenly body in the sky. The song is set in the time signature of common time with a moderate dance tempo of 108 beats per minute. It is set in the key of G major with Madonna's voice spanning from the tonal nodes of G3 to F♯5. The song has a basic sequence of Gm—Am—Bbm—Dm—Eb—Fm as its basic chord progression.\n \n The music video was directed by Arthur Pierson, and was produced by Glenn Goodwin, while Wayne Isham was in charge of photography. At the time of the song's release, Madonna's style of dress was catching on as a fashion statement among club kids and her fans. The most prominent among her fashion accessories were the crucifixes she wore as earrings and necklaces. Madonna commented that wearing a rosarie and a crucifix is &quot;kind of offbeat and interesting. I mean, everything I do is sort of tongue-in-cheeks. Besides, the crucifixes seem to go with my name.&quot; In reality, she was trying to find a separate image for herself, being inspired by then artists like Boy George, Cyndi Lauper and David Bowie, and their constantly shifting image and persona. Madonna realised the importance of her music videos and its popularity via MTV—launched in 1984—was instrumental in popularising her image.\n \n The rush for Madonna's fashion was mainly started with the music video for &quot;Lucky Star&quot;. In the video, Madonna wore an all-black outfit with leggings, ankle boots, and belly button, with her tangled hair tied in a floppy black ribbon. This was coupled with a shiny black miniskirt, an earring on her right ear, cut-off gloves and rubber bangles. Madonna's friend Erica Bell was credited with designing the outfit, although biographer Mary Cross noted that Madonna was after all wearing her day-to-day outfit. Mary Lambert, then a Rhode Island School of Design graduate, was decided for directing the video. However, Arthur Pierson replaced her as the director. Warner Bros. gave Pierson a small budget to make the video, shot in an afternoon. The video starts with the close-up of Madonna's face, as she slides her sunglasses down her nose. This scene was a reference to the character of Lolita in Stanley Kubrick's 1962 film of the same name, and Audrey Hepburn in the movie Breakfast at Tiffany's (1961). The image then fades to white, denoting the celestial stars dazzle, and then resumes itself in color. Madonna is shown dancing against a stark white background, along with closeups of her mesmerised gaze. She is accompanied by Bell and brother Christopher, as backup dancers. The video ends with the initial black-and-white image repeated, but in retrograde, as Madonna puts back on the sunglasses. The taking down and putting up of those sunglasses provided a frame to contain the song, functioning like a curtain that marks the opening and closing of a stage performance.\n \n Dance historian Sally Banes, in her book Before, between, and beyond: three decades of dance writing, noted that the video portrayed Madonna as both the subject and the object of the song. She believed that in the video, Madonna taking off her sunglasses symbolised herself as a movie star, thus creating an ambiguous characterization of herself, and a narcissistic theme. Author Peter Goodwin, in his book Television under the Tories: Broadcasting Policy 1979 - 1997, commented that although &quot;Lucky Star&quot; is not a narrative video, in the clip Madonna plays at least four characters:—the person in sunglasses looking; a break-dancing girl; an androgynous social dancer; and a seductress. The juxtaposition of all these characterizations portray Madonna as a narcissistic self-lover. Images of Madonna's body writhing against the white background generates the question whether she is addressing her lover or herself in the song. According to Goodman, Madonna creates an eroticized woman for her own pleasure only. The Times noted that &quot;<del>he's sexy, but she doesn't need men [...] she's kind of there all by herself.&quot;</del>\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Lucky Star&quot; is a song by American recording artist Madonna from her debut studio album of the same name. Released on April 19, 1984, by Sire Records, it was the fifth and the last single from the album. The song also appears on her hits compilations The Immaculate Collection (1990) and Celebration (2009). &quot;Lucky Star&quot; was written by Madonna and produced by Reggie Lucas. However, during recording, Madonna was not impressed by Lucas' version.", "published": "Sun, 20 Dec 2009 00:59:47 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Lucky Star", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Lucky+Star", "listeners": "193931", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "5ee8aca0-5ac5-438e-88ee-efc356607a4a", "duration": "217000", "playcount": "874702", "id": "1018032"}}