{"track": {"album": {"@attr": {"position": "19"}, "title": "Greatest Hits: My Prerogative", "url": "http://www.last.fm/music/Britney+Spears/Greatest+Hits:+My+Prerogative", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/83238203.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/83238203.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/83238203.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/83238203.png", "size": "extralarge"}], "artist": "Britney Spears", "mbid": "980f5bb8-ac4a-4164-be78-bc75ae6b5c49"}, "wiki": {"content": "&quot;Do Somethin'&quot; was originally written and produced for European girl group Melodi Brown in late 2002. Their album and their version of the song were never released and the song was given to Britney.\n \n It was featured on her first greatest hits compilation, Greatest Hits: My Prerogative (2004). It was written and produced by Bloodshy &amp; Avant, with additional writing by Henrik Jonback and Angela Hunte. Originally, the song was never intended to be released as a single. Spears, however, wanted to shoot a music video for it, and had to convince her record company. It was then released on February 14, 2005 by Jive Records as the second single from the album worldwide except North America. The dance-pop song features usage of electric guitars, and its lyrics allude to having a good time and not caring about other people's judgement.\n \n &quot;Do Somethin'&quot; received generally favorable reviews from critics, and received comparisons to Gwen Stefani's 2004 single &quot;What You Waiting For?&quot;. Although the single was not released in the United States, it charted on many of Billboard's component charts due to digital downloads, managing to reach number 100 on the Hot 100. It was also successful worldwide, reaching top ten positions in countries such as Australia, Denmark, Sweden and the United Kingdom. By the end of 2005, &quot;Do Somethin'&quot; was one of the best-selling singles in Australia and Belgium that year.\n \n An accompanying music video, co-directed by Billie Woodruff and Spears, who is credited as her alter ego &quot;Mona Lisa&quot;, portrays the singer and four female friends dancing and performing in a nightclub. The usage of a Louis Vuitton dashboard in the video resulted in a lawsuit against Jive Records, which ended with Louis Vuitton winning 80,000 EUR in damages. The video was also banned in all European TV channels. Spears has performed &quot;Do Somethin'&quot; in the 2007 M+M's promo tour and the 2009 world tour, The Circus Starring Britney Spears.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Do Somethin'&quot; was originally written and produced for European girl group Melodi Brown in late 2002. Their album and their version of the song were never released and the song was given to Britney.  It was featured on her first greatest hits compilation, Greatest Hits: My Prerogative (2004). It was written and produced by Bloodshy &amp; Avant, with additional writing by Henrik Jonback and Angela Hunte. Originally, the song was never intended to be released as a single. Spears, however, wanted to shoot a music video for it, and had to convince her record company.", "published": "Sun, 5 Aug 2012 00:26:21 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Do Somethin'", "artist": {"url": "http://www.last.fm/music/Britney+Spears", "mbid": "2f4f5d16-7102-4110-97fd-f5c365d6bb26", "name": "Britney Spears"}, "url": "http://www.last.fm/music/Britney+Spears/_/Do+Somethin%27", "listeners": "101131", "comments": ["Flawless bitch is flawless.[2]", "Do you feel this? I know you feel this. Are you ready? I don't think so.", "What a bass O:", "FUCK, do somethin'! ♥ [23]", "Mona Lisa <3", "FUCK, do somethin'! ♥ [22]", "FUCK, do somethin'! ♥ [21]", "<3 amo", "FUCK, do somethin'! ♥ [20]", "Supermassive Black Hole.", "FUCK, do somethin'! ♥ [19]", "UP:\r\n\r\nhttp://www.lastfm.com.br/music/Britney+Spears/+images/87011529", "When I used to listen to this in those days I always heard as FAKE, do somethin'... lol xD", "FUCK, do somethin' ! ♥ [18]", "I thought she was saying FUNK, do somethin'...LMAO.", "FUCK, do somethin' ! ♥ [17]", "Flawless bitch is flawless.", "FUCK, do somethin' ! ♥ [15]", "Britney Army join please! http://www.lastfm.es/group/%E2%99%A7++The+Pop+Royalty+%E2%99%A7", "FUCK, do somethin' ! ♥ [14]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/britney%20spears", "name": "britney spears"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}]}, "mbid": "5f955107-598d-4a57-9e88-1298bfa271d7", "duration": "205000", "playcount": "831041", "id": "9392131"}}