{"track": {"album": {"@attr": {"position": "1"}, "title": "Doll Domination", "url": "http://www.last.fm/music/The+Pussycat+Dolls/Doll+Domination", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/71694968.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/71694968.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/71694968.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/71694968.png", "size": "extralarge"}], "artist": "The Pussycat Dolls", "mbid": ""}, "wiki": {"content": "When I Grow Up is the first single released by The Pussycat Dolls off their 2nd album &quot;Doll Domination&quot; which was released on September 25th, 2008.\n \n &quot;When I Grow Up&quot; samples the main riff from The Yardbirds song &quot;He's Always There&quot; off their 1966 studio album Roger the Engineer, and as a result, British songwriters Jim McCarty and Paul Samwell-Smith have received writing credits for the song.\n \n They have performed the song on the MTV Movie Awards, So You Think You Can Dance, Jimmy Kimmel, The Today Show and Fashion Rocks 2008.\n \n The music video was nominated for 6 MTV VMAs (including Video of the Year) and it won Best Dancing in a Video. \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "When I Grow Up is the first single released by The Pussycat Dolls off their 2nd album &quot;Doll Domination&quot; which was released on September 25th, 2008.  &quot;When I Grow Up&quot; samples the main riff from The Yardbirds song &quot;He's Always There&quot; off their 1966 studio album Roger the Engineer, and as a result, British songwriters Jim McCarty and Paul Samwell-Smith have received writing credits for the song.  They have performed the song on the MTV Movie Awards, So You Think You Can Dance, Jimmy Kimmel, The Today Show and Fashion Rocks 2008. ", "published": "Sun, 3 Feb 2013 04:13:35 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "When I Grow Up", "artist": {"url": "http://www.last.fm/music/The+Pussycat+Dolls", "mbid": "", "name": "The Pussycat Dolls"}, "url": "http://www.last.fm/music/The+Pussycat+Dolls/_/When+I+Grow+Up", "listeners": "477485", "comments": ["i love this song ^_^", "What's up,sexy?'';)", "WANNA SEE THE WORLD [3] ♥", "De longe, a melhor música delas. Sem falar na nostalgia que ela dá. *-*", "WHEN I GROW UP BE ON TV PEOPLE KNOW ME", "this is sooooooooooo my song^_^", "I love this song....", "pretty outfit", "♥ hahahaha ♥", "love it", "This songs reminds me of the \"Just Dance Coreography\"on Nintendo WII,it was so cool and fun :P", "Real sexy song [2] ♥", "\"In the acceptance speech, Nicole Scherzinger talked and talked and didn’t let her fellow girls say anything, so they had to shout things in order for people to hear them. It is rumored that Nicole’s egocentric attitude will eventually lead to the disappereance of the group, but maybe it won’t because Nicole already tried to release a solo album (Her Name Is Nicole) whose singles flopped so hard that it wasn’t even released.\" LOL who wrote this?", "The perfect Britney song that never was.", "I like the screamo cover better but this is cool :D", "So much memories with this song. <3", "WANNA SEE THE WORLD [2]", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK", "Hot track!", "I know a person who should have this as a theme song"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}, {"url": "http://www.last.fm/tag/the%20pussycat%20dolls", "name": "the pussycat dolls"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "60fe129c-4409-4069-9262-bb6f2277e299", "duration": "244000", "playcount": "2363703", "id": "199295061"}}