{"track": {"wiki": {"content": "&quot;Talk That Talk&quot; is a song by Barbadian recording artist Rihanna, recorded for her sixth studio album of the same name. The song features American rapper Jay-Z, marking their third major collaboration following &quot;Umbrella&quot; (2007) and &quot;Run This Town&quot; (2009); the latter also featuring Kanye West. &quot;Talk That Talk&quot; was written by Ester Dean, Mikkel S. Eriksen, Tor Erik Hermansen, Shawn Carter, Anthony Best, Sean Combs, Chucky Thompson and Christopher Wallace, and the production was handled by Eriksen and Hermansen under their stage name Stargate. Def Jam Recordings serviced the song to urban radio in the United States on January 17, 2012 as the third single from Talk That Talk. It was released in France as a CD single on March 26, 2012. &quot;Talk That Talk&quot; is a mid-tempo hip hop song that features a &quot;futuristic beat&quot; compiled with &quot;hard drums&quot; and &quot;dirty synths&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Talk That Talk&quot; is a song by Barbadian recording artist Rihanna, recorded for her sixth studio album of the same name. The song features American rapper Jay-Z, marking their third major collaboration following &quot;Umbrella&quot; (2007) and &quot;Run This Town&quot; (2009); the latter also featuring Kanye West. &quot;Talk That Talk&quot; was written by Ester Dean, Mikkel S. Eriksen, Tor Erik Hermansen, Shawn Carter, Anthony Best, Sean Combs, Chucky Thompson and Christopher Wallace, and the production was handled by Eriksen and Hermansen under their stage name Stargate.", "published": "Sun, 5 Aug 2012 18:43:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Talk That Talk", "artist": {"url": "http://www.last.fm/music/Rihanna", "mbid": "69989475-2971-49aa-8c53-5d74af88b8be", "name": "Rihanna"}, "url": "http://www.last.fm/music/Rihanna/_/Talk+That+Talk", "listeners": "129161", "comments": ["Nice, very nice. Don't care for the guy's voice, don't like his contrbution...", "\"One and two and three and four, come on let me know if you want some more\r\nYou know what I like right now get it right\r\nBoy talk that talk to me all night\r\nYeah boy I like it yeah boy I like it\r\nLove it when you talk that talk to me yeah\r\nYeah that talk to me yeah\r\nLove it when you talk that talk to me, yeah\"\r\n \r\nOrgasm on theat part of the song", "One of her best songs ever!", "<3", "Talk That Talk (feat. Jay-Z) [41]", "ew, hell no. i don't hear her singing \"Talk That Talk (feat. Jay-Z) to me all night\"", "Talk That Talk (feat. Jay-Z) [40]", "Talk That Talk (feat. Jay-Z) [39]", "Talk That Talk (feat. Jay-Z) [38]", "Talk That Talk (feat. Jay-Z) [37]", "Hot ♥", "Talk that Talk to me", "1&2&3&4 come and let me know if you want some....:p", "Hot Track ...........................................", "I LOVE THIS ONE :D", "♥loveloveloveeeeeeeeeeeeeeeeeee♥", "this song has been stuck in my head so much that I couldn't figure the name of it out, lol i was like i know this song is by rihanna but what's the name of it .", "Talk That Talk (feat. Jay-Z) [36]", "♥", "Talk That Talk (feat. Jay-Z) [35]"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/rihanna", "name": "rihanna"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/hip%20hop", "name": "hip hop"}]}, "mbid": "", "duration": "210000", "playcount": "678700", "id": "538072087"}}