{"track": {"album": {"@attr": {"position": "4"}, "title": "Love Angel Music Baby", "url": "http://www.last.fm/music/Gwen+Stefani/Love+Angel+Music+Baby", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92961231.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92961231.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92961231.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92961231.png", "size": "extralarge"}], "artist": "Gwen Stefani", "mbid": ""}, "wiki": {"content": "&quot;Cool&quot; is a pop rock song written by Gwen Stefani and Dallas Austin for Stefani's debut solo album Love. Angel. Music. Baby (2004). The song's musical-style and production were heavily inspired by pop and new wave music from the 1980s, and its lyrics chronicle a relationship in which two lovers have separated, but remain &quot;cool&quot; with each other as good friends. &quot;Cool&quot; received praise from pop music critics, and the media have drawn parallels between the song's lyrical content and the romantic relationship that Stefani had with Tony Kanal, a fellow group member of No Doubt.\n \n The song was released as the album's fourth single in mid-2005 (see 2005 in music) and entered the top twenty on the majority of the charts it appeared on. Although &quot;Cool&quot; failed to match the success of its predecessor &quot;Hollaback Girl&quot;, it reached number one in Canada.\n \n Background and writing\n \n The lyrics of &quot;Cool&quot; reflect Stefani's former relationship with No Doubt bassist Tony Kanal. Although their romantic relationship ended, Stefani's lyrics portray her attitude that it is &quot;cool&quot; that they still remain very good friends. Stefani and Kanal's relationship had provided the inspiration for No Doubt's &quot;Don't Speak&quot; (1995),[1] and while &quot;Cool&quot; presents an amicable friendship between former lovers,[2] &quot;Don't Speak&quot; is about a failing relationship and never arrives at a solution for the couple.[1] Stefani and Kanal supply the basis for the characters.\n \n Dallas Austin wrote &quot;Cool&quot; after listening to No Doubt's &quot;Underneath It All&quot; (2002).[3] He was unable to finish the song and asked Stefani if she wanted to co-write lyrics.[3] During a studio session together, they finished &quot;Cool&quot; in fifteen minutes.[2] &quot;When he told me about the track and where it came from for him, it just triggered something in me,&quot; Stefani said.[2]\n \n Because Austin had wanted to write a song about the aftermath of his failed relationship, the lyrics recall a romantic affiliation from the point of view of one who has moved on from their former lover. Stefani indicates that she is in a new relationship. They suggest a progression through a turbulent time to an understanding that takes their relationship to a level of respect.\n \n Stefani sums up the evolution of their relationship with the line &quot;after all that we've been through, I know we're cool&quot;. The former couple are now &quot;hanging out&quot; with Kanal's new girlfriend, while Stefani has married and is pleased that he calls her by her &quot;new last name&quot;.\n \n Stefani said that she had never intended to include &quot;personal&quot;[2] material on Love. Angel. Music. Baby. and commented, &quot;but no matter what you do, things just come out. It just ended this whole thing for me in my head, and it puts an end to a chapter in a really nice way.&quot;[2]\n \n &quot;Cool&quot; was featured in the comedy-drama film Click (2006).\n \n Music and structure\n \n &quot;Cool&quot; is a mid-tempo love song featuring New Wave production and is composed in D major. It is written in common time and moves at a moderate tempo of 112 beats per minute.[4] The song is written in the common verse-chorus form[4] and features five instruments: bass guitar, drums, guitar, keyboards, and synthesizer.[5] &quot;Cool&quot; opens with all five instruments, and as Stefani begins singing, the synthesizer is lowered, and the hard-hitting drum beat steadily increases in volume. She performs her highest pitch (C#5) during the chorus, after which she sings in a softer, almost sotto voice, and her lowest pitch (E3) at the beginning of the verses.\n \t\n &quot;Cool&quot;\n Play sound\n The song is composed in D major and features a 1980s musical-style with new wave production.\n Problems listening to this file? See media help.\n \n The synthesizer emulates brass and woodwind instruments, while the bass and guitar retain a prominent and regular eighth note pulse, using a I-IV-V chord progression for the verses. In the percussion section a drum kit is used, and the snare is introduced at the beginning of the first chorus, which maintains its beat. During the song's fade-out, Stefani repeats &quot;I know we're cool&quot; and &quot;yeah&quot;, and she occasionally emphasizes &quot;cool&quot;. Her vocal range covers close to two octaves.[4]\n \n Critical reception\n \n &quot;Cool&quot; was generally very well-received by contemporary pop music critics. LAUNCHcast's Jennifer Nine referred to the song as &quot;a liltingly sweet paean to post-break-up friendships&quot;,[6] while Allmusic wrote that the &quot;high school anthem-in-waiting&quot; exuded &quot;sleek, new wave textures&quot;.[7] Richard Smirke of PlayLouder commented that the song successfully used the same production formula as fellow album tracks &quot;Serious&quot; and &quot;What You Waiting For?&quot;, and described it as a &quot;crisp blend of edgy 21C production and early 80s Madonna-esque pop&quot;.[8]\n \n Jason Damas, in a review for PopMatters, characterized the song as &quot;a slippery slice of keyboard driven new wave pop that easily could've slotted into any No Doubt album ... pitched halfway between The Go-Go's and Cyndi Lauper&quot;, and added, &quot;the lyrics immediately ensure it will be sung along to by lonely 16-year-olds&quot;.[9] While Blender magazine ranked &quot;Cool&quot; at number forty-five on its list of &quot;The 100 Greatest Songs of 2005&quot;,[10] Bill Lamb of About.com felt that it &quot;doesn't immediately grab attention like her other singles&quot;[11] and the Toronto Star called it &quot;the year's love anthem, but at the cost of its short length and undeniable repetition&quot;\n \n Chart performance\n \n Although &quot;Cool&quot; was officially released to U.S. radio on July 5, 2005, it appeared a week early on Billboard magazine's Pop 100 Airplay chart. The song reached the top ten on the Pop 100, and the following week it debuted on the Hot 100, the official U.S. chart. &quot;Cool&quot; peaked at number thirteen in its eighth week and remained on the chart until its twentieth week. The song entered the top twenty on the majority of the Billboard charts on which it appeared, and its remixes topped the Hot Dance Music/Club Play chart in mid-November. While &quot;Cool&quot; proved somewhat popular on Adult Contemporary radio, it peaked inside the top five on the Adult Top 40 format and reached the top ten on the U.S. ARC Weekly Top 40, a chart unassociated with Billboard.\n \n In Canada &quot;Cool&quot; was officially released to radio on July 13, 2005. The song reached the top five on the Canadian BDS Airplay chart and remained in the top ten for another month. &quot;Cool&quot; debuted higher on the Canadian Singles Chart than it did in the U.S. and topped the chart three months later for two weeks, from October 13, 2005. It peaked higher in Canada than &quot;Hollaback Girl&quot;'s predecessor &quot;Rich Girl&quot;, while in the U.S. &quot;Rich Girl&quot; was the single that charted higher.\n The song was released in Australia, Europe and New Zealand on August 22, 2005. &quot;What You Waiting For?&quot; (Love. Angel. Music. Baby.'s first single) and &quot;Rich Girl&quot; reached the UK top five, but &quot;Hollaback Girl&quot; had only the top ten. &quot;Cool&quot; continued the trend of lower-charting singles when it debuted and peaked at number eleven. Stefani's previous singles had charted most strongly in Australia, where &quot;What You Waiting For?&quot; and &quot;Hollaback Girl&quot; debuted at number one and &quot;Rich Girl&quot; at number two. &quot;Cool&quot; debuted at number ten and quickly descended the chart, but widespread airplay and Stefani's concurrent promotional visit to Australia stimulated a resurgence of interest in L.A.M.B., which briefly reascended the albums chart again.\n \n Although &quot;Cool&quot; reached number one in Argentina (for the week of September 23, 2005) and the top ten in the Netherlands and New Zealand, it was a moderate top twenty success in Germany, Ireland, Italy, and Norway. The song peaked inside the top five on the airplay charts in Russia and South Africa, but was not commercially successful in Japan, where it reached number seventy-five on the airplay chart.\n \n &quot;Cool&quot; reached the top thirty in Brazil in early 2006.\n \n Music video\n \n The song's music video was directed by Sophie Muller and filmed in Lake Como, Italy.[12] The video follows the song's theme very closely and depicts the relationship that Stefani has with a former boyfriend, who is played by Spanish actor Daniel González. González and his new girlfriend (played by Tony Kanal's girlfriend, Erin Lokitz) are shown walking to a house. Stefani answers the door, and the three of them are seen in each other's company, with intercut scenes of Stefani rolling around on a bed. There are brief flashbacks to the time when Stefani and her former boyfriend were dating, where she wears a brunette wig, representing her younger self (her natural brown hair has not been seen since she was in ninth grade).[13] Flashbacks and modern day are linked with match cut cinematography. The lyrical theme of &quot;Cool&quot; is maintained in the video, frames are incorporated to portray Stefani feeling &quot;cool&quot;. She is depicted as &quot;cool&quot; with her former boyfriend and his girlfriend throughout most of the video.\n The video showcases the scenery of Como's forests, lakes and restaurants and was the first from Love. Angel. Music. Baby. not to include Stefani's Harajuku Girls, who were present throughout the majority of the album's promotion. The complete version of &quot;Cool&quot; featured in the music video was released commercially on CD single and digital download formats and introduced an orchestral arrangement that differs from the original 1980s composition on Love. Angel. Music. Baby.\n \n &quot;Cool&quot; premiered on MTV's top-ten chart program Total Request Live on June 30, 2005,[14] where it reached number three.[14] On VH1's Top 20 Video Countdown, the video peaked at number two.[15] After its July 8 debut on MuchMusic's Countdown, it reached number one for the week of October 7.[16] &quot;Cool&quot; debuted and peaked at number nine on LAUNCHcast's top one-hundred most-watched videos for the week of July 23.[17]\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Cool&quot; is a pop rock song written by Gwen Stefani and Dallas Austin for Stefani's debut solo album Love. Angel. Music. Baby (2004). The song's musical-style and production were heavily inspired by pop and new wave music from the 1980s, and its lyrics chronicle a relationship in which two lovers have separated, but remain &quot;cool&quot; with each other as good friends. &quot;Cool&quot; received praise from pop music critics, and the media have drawn parallels between the song's lyrical content and the romantic relationship that Stefani had with Tony Kanal, a fellow group member of No Doubt. ", "published": "Thu, 5 Nov 2009 05:44:04 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Cool", "artist": {"url": "http://www.last.fm/music/Gwen+Stefani", "mbid": "2e41ae9c-afd2-4f20-8f1e-17281ce9b472", "name": "Gwen Stefani"}, "url": "http://www.last.fm/music/Gwen+Stefani/_/Cool", "listeners": "502534", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/gwen%20stefani", "name": "gwen stefani"}, {"url": "http://www.last.fm/tag/cool", "name": "cool"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "mbid": "89243cc9-e091-4fef-9fe2-fd7680b4fdd6", "duration": "190000", "playcount": "2163326", "id": "9825570"}}