{"track": {"album": {"@attr": {"position": "25"}, "title": "Absolute Music 57", "url": "http://www.last.fm/music/Johnson+&+H%C3%A4ggkvist/Absolute+Music+57", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/7660291.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/7660291.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/7660291.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/7660291.jpg", "size": "extralarge"}], "artist": "Johnson & Häggkvist", "mbid": ""}, "wiki": {"content": "&quot;In My Arms&quot; is a song by Australian singer-songwriter Kylie Minogue from her tenth studio album, X (2007). The track was written by Minogue, Calvin Harris, Richard &quot;Biff&quot; Stannard, Paul Harris and Julian Peake. It was produced by Calvin Harris and Stannard. Initially, the song was released as the second single worldwide on 15 February 2008, while it was served as the third single in the United Kingdom, Australia and New Zealand. It has since also made an appearance on her 2012 greatest hits album, The Best of Kylie Minogue. The song was introduced by Harris while she was recording in a studio in Brighton.\n \n &quot;In My Arms&quot; is a synthpop inspired song, which features elements of retro and dance music as well. Lyrically, the songs is towards a lover by saying how it would feel in their arms. &quot;In My Arms&quot; received generally favorable reviews from some music critics, where some critics praised it as one of the best tracks on the album, and even some praised the lyrical content. However, some critics were critical towards the production of the song. Commercially, &quot;In My Arms&quot; was generally successful, peaking inside the top ten in countries including Romania, Belgium, France, Switzerland and the United Kingdom. However, the song experienced lower success in her native Australia, where it peaked at thirty-five, becoming her lowest charting single of the decade since &quot;Cowboy Style&quot;. The song was not served as a single in North America however.\n \n Minogue has performed the song on three of her concert tours. The first being the KylieX2008 Tour, where it featured her as a coachman in the 19th century, where the backdrop was only black and white. She additionally performed the song on her North American tour For You, For Me Tour, where it was served as the last song of the sets until the encore. She has recently performed the song on her Aphrodite World Tour in 2010. The music video for &quot;In My Arms&quot; was directed by Melina Matsoukas and filmed in Los Angeles, California, along with the video for &quot;Wow&quot;. The music video was also featured as the backdrop on her KylieX2008 Tour.\n \n Before the production of X, Minogue was diagnosed with breast cancer on May 17, 2005, leading to the postponement of the remainder of her Showgirl — The Greatest Hits Tour and her withdrawal from the Glastonbury Festival. While recovering in Melbourne, Minogue began writing lyrics towards the end of her cancer treatment in mid-2006, having not worked on any music for the previous year. Due to the recovery time following her cancer, X was the first album Minogue had consciously prepared for the recording of, having previously been engaged for much of her career in an endless cycle of record, release and tour.\n \n &quot;In My Arms&quot; was served as the album's second single worldwide, while it was the third single in the United Kingdom, Australia and New Zealand. Because of this, the aftermath single was &quot;Wow&quot;, which was the second single in those countries. However, because &quot;In My Arms&quot; was not released in North America, &quot;Wow&quot; was then served as the only club single in that country as they wanted &quot;All I See&quot; as the first mainstream single in North America. However, after the release, it was unsuccessful in the charts. It is also noted that &quot;In My Arms&quot; was released one day before the single &quot;Wow&quot;. Musically, &quot;In My Arms&quot; is a synthpop and dance-pop inspired song. it features musical elements including club, dance-pop, eurodance, pop and pop rock music. It is Minogue's first single to be issued on 7&quot; vinyl since 1997's &quot;Some Kind of Bliss&quot;.\n \n In Belgium, the track debuted on the Flemish singles chart at number number thirty-three on 3 February 2008. The following week it rose to number fourteen. The track was also successful on Belgium's Walloon singles chart where it reached number eleven. &quot;In My Arms&quot; reached number eight in Greece and Germany—where it became Minogue's first top ten single since 2003's &quot;Slow&quot;—, as well as number ten in France on the physical chart and number two on the downloads chart, becoming her biggest hit in France since 2001's &quot;Can't Get You Out of My Head&quot;. Elsewhere, the song reached the top five in the Czech Republic and Turkey, the top ten in Slovakia and Switzerland, and the top twenty in Austria, Ireland, the Netherlands and Sweden.\n \n The single entered the UK Singles Chart at number sixty-nine on downloads alone, peaking at number ten three weeks later. In Australia, &quot;In My Arms&quot; became Minogue's lowest-charting single in a decade (since 1998's &quot;Cowboy Style&quot;), peaking at number thirty-five and spending only two weeks in the top fifty. In the United States, though the song was not released officially, it received moderate airplay, charting on the American radio airplay chart in the first day of the plays at American radio.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;In My Arms&quot; is a song by Australian singer-songwriter Kylie Minogue from her tenth studio album, X (2007). The track was written by Minogue, Calvin Harris, Richard &quot;Biff&quot; Stannard, Paul Harris and Julian Peake. It was produced by Calvin Harris and Stannard. Initially, the song was released as the second single worldwide on 15 February 2008, while it was served as the third single in the United Kingdom, Australia and New Zealand.", "published": "Wed, 24 Jul 2013 22:50:22 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "In My Arms", "artist": {"url": "http://www.last.fm/music/Kylie+Minogue", "mbid": "2fddb92d-24b2-46a5-bf28-3aed46f4684c", "name": "Kylie Minogue"}, "url": "http://www.last.fm/music/Kylie+Minogue/_/In+My+Arms", "listeners": "246459", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/kylie%20minogue", "name": "kylie minogue"}, {"url": "http://www.last.fm/tag/electronic", "name": "electronic"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}]}, "mbid": "911357bd-9a45-4c29-baa3-1d2ee2b238ea", "duration": "211000", "playcount": "1805664", "id": "105497960"}}