{"track": {"album": {"@attr": {"position": "9"}, "title": "Stack-O-Tracks", "url": "http://www.last.fm/music/The+Beach+Boys/Stack-O-Tracks", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/75069216.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/75069216.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/75069216.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/75069216.png", "size": "extralarge"}], "artist": "The Beach Boys", "mbid": "70538a32-f163-4896-a22f-90a1f529ca56"}, "wiki": {"content": "&quot;Wouldn't It Be Nice&quot; is the opening track on the 1966 album <em>Pet Sounds</em> and one of the most widely recognized songs by the American pop group The Beach Boys. It was composed and produced by Brian Wilson, with lyrics by Tony Asher, Brian Wilson and Mike Love. The lead vocal was sung by Brian Wilson with Mike Love singing lead vocals on the bridge.\n \n The layering of harmonies upon harmonies, and lyrics on top of harmonies make this one of the quintessential Beach Boys songs. In the Endless Harmony documentary, Brian Wilson described the song as &quot;what children everywhere go through… wouldn't it be nice if we were older, or could run away and get married&quot;.\n \n Wilson was quoted as saying:\n \n     Listen for the rockin' accordions and the ethereal guitars in the introduction. Tony and I had visualized a scene. We had a feeling in our hearts, like a vibration. We put it into music, and it found its way onto tape. We really felt good about that record.\n \n In a 1996 interview, Wilson stated, &quot;'Wouldn't It Be Nice' was not a real long song, but it's a very 'up' song. It expresses the frustrations of youth, what you can't have, what you really want and you have to wait for it.&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Wouldn't It Be Nice&quot; is the opening track on the 1966 album Pet Sounds and one of the most widely recognized songs by the American pop group The Beach Boys. It was composed and produced by Brian Wilson, with lyrics by Tony Asher, Brian Wilson and Mike Love. The lead vocal was sung by Brian Wilson with Mike Love singing lead vocals on the bridge.  The layering of harmonies upon harmonies, and lyrics on top of harmonies make this one of the quintessential Beach Boys songs.", "published": "Mon, 25 Mar 2013 16:27:23 +0000"}, "streamable": {"#text": "1", "fulltrack": "0"}, "name": "Wouldn't It Be Nice", "artist": {"url": "http://www.last.fm/music/The+Beach+Boys", "mbid": "1d45138d-c675-4016-87a7-7ad5cce5e1bc", "name": "The Beach Boys"}, "url": "http://www.last.fm/music/The+Beach+Boys/_/Wouldn%27t+It+Be+Nice", "listeners": "622014", "toptags": {"tag": [{"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/oldies", "name": "oldies"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "mbid": "c094024e-4da2-4c06-8a7d-5aeeb80d2bed", "duration": "204000", "playcount": "3136784", "id": "1022213"}}