{"track": {"album": {"@attr": {"position": "2"}, "title": "Fantasy Ride (Limited Deluxe Edition)", "url": "http://www.last.fm/music/Ciara/Fantasy+Ride+(Limited+Deluxe+Edition)", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/27704065.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/27704065.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/27704065.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/27704065.jpg", "size": "extralarge"}], "artist": "Ciara", "mbid": ""}, "wiki": {"content": "&quot;Love Sex Magic&quot; is the second US single from Ciara's third studio album, Fantasy Ride, and the lead single for the album elsewhere. The single was co-written by and features Justin Timberlake with production coming from new production group The Y's. After receiving heavy airplay on US radio from February 20, 2009, it was made available for download in Australia, New Zealand, Canada and the US from March 17. It was released as a download in the UK and Europe on April 5, 2009.\n \n Ciara and Timberlake performed the song on Saturday Night Live and Ciara went on to perform the song alone on The Ellen DeGeneres Show and Jimmy Kimmel Live. She also performed it in London in The Circus: Starring Britney Spears tour, as apart of her opening act set. The &quot;Love Sex Magic&quot; video has been nominated for Best Choreography in a Video, by the 2009 MTV Video Music Awards.\n \n Since the single's release, it has become Ciara's biggest international hit to date, charting in the top ten in numerous countries worldwide, and peaking at number one in several countries including Taiwan, India, and Turkey.\n \n Billboard.com editor Chris Williams gives the single a favorable review, saying:\n \n     &quot;the pair definitely has chemistry, trading off heated vocals that add fire to an already spicy lyric: &quot;I ain't gonna stop you if you wanna crowd my neck/Talk sexy to me like that.&quot; It has a subtle retro funk groove generates enough sparks of its own to entice the pop crowd onto the dancefloor.&quot;\n \n Editor Lauren Carter from the Boston Herald writes that the song is &quot;not quite magic, but it grows on you.&quot; Ryan Brockington of New York Post's online website Popwrap says that the record sounds roughly like Justin Timberlake's single, &quot;Rock Your Body&quot;, from his debut album Justified.\n \n Bill Lamb of About.com felt that while the song &quot;doesn't have the lyrical potency of 'Like a Boy'&quot;, he gave the song a generally positive review, saying that &quot;fans of sparkling dance-pop are likely to smile&quot;. He also wrote that the &quot;vocal magnetism between Ciara and Justin&quot; is &quot;real&quot; and refreshing. Lamb also notes that it &quot;rides a beat that brings simultaneous echoes of 70's R&amp;B and classic Janet Jackson&quot;.\n \n Digital Spy gave the song a positive review: &quot;it's a squelchy electro-funk tune powered by a bassline that practically goads your pelvis into grinding. &quot;Imagine if there was a million me's talking sexy to you like that,&quot; Ciara purrs, and Timberlake, if you'll pardon the pun, more than rises to the occasion. All in all, 'Love Sex Magic' is pretty much spot on&quot;.\n \n The single officially impacted Top 40/Mainstream radio on March 3, 2009. The song debuted at number 86 on the Billboard Hot 100 but managed to jump to 27 in its second week. In the following week the song rose to number 10. This has been Ciara's biggest radio single since &quot;Oh&quot; featuring Ludacris, which reached number six on the Billboard Pop 100 chart in mid 2005.\n \n The song also reached the Top 10 on Canadian Hot 100, which is her first Top 10 in Canada since reaching number one there in 2004 with &quot;1, 2 Step&quot;. In Australia, the song debuted at #6, whilst in New Zealand &quot;Love Sex Magic&quot; debuted at number 14.\n \n On April 12, 2009 &quot;Love Sex Magic&quot; entered the UK Singles Chart at number six on downloads alone, before moving up to number five on its second week, becoming Ciara's highest charting single in the UK since &quot;Oh&quot; reached #4 in 2005. It has also reached #1 the UK R&amp;B Singles Chart.\n \n <a href=\"http://www.last.fm/music/Ciara\" class=\"bbcode_artist\">Ciara</a> first appeared in the UK charts in January 2005 with the No.1 smash '<a title=\"Ciara &ndash; Goodies\" href=\"http://www.last.fm/music/Ciara/_/Goodies\" class=\"bbcode_track\">Goodies</a>'. 'Love Sex Magic' was co-written by and features <a href=\"http://www.last.fm/music/Justin+Timberlake\" class=\"bbcode_artist\">Justin Timberlake</a> and hit the top 5 in April 2009. The racy video for the track was inspired by the Crazy Horse Cabaret Club in Paris.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Love Sex Magic&quot; is the second US single from Ciara's third studio album, Fantasy Ride, and the lead single for the album elsewhere. The single was co-written by and features Justin Timberlake with production coming from new production group The Y's. After receiving heavy airplay on US radio from February 20, 2009, it was made available for download in Australia, New Zealand, Canada and the US from March 17. It was released as a download in the UK and Europe on April 5, 2009.  ", "published": "Tue, 16 Apr 2013 16:50:40 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Love Sex Magic", "artist": {"url": "http://www.last.fm/music/Ciara", "mbid": "03172286-f7ed-4864-a4db-459cd5ca9790", "name": "Ciara"}, "url": "http://www.last.fm/music/Ciara/_/Love+Sex+Magic", "listeners": "61218", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/sexy", "name": "sexy"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "d68a0566-dcfd-4779-8c93-de7ce2bd6ae6", "duration": "220000", "playcount": "306234", "id": "280650285"}}