{"track": {"album": {"@attr": {"position": "1"}, "title": "Tangled Up", "url": "http://www.last.fm/music/Girls+Aloud/Tangled+Up", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/82848707.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/82848707.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/82848707.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/82848707.png", "size": "extralarge"}], "artist": "Girls Aloud", "mbid": "81dbdfbc-40e5-3948-8289-d49a6981f8a2"}, "wiki": {"content": "&quot;Call the Shots&quot; is a song performed by British all-female pop group Girls Aloud, taken from their fourth studio album Tangled Up (2007). The song was written by Miranda Cooper, Brian Higgins and his production team Xenomania, and produced by Higgins and Xenomania. Inspired by an article about the advance of women in business, &quot;Call the Shots&quot; showed a more mature side of Girls Aloud and proved to be commercially successful upon its release in November 2007. It charted at number three in the band's native United Kingdom, continuing Girls Aloud's five-year streak of top ten hits, and received a silver certification from the British Phonographic Industry.\n \n The music video was filmed in Los Angeles, California. &quot;Call the Shots&quot; was promoted through numerous live appearances, including a high-profile performance on The X Factor, and has since been performed on all of Girls Aloud's subsequent concert tours. The song, described as &quot;an elegant electro-pop ballad,&quot; received positive reviews from most contemporary music critics. Music journalist, Peter Robinson, who runs the successful Popjustice describes the song as the &quot;greatest pop song of the 21st century&quot;.\n \n Described as &quot;an elegant electro-pop ballad delivered with a restraint and maturity to rival groups of twice their age,&quot; the song juxtaposes guitar against an introduction and chorus heavy on synthesizer. The song is written in D major with a time signature in common time and a tempo of 126 beats per minute. The vocal range spans from B3 to B4. The chord progressions vary throughout the song, but include Bm, G♯m, G, Em, A, and D. The song follows verse-chorus form, which is rare for a Girls Aloud song to do.\n \n The song's lyricist, Miranda Cooper, said that &quot;Call the Shots&quot; was actually &quot;inspired by an article she read on something called (coincidentally) the Miranda Complex, named after the ambitious lawyer in Sex and the City, about how women are earning more than men and pushing ahead.&quot; The song's music was initially composed by Xenomania in 2005. The lyrics were written a year later during a songwriting session in Paris, France. &quot;Call the Shots&quot; was almost put forward as a single for Girls Aloud's 2006 greatest hits compilation The Sound of Girls Aloud, but the song was deemed &quot;too downbeat, when a greatest hits single needs to be a celebration.&quot; Cheryl Cole told the Daily Star that the song is her favourite from Tangled Up, and that it &quot;gives me goosebumps&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Call the Shots&quot; is a song performed by British all-female pop group Girls Aloud, taken from their fourth studio album Tangled Up (2007). The song was written by Miranda Cooper, Brian Higgins and his production team Xenomania, and produced by Higgins and Xenomania. Inspired by an article about the advance of women in business, &quot;Call the Shots&quot; showed a more mature side of Girls Aloud and proved to be commercially successful upon its release in November 2007.", "published": "Fri, 19 Oct 2012 00:54:12 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Call the Shots", "artist": {"url": "http://www.last.fm/music/Girls+Aloud", "mbid": "a0b2f210-cd3a-453d-937d-e4f2658d17c7", "name": "Girls Aloud"}, "url": "http://www.last.fm/music/Girls+Aloud/_/Call+the+Shots", "listeners": "92848", "comments": ["This song is PERFECT! <3", "AMO", "HINO", "Still their best song.", "Nicola is full of twilights and dreams that glitter <3 [3] the song gives me chills but her parts are so euphoric [2] really really this one of the best song from them, love this so much", "Almost 5 years, unbelievable :/", "I won't cry for all the hunger in my heart no", "Nicola is full of twilights and dreams that glitter <3 [2] the song gives me chills but her parts are so euphoric", "Great song...", "Forever the best. <3", "Memories :-) [3]", "Memories :-) [2]", "This song is magical. <3 [8]", "This song is magical. <3 [7]", "This song is magical. <3 [6]", "hino", "Please check out my cover of Call The Shots! www.youtube.com/watch?v=hZJs5B10W2I :)", "Memories :-)", "I love hearing this song when I shower lol", "Nicola is full of twilights and dreams that glitter <3"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/girls%20aloud", "name": "girls aloud"}]}, "mbid": "e3b03849-f16d-4b54-9c29-9a00db5ceb68", "duration": "224000", "playcount": "724514", "id": "122421348"}}