{"track": {"album": {"@attr": {"position": "5"}, "title": "The Best of Wham!: If You Were There...", "url": "http://www.last.fm/music/Wham!/The+Best+of+Wham!:+If+You+Were+There...", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/56274655.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/56274655.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/56274655.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/56274655.png", "size": "extralarge"}], "artist": "Wham!", "mbid": "4aa2ce27-6e92-4034-b2d4-e2feef16f33b"}, "wiki": {"content": "&quot;Wake Me Up Before You Go-Go&quot; is a song by English pop duo Wham! which was released in 1984 and became their first UK number one hit. It was written and produced by George Michael, one half of the duo.\n \n Michael's inspiration for the song was a scribbled note left by his Wham! partner Andrew Ridgeley for Andrew's parents, originally intended to read &quot;wake me up before you go&quot; but with &quot;up&quot; accidentally written twice, so Ridgeley wrote &quot;go&quot; twice on purpose. Released in May 1984, it heralded the beginning of a softer, sunnier image for Wham!, who had spent the previous year as a moodier, more politically themed duo, with songs about unemployment, young marriage, and battles of will between parents and their children. With the release of &quot;Wake Me Up Before You Go-Go&quot;, they re-emerged with wider smiles, more colourful clothing, and a more positive disposition in interviews.\n \n The song entered the UK singles chart at number four — after much hype from the duo claiming they would go straight in at number one, which was a rare occurrence then — and climbed to the top seven days later, staying there for three weeks.\n \n The song also went to the top of the Billboard Hot 100 in the USA and Michael followed it up with a solo single, &quot;Careless Whisper&quot; and another Wham! hit, &quot;Freedom&quot;, both of which were also UK number-one hits. The album, Make It Big, was an unqualified success. Wham! had three more UK number one singles and split at their height in 1986.\n \n Another band, Babs &amp; The Bopettes, sang phonetically by Tress MacNeille as Babs Bunny along with her friends, Gail Matthius as Shirley the Loon, Kath Soucie as Fifi Le Fume and Cree Summer as Mary Melody. The &quot;Jitterbug!&quot; part is by Charles Adler as Buster Bunny, Joe Alaskey as Plucky Duck and Don Messick as Hamton J. Pig. The chorus is when Babs Bunny lectures Gogo Dodo to wake Babs up before Gogo does. At the end, she laughs and says, &quot;Well c'mon, do you want me to see Buster, or not?&quot;.\n \n The music video, essentially the duo performing (it also introduced Ridgeley as a guitar player for the band) to a teenage audience, was memorable for the clothes, which became a lasting sartorial image for the 1980s as a decade. Michael and Ridgeley, plus backing singers Pepsi and Shirlie, along with motor trade Guru Peter (Froudy) Froud, were wearing Katharine Hamnett T-shirt designs which said &quot;CHOOSE LIFE&quot; (originally a slogan targeted at drug abuse and suicide) and &quot;GO GO&quot;, which became much sought-after fashion items of the year. Michael was also seen in luminous gloves, which he later bemoaned as the clip of him always picked out by advertisers whenever &quot;Wake Me Up Before You Go-Go&quot; went on to a compilation album. The video was filmed at the Carling Academy Brixton in London.\n \n     * In 2004, Japanese actor Yuji Oda made a cover of the song (&quot;Wake Me Up Go! Go!&quot;) as a companion to his cover of &quot;Last Christmas&quot;, both songs being the main soundtrack of the Japanese television drama he was starring in, Last Christmas.\n     * A cover of the song was recorded by Italian indie band Annie Hall.\n     * On Ant and Dec's Saturday Night Takeaway, Dec's team sung it as part of Ant Vs. Dec: The Teams. His team won as it was downloaded the most times, and subsequently it charted at No.64 on the UK Singles Chart.\n     * On the sixth series of The X Factor the six remaining finalists performed the song on the results show for the seventh live show, on 22 November 2009.\n \n # In the 1998 film The Wedding Singer starring Adam Sandler, the character of Robbie (played by Sandler) is awoken by his former fiance Linda (played by Angela Featherstone) singing &quot;Wake me up before you go-go/Don't leave me hangin' on like a solo...&quot; (having misheard or forgotten the correct lyrics).\n # The song is played during Natalie's introduction in the 2001 film Charlie's Angels.\n # In the film Zoolander, the song is played in the background during the gasoline fight scene which results in a number of fiery deaths. The song then replays at the end when Derek funds a learning institute with a statue dedicated to those who died in the gasoline fight.\n # It is sung by Luke Menard on season 7 of American Idol. It was the last song he sang before he was eliminated.\n # This song is performed by John C. Reilly in the film Talladega Nights.\n # On Saturday Night Live, Jimmy Fallon sang a parody of the song, dancing with clothes that are similar to the ones worn by the band in the music video.\n # Borat sings the song in a karaoke evening during the closing credits of an episode. He sings it mostly in gibberish, opening with &quot;Wake me up, such a no-no.&quot;\n # On The NRL Footy Show, an Australian Rugby League sports program, the character Reg Reagan (played by show host, Matthew Johns) made his own version of the &quot;Haka&quot;, a Maori war dance performed by the New Zealand Rugby League team before the match. It was made into a music video, with the music based on the song.\n # When the Pittsburgh Penguins defenseman Alex Goligoski scores a goal, many fans chant the chorus because of Goligoski's nickname, Go-Go.\n # In the Friends episode &quot;The One With All The Haste&quot; Chandler tells Ross, who has gotten an earring, &quot;Just remember to wake us up before you go-go.&quot;\n # Chris Griffin sings part of this song in the show Family Guy while visiting a tribe in another country (the tribe sings as well).\n \n     * The song was the demo song in the SA11 Casio Keyboard.\n     * The song is one of many featured in the game Wii Music.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Wake Me Up Before You Go-Go&quot; is a song by English pop duo Wham! which was released in 1984 and became their first UK number one hit. It was written and produced by George Michael, one half of the duo.  Michael's inspiration for the song was a scribbled note left by his Wham! partner Andrew Ridgeley for Andrew's parents, originally intended to read &quot;wake me up before you go&quot; but with &quot;up&quot; accidentally written twice, so Ridgeley wrote &quot;go&quot; twice on purpose.", "published": "Tue, 15 Dec 2009 17:15:17 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Wake Me Up Before You Go-Go", "artist": {"url": "http://www.last.fm/music/Wham!", "mbid": "d570bb31-b9ca-45a4-a2d9-11b186d9c159", "name": "Wham!"}, "url": "http://www.last.fm/music/Wham!/_/Wake+Me+Up+Before+You+Go-Go", "listeners": "232576", "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/british", "name": "british"}, {"url": "http://www.last.fm/tag/new%20wave", "name": "new wave"}]}, "mbid": "", "duration": "230000", "playcount": "820280", "id": "1227886"}}