{"track": {"album": {"@attr": {"position": "9"}, "title": "Ray of Light", "url": "http://www.last.fm/music/Madonna/Ray+of+Light", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/87971851.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/87971851.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87971851.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87971851.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "08dcbc7b-2cd6-3155-bd02-631124dfa493"}, "wiki": {"content": "&quot;Frozen&quot; is a pop song by American singer Madonna from her 1998 album Ray of Light, written and produced by Madonna, Patrick Leonard and William Orbit. The song was released as the first single in February 1998.\n \n &quot;Frozen&quot; was a radical change for Madonna. The darker electronic undertones, eastern strings arranged by Craig Armstrong, a touch of Middle Eastern percussion in the opening and her new vocal range were all previously unexplored territory for Madonna. However, the song was a huge success and is praised as being one of her best songs. Its success worldwide also marks it as one of Madonna's biggest hits ever. Madonna has said that the lyric is about &quot;an emotionally frozen girl.&quot; The song was mainly composed in F minor.\n \t\n &quot;Frozen&quot; also marked the beginning of a series of remixes which were done during the Ray of Light era. Madonna had been working with Victor Calderone since &quot;Secret&quot;, who went on to remix most of her follow-up singles. The remix done by the Stereo MCs was used by Madonna on her 2001 Drowned World Tour. Madonna also performed &quot;Frozen&quot; on her 2004 Re-Invention Tour, using a slightly edited version that is very similar to the original song, and on the 2009 leg of her Sticky &amp; Sweet Tour, where it sampled musical elements from Calvin Harris's song &quot;I'm Not Alone&quot; and lyrics from her own song &quot;Open Your Heart&quot;.\n \n In 2003, Madonna fans were asked to vote for their Top 20 Madonna singles of all-time by Q magazine. &quot;Frozen&quot; was allocated the #10 spot.\n \n On November 18, 2005, a Belgian judge seated in Mons ruled that the opening four-bar theme to &quot;Frozen&quot; was plagiarized from the song &quot;Ma vie fout le camp&quot;, composed by Salvatore Acquaviva of Mouscron. The judge subsequently ordered the withdrawal from sales of all remaining discs, and forbade any further playing of the song on Belgian TV and radio under wide protest of the Belgian population. &quot;Frozen&quot; was a chart topper in Belgium and widely popular. Many radio stations, TV stations and their audiences stated that &quot;Frozen&quot; was loved, while the supposedly plagiarized song was unknown and disliked. The judge also ordered Warner, EMI and Sony to publish and spread the decision within fifteen days to various media outlets on pain of a penalty of €125,000 for non-compliance with the court order. No damages were granted.\n \n The Belgian radio station Donna held a Top 5000 music chart program from 17 November to 12 December 2008. The song &quot;Frozen&quot; reached place 143, but because of the legal status of the song it could not be played. The radio hosts asked their listeners to watch the music video on YouTube, while there was approximately 5 minutes of radio silence. The song is omitted from the tracklisting on the Belgian pressings of Celebration.\n \n &quot;Frozen&quot; was a huge success worldwide. It topped the charts in a few countries, including the United Kingdom, Italy and Finland, but it peaked at #2 in mostly the rest of the world, being held off from the top position in the majority of them by Céline Dion's &quot;My Heart Will Go On&quot;. It peaked at #2 in the United States, being held off the top spot by K-Ci and JoJo's &quot;All My Life&quot;.\n \n In the UK, despite sporadically high sales of singles such as &quot;You'll See&quot; (a #5 hit in 1995) and &quot;Don't Cry for Me Argentina&quot; (a #3 success), &quot;Frozen&quot; was seen as the &quot;big comeback&quot; for Madonna, and became her first ever single to debut at number-one, selling 508,296 copies. It was Madonna's first UK chart-topper since &quot;Vogue&quot; in 1990. &quot;Frozen&quot; spent eleven weeks at #2 in the European Singles Chart.\n \n Madonna traveled to the Indian Wells Valley of the Mojave Desert in California to shoot the music video for &quot;Frozen&quot; from January 7-10, 1998. It was directed by Chris Cunningham, and was inspired by the movies The English Patient and The Sheltering Sky. The video won an MTV Video Music Award for &quot;Best Special Effects&quot; in 1998. The cinematography was done by Darius Khondji, who also shot Madonna's 1993 music video &quot;Fever&quot;, and the 1996 film Evita. The video shows Madonna playing an ethereal witchy persona, with long black hair, black gowns designed by Olivier Theyskens, at that time a young and emerging talent, and mehndi on her hand showing the Hindu word Om on her palm.\n \n The video premiered on February 12, 1998 in Europe and on MTV four days later. There were also two remix videos of &quot;Frozen&quot; released that same year by Dan-O-Rama titled &quot;Stereo MC's Mix&quot; and &quot;Calderone Club Mix&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Frozen&quot; is a pop song by American singer Madonna from her 1998 album Ray of Light, written and produced by Madonna, Patrick Leonard and William Orbit. The song was released as the first single in February 1998.  &quot;Frozen&quot; was a radical change for Madonna. The darker electronic undertones, eastern strings arranged by Craig Armstrong, a touch of Middle Eastern percussion in the opening and her new vocal range were all previously unexplored territory for Madonna. However, the song was a huge success and is praised as being one of her best songs.", "published": "Fri, 13 Aug 2010 14:14:22 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Frozen", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Frozen", "listeners": "370254", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "e99b5094-30dd-4ced-91eb-d59c8ed83027", "duration": "372000", "playcount": "2112009", "id": "12806"}}