{"track": {"album": {"@attr": {"position": "1"}, "title": "Like a Virgin", "url": "http://www.last.fm/music/Madonna/Like+a+Virgin", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78189774.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78189774.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78189774.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78189774.png", "size": "extralarge"}], "artist": "Madonna", "mbid": "cb22ba29-240d-4e53-9727-126fa41f2acd"}, "wiki": {"content": "&quot;Material Girl&quot; is the second single by singer-songwriter Madonna from her second studio album, Like a Virgin, and was released on January 30, 1985, by Sire Records. It also appears slightly remixed on the 1990 greatest hits compilation The Immaculate Collection and in its original form on the 2009 greatest hits compilation Celebration.&quot;\n \n The bassline in the song is reminiscent of The Jacksons' &quot;Can You Feel It&quot;, which appeared on their 1980 album Triumph, which is in itself highly reminiscent of &quot;White Rabbit&quot;, the 1960s song by Jefferson Airplane. Furthermore, the strophes remind of the refrain from Melissa Manchester's hit &quot;You Should Hear How She Talks About You&quot; (1982).\n \n Madonna has often remarked that it is the song she most regrets recording as it became a label that has been attached to her for decades. She has also said if she had known this, she probably would have never recorded it. She ended The Virgin Tour with a self-parodying performance of &quot;Material Girl&quot;.\n \n &quot;Material Girl&quot; is included on Madonna's greatest hits compilation albums The Immaculate Collection (1990) and Celebration (2009). In 2003, Madonna fans were asked to vote for their Top 20 Madonna singles of all time by Q magazine. &quot;Material Girl&quot; was allocated the No. 15 spot.\n \n Madonna adopted the Kabbalah faith in 1998 which rejects notions of materialism as a form of happiness. As a result, Madonna rarely performs the song live as it represents and promotes ideas she personally rejects. The song is set to 120 BPM in the key of C Mixolydian.\n \n In the single's music video, scenes of Madonna mimicking Marilyn Monroe's performance of &quot;Diamonds Are a Girl's Best Friend&quot; from the 1953 film Gentlemen Prefer Blondes were interspersed with scenes of a Hollywood director trying to win the heart of an actress, played by Madonna herself. Discovering that, contrary to her song, the young woman was not impressed by money and expensive gifts, he pretended to be penniless, bringing her hand-cut flowers and paying a poor man a large amount to borrow (or possibly buy) his dirty truck to take her on a date. His plan seemed to work because the final scene is of him and Madonna kissing in the truck in an intimate position. The video was ranked No. 54 on VH1's 100 Greatest Videos. After making the video, Madonna said she never wanted to be compared to Monroe despite posing as the Hollywood icon and recreating many of Marilyn's signature poses for various photos shoots, most notably a 1991 issue of Vanity Fair.\n \n The music video was shot January 10 and 11, 1985, at Ren-Mar Studios in Hollywood, California, and was directed by Mary Lambert. Robert Wuhl appeared in the video's opening. Actor Keith Carradine also had a role in the video. Madonna met her first husband, Sean Penn, while shooting it.\n \n &quot;Material Girl&quot; was nominated for best female video at the 1985 MTV Video Music Awards but lost to Tina Turner's &quot;What's Love Got to Do with It&quot;\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Material Girl&quot; is the second single by singer-songwriter Madonna from her second studio album, Like a Virgin, and was released on January 30, 1985, by Sire Records. It also appears slightly remixed on the 1990 greatest hits compilation The Immaculate Collection and in its original form on the 2009 greatest hits compilation Celebration.&quot;  The bassline in the song is reminiscent of The Jacksons' &quot;Can You Feel It&quot;, which appeared on their 1980 album Triumph, which is in itself highly reminiscent of &quot;White Rabbit&quot;, the 1960s song by Jefferson Airplane.", "published": "Fri, 11 Dec 2009 23:24:16 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Material Girl", "artist": {"url": "http://www.last.fm/music/Madonna", "mbid": "79239441-bfd5-4981-a70c-55c3f15c1287", "name": "Madonna"}, "url": "http://www.last.fm/music/Madonna/_/Material+Girl", "listeners": "335600", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/madonna", "name": "madonna"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}]}, "mbid": "faf777a4-ee0e-4143-8e66-849afa1d4dd2", "duration": "231000", "playcount": "1453039", "id": "1065977"}}