{"track": {"album": {"@attr": {"position": "2"}, "title": "Stripped", "url": "http://www.last.fm/music/Christina+Aguilera/Stripped", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/78821487.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/78821487.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/78821487.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/78821487.png", "size": "extralarge"}], "artist": "Christina Aguilera", "mbid": "b693d621-dae2-3748-86b4-083e7448ef7d"}, "wiki": {"content": "&quot;Can't Hold Us Down&quot; is the fourth single from Christina Aguilera's second album, Stripped. Released in 2003, the single (which features Lil' Kim) peaked at #12 on the Billboard Hot 100, becoming Aguilera's 10th Top 20 hit. The single also peaked at #2 in New Zealand, #6 in the UK and #5 in Australia. The single is most known for its theme of female empowerment and for its music video, directed by David LaChapelle. The single was nominated for a Grammy Award in 2004 for Best Pop Collaboration with Vocals. Oddly enough, the song has been left off the tracklisting for Christina's greatest hits album Keeps Gettin' Better — A Decade of Hits, despite placing higher than both &quot;Dirrty&quot; and &quot;Fighter&quot;, which are both included, on the US Hot 100.\n \n Song information\n \n &quot;Can't Hold Us Down&quot; was penned by Aguilera, Matt Morris and Scott Storch, and was also produced by Storch, E. Dawk, and Aguilera. As mentioned above, the single features the rapper Lil' Kim, who had previously worked with her on the &quot;Lady Marmalade&quot; cover from the Moulin Rouge! soundtrack in 2001. Besides becoming casual friends from &quot;Lady Marmalade&quot;, Christina reached out to Kim due to her &quot;girl power&quot; attitude.\n \n It should be noted that, originally, Eve was booked to be the guest rapper on this song. The rapper-actress even commented about it on MTV news saying that she had collaborated with Aguilera on a female powered anthem for her upcoming album. However, as the release date of the album approached, Kim was revealed to be the actual guest on the record without any explanation of what happened to Eve. Many speculate that Kim might have forced her away upon the record because at the time she was dating Scott Storch and might have had a slight rivalry against Eve, and therefore asked Storch to replace Eve with herself on the record.\n \n Once again like with many previous singles, Aguilera creates a female empowerment anthem, expressing her disgust with the double standards of society. She feels that male stars are respected and worshipped for bragging about their wild sex lives, but when women like Aguilera try to express their sexuality, they get labeled as whores. Aguilera also lets people know that she does not appreciate being called a bitch simply because she stands up for herself and is a strong woman. Aguilera sends her personal message to those who try to &quot;hold her down&quot;.\n \n Music video\n \n Directed by David LaChapelle, the video was shot on a Los Angeles soundstage that depicts a 1980s Lower East Side neighborhood in Manhattan, New York City. In the video, Aguilera is seen walking into the street when a man grabs her buttocks. She starts accusing him and singing the song while many other women join her and many neighborhood men join the man. It continues until Lil' Kim arrives and takes off her robe. They begin dancing and Aguilera leaves with a smile on her face. The video premiered on BET's 106 &amp; Park on August 22, 2003, as the &quot;New Joint&quot; of the day.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Can't Hold Us Down&quot; is the fourth single from Christina Aguilera's second album, Stripped. Released in 2003, the single (which features Lil' Kim) peaked at #12 on the Billboard Hot 100, becoming Aguilera's 10th Top 20 hit. The single also peaked at #2 in New Zealand, #6 in the UK and #5 in Australia. The single is most known for its theme of female empowerment and for its music video, directed by David LaChapelle.", "published": "Wed, 29 Apr 2009 15:49:01 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Can't Hold Us Down", "artist": {"url": "http://www.last.fm/music/Christina+Aguilera", "mbid": "b202beb7-99bd-47e7-8b72-195c8d72ebdd", "name": "Christina Aguilera"}, "url": "http://www.last.fm/music/Christina+Aguilera/_/Can%27t+Hold+Us+Down", "listeners": "133610", "toptags": {"tag": [{"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/christina%20aguilera", "name": "christina aguilera"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "", "duration": "223000", "playcount": "735590", "id": "1669789"}}