{"track": {"album": {"@attr": {"position": "1"}, "title": "Greatest Hits", "url": "http://www.last.fm/music/Eurythmics/Greatest+Hits", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88200451.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88200451.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88200451.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88200451.png", "size": "extralarge"}], "artist": "Eurythmics", "mbid": "f001ec02-da73-4251-a6e1-f0225129149c"}, "wiki": {"content": "The soulful sound of Annie Lennox made this track a powerful edge of what could have been &quot;just a good tune&quot;.  The background vocals with the richness of the rythmic strings and the echo from the light angelic sound of the tender soprano blending with the lower slightly darker vocals that is Annie Lennox gifted forte, melts  into a rhythmic almost heartbeat feel that  builds to a full synchronized sound reaching from a cool mountain top down to a lush warm valley of pure rocking soul.  This is a track that gets in your head and  you just can't savor it once, but over and over again.  If you haven't ever listened to Annie Lennox or the Eurhymics before, this is the song that will hook you, reel you in, and leave you begging for more.  This song must be followed up by listening to the Annie Lennox other masterpiece,  &quot;Why&quot; , and then you will be well feasted on some of the best music ever to come out of the studio by truely gifted artists.  You will be a fan. Take a taste of  &quot;Sweet Dreams&quot;  and your appetite will be wet for more!! Bon appetit!  : )\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The soulful sound of Annie Lennox made this track a powerful edge of what could have been &quot;just a good tune&quot;.  The background vocals with the richness of the rythmic strings and the echo from the light angelic sound of the tender soprano blending with the lower slightly darker vocals that is Annie Lennox gifted forte, melts  into a rhythmic almost heartbeat feel that  builds to a full synchronized sound reaching from a cool mountain top down to a lush warm valley of pure rocking soul.  This is a track that gets in your head and  you just can't savor it once, but over and over again.", "published": "Sat, 18 Aug 2012 04:19:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Sweet Dreams (Are Made of This)", "artist": {"url": "http://www.last.fm/music/Eurythmics", "mbid": "b4d32cff-f19e-455f-86c4-f347d824ca61", "name": "Eurythmics"}, "url": "http://www.last.fm/music/Eurythmics/_/Sweet+Dreams+(Are+Made+of+This)", "listeners": "645110", "toptags": {"tag": [{"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/new%20wave", "name": "new wave"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/synth%20pop", "name": "synth pop"}]}, "mbid": "fec78869-bf9d-41a5-b9c0-9d5c71b51e52", "duration": "212000", "playcount": "2963151", "id": "1005568"}}