{"album": {"wiki": {"content": "<strong><em>Superunknown</em></strong> is the fourth album by the American grunge band <a href=\"http://www.last.fm/music/Soundgarden\" class=\"bbcode_artist\">Soundgarden</a>. It was released on March 8, 1994 through A&amp;M Records. The band began work on the album after touring in support of its previous album, <a title=\"Soundgarden - Badmotorfinger\" href=\"http://www.last.fm/music/Soundgarden/Badmotorfinger\" class=\"bbcode_album\">Badmotorfinger</a> (1991). The resulting album captured the creativity and heaviness of the band's earlier releases while displaying a more diverse range of influences.\n \n The album was a critical and commercial success and became the band's breakout album. It peaked at number one on the Billboard 200 and reached high positions on charts worldwide. Five singles were released from the album: <a title=\"Soundgarden &ndash; The Day I Tried to Live\" href=\"http://www.last.fm/music/Soundgarden/_/The+Day+I+Tried+to+Live\" class=\"bbcode_track\">The Day I Tried to Live</a>, <a title=\"Soundgarden &ndash; My Wave\" href=\"http://www.last.fm/music/Soundgarden/_/My+Wave\" class=\"bbcode_track\">My Wave</a>, <a title=\"Soundgarden &ndash; Fell on Black Days\" href=\"http://www.last.fm/music/Soundgarden/_/Fell+on+Black+Days\" class=\"bbcode_track\">Fell on Black Days</a> and the Grammy Award-winning songs <a title=\"Soundgarden &ndash; Black Hole Sun\" href=\"http://www.last.fm/music/Soundgarden/_/Black+Hole+Sun\" class=\"bbcode_track\">Black Hole Sun</a> and <a title=\"Soundgarden &ndash; Spoonman\" href=\"http://www.last.fm/music/Soundgarden/_/Spoonman\" class=\"bbcode_track\">Spoonman</a>, the latter two of which helped Soundgarden reach mainstream popularity. In 1995, the album was nominated for a Grammy for Best Rock Album. The album has been certified five times Platinum in the United States.\n \n The album's recording sessions took place from July 1993 to September 1993 at Bad Animals Studio in Seattle, Washington. The band worked with producer Michael Beinhorn. Regarding the change in producer from previous collaborator Terry Date to Beinhorn, guitarist Kim Thayil said, &quot;We just thought we'd go for a change.&quot; The album was mixed by Brendan O'Brien.\n Soundgarden began work on the album about two months after finishing its stint on the 1992 Lollapalooza tour. The individual band members would work on material on their own and then bring in demos to which the other members of the band would contribute. Frontman Chris Cornell said that the band members allowed each other more freedom than on past records. Thayil observed that even though the band spent as much time writing and arranging as it had on previous albums, it spent a lot more time working on recording the songs. Soundgarden took the approach of recording one song at a time. The drum and bass parts were recorded first for each song, and then Cornell and Thayil would lay down their parts over top.\n Cornell said that getting to know Beinhorn contributed to the length of time Soundgarden spent working on the album. The band spent time experimenting with different drum and guitar sounds, as well as utilizing techniques such as layering, resulting in an expansive production sound. Cornell said, &quot;Michael Beinhorn was so into sounds. He was so, almost, anal about it, that it took the piss out of us a lot of the time...By the time you get the sounds that you want to record the song, you're sick and tired of playing it.&quot;Soundgarden took a break in the middle of recording to open for Neil Young on a ten-day tour of the United States. The band then brought in Brendan O'Brien to mix the album; O'Brien had come recommended by Pearl Jam guitarist Stone Gossard. Thayil called the mixing process &quot;very painless,&quot; and bassist Ben Shepherd said it was &quot;the fastest part of the record.&quot;\n \n The songs on Superunknown captured the creativity and heaviness of the band's earlier works, while showcasing the group's newly evolving style. Steve Huey of Allmusic said that the band's &quot;earlier punk influences are rarely detectable, replaced by surprisingly effective appropriations of pop and psychedelia.&quot; Cornell labeled the album as more &quot;challenging&quot; and &quot;versatile&quot; than the band's previous releases. The songs on the album are more experimental and diverse than the band's previous recordings, with some songs having a Middle-Eastern or Indian flavor (for example &quot;Half&quot;, sung by Shepherd). Some songs also show a Beatles influence, such as &quot;Head Down&quot; and &quot;Black Hole Sun&quot;. In a 1994 interview with Guitar World, Thayil explained, &quot;We looked deep down inside the very core of our souls and there was a little Ringo sitting there. Oh sure, we like telling people it's John Lennon or George Harrison; but when you really look deep inside of Soundgarden, there's a little Ringo wanting to get out.&quot; Drummer Matt Cameron said that the experimentation on the album was &quot;just a matter of refinement.&quot;\n Soundgarden utilized alternative tunings and odd time signatures on several of the album's songs. &quot;Spoonman&quot;, &quot;Black Hole Sun&quot; and &quot;Let Me Drown&quot; were performed in drop D tuning while &quot;Mailman&quot; and &quot;Limo Wreck&quot; employed CGDGBE tuning. Some songs used more unorthodox tunings: &quot;My Wave&quot; and &quot;The Day I Tried to Live&quot; are both in a E-E-B-B-B-B tuning. &quot;Head Down&quot; used CGCGGC tuning and &quot;Like Suicide&quot; is performed in CBGDGD tuning. Soundgarden's use of odd time signatures was varied as well; &quot;My Wave&quot; uses 5/4, &quot;Fell On Black Days&quot; is in 6/4, &quot;Limo Wreck&quot; is played in 15/8, &quot;The Day I Tried To Live&quot; and &quot;Spoonman&quot; both alternate between 7/4 and 4/4 sections, and &quot;Black Hole Sun&quot; is in 4/4 and 9/8. Thayil has said that Soundgarden usually did not consider the time signature of a song until after the band had written it, and said that the use of odd meters was &quot;a total accident.&quot;\n Lyrically, the album is quite dark and mysterious, as much of it is often interpreted to be dealing with issues such as substance abuse, suicide, and depression. Cornell was inspired by the writings of Sylvia Plath at the time. Commenting on the album's lyrics, Thayil said that &quot;a lot of Superunknown seems to me to be about life, not death. Maybe not affirming it, but rejoicing—like the Druids [put it]: 'Life is good, but death's gonna be even better!&quot; Cameron said that the lyrics on the album are &quot;a big fuck-you to the world, a plea to 'leave us alone.'&quot; Cornell stated that &quot;Let Me Drown&quot; is about &quot;crawling back to the womb to die,&quot; &quot;Fell on Black Days&quot; is about realizing &quot;you're unhappy in the extreme,&quot; &quot;Black Hole Sun&quot; is about a &quot;surreal dreamscape,&quot;  &quot;Limo Wreck&quot; is a &quot;'shame-on-decadence' song,&quot;  &quot;The Day I Tried to Live&quot; is about &quot;trying to step out of being patterned and closed off and reclusive,&quot;  and &quot;4th of July&quot; is about using LSD. Cornell talked about &quot;Mailman&quot; at a concert saying, &quot;This next one is about killing your boss. It's about coming to work early one morning cause you have a special agenda and you're going to shoot him in the fucking head.&quot;  Conversely, &quot;Like Suicide&quot; was literal, written by Cornell after a bird flew into a window of his house. He found the severely injured animal and killed it, hitting it with a brick to end its suffering.\n The song &quot;Spoonman&quot; is notable for featuring a performance by Artis the Spoonman, a street entertainer in Seattle. The title of the song is credited to bassist Jeff Ament of Pearl Jam. While on the set of the movie Singles, Ament produced a list of song titles for the fictional band featured in the movie. Cornell took it as a challenge to write songs for the film using those titles, and &quot;Spoonman&quot; was one of them. An acoustic demo version of the song appears in the movie. Cornell said that the song is about &quot;the paradox of who [Artis] is and what people perceive him as.&quot;\n \n Superunknown was the band's breakout album. Upon its release in March 1994, Superunknown debuted at number one on the Billboard 200 album chart. The album granted Soundgarden international recognition. Superunknown has been certified five times platinum by the RIAA in the United States,three times platinum in Canada, and gold in the United Kingdom, Sweden, and the Netherlands. Superunknown spawned the EP Songs from the Superunknown and the CD-ROM Alive in the Superunknown, both released in 1995.\n As well as being a commercial success, Superunknown was also a critical success. Allmusic staff writer Steve Huey gave the album five out of five stars, saying, &quot;It's obvious that Superunknown was consciously styled as a masterwork, and it fulfills every ambition.&quot; Q gave the album five out of five stars. The review said, &quot;Soundgarden dealt in unreconstructed heavy rock: a heavy guitar sound, depth-charge drumming....Yet Superunknown also includes more measured moments, such as the shimmering hit single 'Black Hole Sun'.&quot; Rolling Stone staff writer J.D. Considine gave Superunknown four out of five stars, saying Superunknown &quot;demonstrates far greater range than many bands manage in an entire career.&quot; He also stated, &quot;At its best, Superunknown offers a more harrowing depiction of alienation and despair than anything on In Utero.&quot; Considine criticized &quot;Black Hole Sun&quot; and &quot;Half&quot;, stating that the former is &quot;not a very good song&quot; while the latter &quot;is the virtual definition of a B-side.&quot; Jon Pareles of The New York Times said that &quot;Superunknown actually tries to broaden its audience by breaking heavy-metal genre barriers that Soundgarden used to accept.&quot; He added that &quot;Soundgarden...want<del> something different from standard heavy metal.&quot;\n David Browne of Entertainment Weekly gave the album an A. He said, &quot;Soundgarden is pumped and primed on Superunknown, and they deliver the goods.&quot; He praised it as a &quot;hard-rock milestone-a boiling vat of volcanic power, record-making smarts, and '90s anomie and anxiety that sets a new standard for anything called metal.&quot; Critic Robert Christgau gave the album an A-, saying that, although he had &quot;mocked&quot; Soundgarden's &quot;conceptual pretentions for years,&quot; the album &quot;is easily the best—most galvanizing, kinetic, sensational, catchy—Zep rip in history.&quot; Ann Powers of Blender said that on the album &quot;guitarist Thayil helps create the stoner-rock template,&quot; and that it &quot;stands as Soundgarden’s masterpiece.&quot;\n Superunknown included the hit singles &quot;Spoonman&quot;, &quot;The Day I Tried to Live&quot;, &quot;Black Hole Sun&quot;, &quot;My Wave&quot;, and &quot;Fell on Black Days&quot;, all of which had accompanying music videos. All five singles placed on the Mainstream Rock and Modern Rock charts. &quot;Black Hole Sun&quot; was the most successful song from Superunknown on the rock charts, spending a total of seven weeks at number one on the Mainstream Rock charts and reaching number two on the Modern Rock charts. &quot;Black Hole Sun&quot; was released in the summer of 1994 and became arguably the band's most recognizable and popular song. Its surreal music video received heavy airplay on music television. The video received the award for Best Metal/Hard Rock Video at the 1994 MTV Video Music Awards and in 1995 it received the Clio Award for Alternative Music Video. At the 1995 Grammy Awards, Soundgarden won two awards; &quot;Black Hole Sun&quot; received the award for Best Hard Rock Performance and &quot;Spoonman&quot; received the award for Best Metal Performance. &quot;Black Hole Sun&quot; also received a nomination for Best Rock Song.\n At the 1995 Grammy Awards, Superunknown received a nomination for Best Rock Album. In 2003, the album was ranked number 336 on Rolling Stone magazine's list of the 500 greatest albums of all time. In November 2011, it was ranked number five on Guitar World magazine's top ten list of guitar albums of 1994.\n \n The album's cover art (known as the 'Screaming Elf') is a distorted photograph of the band members, photographed by Kevin Westenberg, above a black and white upside-down burning forest. Concerning the artwork, Cornell said, &quot;Superunknown relates to birth in a way...Being born or even dying—getting flushed into something that you know nothing about. The hardest thing is to nail down a visual image to put on a title like that. The first thing we thought of was a forest in grey or black. Soundgarden has always been associated with images of flowers and lush colors and this was the opposite. It still seemed organic but it was very dark and cold...I was into those stories as a kid where forests were full of evil and scary things as opposed to being happy gardens that you go camping in.&quot; In a 1994 Pulse! magazine interview, Cornell said that the inspiration for the album's title came from his misreading of a video entitled Superclown. He added, &quot;I thought it was a cool title. I'd never heard it before, never saw it before, and it inspired me.&quot; The album also saw a limited release on 12&quot; colored vinyl (blue, orange, and clear), as a double-LP in a gatefold sleeve.\n \n The band began touring in January 1994 in Oceania and Japan, areas where the record came out early. The band had never toured these regions before. This round of touring ended in February 1994, and then in March 1994 the band moved on to Europe. The band began a theater tour in the United States on May 27, 1994. The opening acts were Tad and Eleven. In late 1994, after touring in support of Superunknown, doctors discovered that Cornell had severely strained his vocal cords. Soundgarden cancelled several shows to avoid causing any permanent damage. Cornell said, &quot;I think we kinda overdid it! We were playing five or six nights a week and my voice pretty much took a beating. Towards the end of the American tour I felt like I could still kinda sing, but I wasn't really giving the band a fair shake. You don't buy a ticket to see some guy croak for two hours! That seemed like kind of a rip off.&quot; The band would make up the dates later in 1995.\n \n The album's singles featured three B-sides from the Superunknown recording sessions that weren't included on the album, &quot;Exit Stonehenge&quot;, &quot;Kyle Petty, Son of Richard&quot;, and &quot;Motorcycle Loop&quot;. &quot;Exit Stonehenge&quot; was a B-side on the &quot;Spoonman&quot; single and &quot;Kyle Petty, Son of Richard&quot; and &quot;Motorcycle Loop&quot; were featured on various versions of the &quot;Fell on Black Days&quot; single. &quot;Kyle Petty, Son of Richard&quot; was later featured on the 1996 Home Alive compilation. &quot;Tighter &amp; Tighter&quot;, &quot;No Attention&quot;, and &quot;An Unkind&quot;, all of which later appeared on the band's 1996 album, Down on the Upside, were attempted during the Superunknown recording sessions. Cameron said that the band wasn't pleased with the recording of &quot;No Attention&quot; that came out of the sessions. The song &quot;Flutter Girl&quot; was written during the recording sessions but did not appear on the record. Instead, it eventually appeared as a much different version on Cornell's 1999 solo album, Euphoria Morning.</del>\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Superunknown is the fourth album by the American grunge band <a href=\"http://www.last.fm/music/Soundgarden\" class=\"bbcode_artist\">Soundgarden</a>. It was released on March 8, 1994 through A&amp;M Records. The band began work on the album after touring in support of its previous album, <a title=\"Soundgarden - Badmotorfinger\" href=\"http://www.last.fm/music/Soundgarden/Badmotorfinger\" class=\"bbcode_album\">Badmotorfinger</a> (1991). The resulting album captured the creativity and heaviness of the band's earlier releases while displaying a more diverse range of influences.  The album was a critical and commercial success and became the band's breakout album. It peaked at number one on the Billboard 200 and reached high positions on charts worldwide.", "published": "Sat, 17 Dec 2011 23:01:29 +0000"}, "name": "Superunknown", "artist": "Soundgarden", "url": "http://www.last.fm/music/Soundgarden/Superunknown", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/92963769.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/92963769.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92963769.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92963769.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/92963769/Superunknown+Soundgarden+++High.png", "size": "mega"}], "listeners": "1070302", "toptags": {"tag": [{"url": "http://www.last.fm/tag/grunge", "name": "grunge"}, {"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/favorite%20albums", "name": "favorite albums"}]}, "releasedate": "    27 Dec 1999, 00:00", "mbid": "53e70778-6771-4674-8933-9438b4528dd8", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Let Me Drown", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Let+Me+Drown", "mbid": "", "duration": "232"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "My Wave", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/My+Wave", "mbid": "", "duration": "313"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "Fell on Black Days", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Fell+on+Black+Days", "mbid": "36d78179-5d73-46f8-8e32-0ce9e84e1104", "duration": "328"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Mailman", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Mailman", "mbid": "0c2f8983-82fd-4d99-8fed-4e2c452e0285", "duration": "266"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Superunknown", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Superunknown", "mbid": "5f771fa1-549a-4f15-b094-60750d73e9e8", "duration": "313"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Head Down", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Head+Down", "mbid": "64a3b6bc-c650-4d91-9ea4-249d293d0e6d", "duration": "369"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Black Hole Sun", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Black+Hole+Sun", "mbid": "191968ed-2178-4051-a260-d5a20c27024f", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Spoonman", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Spoonman", "mbid": "8a8b9b13-662e-4767-b472-d3804b38cba8", "duration": "246"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Limo Wreck", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Limo+Wreck", "mbid": "052f0e33-984c-43a0-bd6e-b686632c49e8", "duration": "348"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "The Day I Tried to Live", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/The+Day+I+Tried+to+Live", "mbid": "ec3a466a-7a40-461e-b1f6-206c69f1fe76", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "Kickstand", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Kickstand", "mbid": "fd3c1224-5a1e-42ef-9515-3b87a5beb4a9", "duration": "94"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "Fresh Tendrils", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Fresh+Tendrils", "mbid": "1ba6010b-bb32-41a5-90e5-7d6df5870647", "duration": "256"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "4th of July", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/4th+of+July", "mbid": "7bf006ea-dabb-4899-8642-13c0f93d46c9", "duration": "309"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "Half", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Half", "mbid": "20fe8c4f-1b08-4c66-8d2d-65f7644e4f3c", "duration": "134"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "15"}, "name": "Like Suicide", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/Like+Suicide", "mbid": "0e070813-83fd-4799-8b2e-063eb2d160e7", "duration": "422"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "16"}, "name": "She Likes Surprises", "artist": {"url": "http://www.last.fm/music/Soundgarden", "mbid": "153c9281-268f-4cf3-8938-f5a4593e5df4", "name": "Soundgarden"}, "url": "http://www.last.fm/music/Soundgarden/_/She+Likes+Surprises", "mbid": "4a7d45df-b42a-432c-a382-0aa7143f6887", "duration": "198"}]}, "playcount": "11954376", "id": "1756"}}