{"album": {"wiki": {"content": "Led Zeppelin is the debut album of English rock  band Led Zeppelin. It was recorded in October 1968 at Olympic Studios in London and released on Atlantic Records on 12 January 1969. The album featured integral contributions from each of the group's four musicians and established Led Zeppelin's fusion of blues and rock. Led Zeppelin also created a large and devoted following for the band, with their unique heavy metal sound endearing them to a section of the counterculture on both sides of the Atlantic.\n \n Although the album initially received negative reviews, it was commercially very successful and has now come to be regarded in a much more positive light by critics. In 2003, the album was ranked number 29 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n \n In August 1968, the English rock band The Yardbirds had completely disbanded. Guitarist Jimmy Page, The Yardbirds' sole remaining member, was left with rights to the group’s name and contractual obligations for a series of concerts in Scandinavia. For his new band, Page recruited bassist John Paul Jones, vocalist Robert Plant and drummer John Bonham. During September 1968, the group toured Scandinavia as The New Yardbirds, performing some old Yardbirds material as well as new songs such as &quot;Communication Breakdown&quot;, &quot;I Can't Quit You Baby&quot;, &quot;You Shook Me&quot;, &quot;Babe I'm Gonna Leave You&quot; and &quot;How Many More Times&quot;. The month after they returned to England, October 1968, Page changed the band's name to Led Zeppelin, and the group entered Olympic Studios in London to record their debut album.\n \n In a 1990 interview, Page said that the album took only about 36 hours of studio time (over a span of a few weeks) to create (including mixing), adding that he knows this because of the amount charged on the studio bill. One of the primary reasons for the short recording time was that the material selected for the album had been well-rehearsed and pre-arranged by the band on Led Zeppelin's tour of Scandinavia in September 1968.  As Page explained, &quot;the band had begun developing the arrangements on the Scandinavian tour and I knew what sound I was looking for. It just came together incredibly quickly.&quot;\n \n In addition, since the band had not yet signed their deal with Atlantic Records, Page and Led Zeppelin's manager Peter Grant paid for the sessions entirely themselves, meaning there was no record company money to waste on excessive studio time. In another interview, Page revealed that the self-funding was to ensure artistic freedom, &quot;I wanted artistic control in a vice grip, because I knew exactly what I wanted to do with these fellows. In fact, I financed and completely recorded the first album before going to Atlantic. ... It wasn't your typical story where you get an advance to make an album—we arrived at Atlantic with tapes in hand ... Atlantic's reaction was very positive—I mean they signed us, didn't they?&quot;\n \n The group recorded their songs reportedly for £1,782. Led Zeppelin expert Dave Lewis noted that &quot;with the possible exception of the 12 hours that the Beatles took to record their first album at Abbey Road, rarely has studio time been used so economically. Led Zeppelin's debut album went on to gross more than £3.5 million, just short of 2,000 times more than they invested!&quot;\n \n For the recordings, Page played a psychedelically painted Fender Telecaster, a gift from Jeff Beck after Page recommended his boyhood friend to the Yardbirds in 1965 as potential replacement for Eric Clapton on lead guitar. This was a different guitar from those he favoured for later albums (most notably a Gibson Les Paul). Page played the Telecaster through a Supro amplifier. He also used a Gibson J-200, borrowed from Big Jim Sullivan, for the album's acoustic tracks.\n \n Led Zeppelin was produced by Jimmy Page and engineered by Glyn Johns, who had previously worked with The Beatles, The Rolling Stones and The Who. According to Page, &quot;The first album is a live album, it really is, and it's done intentionally in that way. It's got overdubs on it, but the original tracks are live.&quot;\n \n Page reportedly used natural room ambience to enhance the reverb and recording texture on the record, demonstrating the innovations in sound recording he had learned during his session days. Up until the late 1960s, most music producers placed microphones directly in front of the amplifiers and drums. For Led Zeppelin Page developed the idea of placing an additional microphone some distance from the amplifier (as far as twenty feet) and then recording the balance between the two. By adopting this &quot;distance equals depth&quot; technique, Page became one of the first producers to record a band's &quot;ambient sound&quot;—the distance of a note's time-lag from one end of the room to the other.\n \n Another notable feature of the album was the &quot;leakage&quot; on the recordings of Robert Plant's vocals. In a 1998 Guitar World interview, Page stated that &quot;Robert's voice was extremely powerful and, as a result, would get on some of the other tracks. But oddly, the leakage sounds intentional.&quot;On the track &quot;You Shook Me&quot;, Page used the &quot;backward echo&quot; technique. It involves hearing the echo before the main sound (instead of after it), and is achieved by turning the tape over and employing the echo on a spare track, then turning the tape back over again to get the echo preceding the signal.\n \n The album was one of the first albums to be released in stereo-only form; at the time the practice of releasing both mono and stereo versions was the norm.\n \n Led Zeppelin's front cover, which was chosen by Page, features a black-and-white image of the burning Hindenburg airship. The image refers to the origin of the band's name itself: when Page, Jeff Beck and The Who's Keith Moon and John Entwistle were discussing the idea of forming a group, Moon joked, &quot;It would probably go over like a lead balloon&quot;, and Entwistle allegedly replied, &quot;...a Lead Zeppelin!&quot;\n \n The album's back cover features a photograph of the band taken by former-Yardbird Chris Dreja. The entire design of the album's sleeve was coordinated by George Hardie, with whom the band would continue to collaborate for future sleeves.\n \n Hardie recalled that he originally offered the band a design based on an old club sign in San Francisco—a multi-sequential image of a phallic zeppelin airship up in the clouds. Page declined but it was retained as the logo for the back cover of Led Zeppelin's first two albums and a number of early press advertisements. During the first few weeks of release in the UK, the sleeve featured the band's name and the Atlantic logo in turquoise. When this was switched to the now-common orange print later in the year, the turquoise-printed sleeve became a collector's item.\n \n The album cover received widespread attention when, at a February 1970 gig in Copenhagen, the band were billed as &quot;The Nobs&quot; as the result of a legal threat from aristocrat Eva von Zeppelin (a relative of the creator of the Zeppelin aircraft). von Zeppelin, upon seeing the logo of the Hindenburg crashing in flames, threatened to have the show pulled off the air. In 2001, Greg Kot wrote in Rolling Stone that &quot;The cover of Led Zeppelin. . . shows the Hindenburg airship, in all its phallic glory, going down in flames. The image did a pretty good job of encapsulating the music inside: sex, catastrophe and things blowing up.&quot;\n \n The conceptual originality of the album was displayed on tracks such as &quot;Good Times Bad Times&quot;, &quot;Dazed and Confused&quot; and &quot;Communication Breakdown&quot;, which had a distinctively heavy sound to the ears of young rock fans in the late-1960s. Led Zeppelin also featured delicate steel-string acoustic guitar by Page on &quot;Black Mountain Side&quot;, and a combination of acoustic and electric approaches on their adaptation of &quot;Babe I'm Gonna Leave You&quot;.\n \n &quot;Dazed and Confused&quot; is arguably the album's centerpiece: a foreboding arrangement featuring a descending bass line from Jones, heavy drumming from Bonham and some powerful guitar riffs and soloing from Page. It also showcased Page playing guitar with a violin bow (an idea suggested by David McCallum Sr., whom Page had met while doing studio session work). The bowed guitar in the middle section of the song brought psychedelic rock to experimental new heights, especially in extended stage versions, building on Page's earlier renderings of the song during the latter days of The Yardbirds. &quot;Dazed and Confused&quot; would become Led Zeppelin's signature performance piece for years to come. The bowed guitar technique is also used on &quot;How Many More Times&quot;, a song which features a &quot;Bolero&quot; riff and an improvised shift in cadence.\n \n Many of Led Zeppelin's earliest songs were based on blues standards, and the album also included three songs composed by others: &quot;You Shook Me&quot; and &quot;I Can't Quit You Baby&quot;, both by blues artist Willie Dixon; and &quot;Babe I'm Gonna Leave You&quot;. Regarding the last of these, at the time guitarist Jimmy Page mistakenly believed he was adapting a traditional folk song he had heard on a Joan Baez record, but this was corrected on subsequent rereleases after it was revealed that the song was composed by Anne Bredon in the 1950s. Dixon, on the other hand, received proper credit as the composer of his two songs on this album (although &quot;You Shook Me&quot; would later be additionally credited to J. B. Lenoir) but would go on to settle out of court with Led Zeppelin over partial use of other material of his on Plant's lyrics to &quot;Whole Lotta Love&quot;. On &quot;You Shook Me&quot;, Plant vocally mimics Page's guitar effects—a metallicised version of the &quot;call and response&quot; blues technique.\n \n Jeff Beck had previously recorded &quot;You Shook Me&quot; for his album, Truth, and accused Page of stealing his idea. With John Paul Jones and drummer Keith Moon of The Who, Page had played on (and says he arranged) &quot;Beck's Bolero&quot;, an instrumental on Truth that would be grooved into the mix of the Led Zeppelin jam &quot;How Many More Times&quot;. These cross-pollinations led to a rift between Beck and Page, who had played in the Yardbirds together and been friends since childhood. In fact, it was Page who first suggested Beck for the Yardbirds' guitarist position when he was contacted by the band after Eric Clapton's departure.\n \n In an interview he gave in 1975, Page offered his own perspective on the album's music:\n \n     For material, we obviously went right down to our blues roots. I still had plenty of Yardbirds riffs left over. By the time Jeff Beck did go, it was up to me to come up with a lot of new stuff. It was this thing where Eric Clapton set a heavy precedent in the Yardbirds which Beck had to follow and then it was even harder for me, in a way, because the second lead guitarist had suddenly become the first. And I was under pressure to come up with my own riffs. On the first LP I was still heavily influenced by the earlier days. I think it tells a bit, too... It was obvious that somebody had to take the lead, otherwise we'd have all sat around jamming for six months. But after that, on the second LP, you can really hear the group identity coming together.\n \n Plant is credited on the album with &quot;occasional bass&quot;. In an interview he gave to Rolling Stone magazine in 2005, Plant made reference to this:\n \n     In truth, I was an occasional bass player. It says so on Zeppelin I, next to my name: vocals, harmonica and occasional bass. Very occasionally -- once, I think, since 1968. How in God's name that ended up on the cover is so funny. I'm sure Jonesy John Paul Jones didn't like it *laughs*. But I suppose every time he fucked up he could say it was me.\n \n The album was advertised in selected music papers under the slogan &quot;Led Zeppelin — the only way to fly&quot;.  It initially received poor reviews. In a stinging assessment, Rolling Stone magazine asserted that the band offered &quot;little that its twin, the Jeff Beck Group, didn't say as well or better three months ago ... It would seem that if they are to fil the void created by the demise of Cream, they will have to find a producer, editor and some material worthy of their collective talents.&quot;  It also called Plant &quot;as foppish as Rod Stewart, but nowhere near so exciting&quot;. John Paul Jones later recalled:\n \n     We had appalling press at the time. Nobody seemed to want to know us for one reason or another. We got to America and read the Rolling Stone review of the very first album, which was going on about us as another hyped British band. We couldn't belive it. In our naivety we thought we'd done a good album and were doing all right, and then this venom comes flying out. We couldn't understand why or what we'd done to them. After that we were very wary of the press, which became a chicken-and-egg situation. We avodied them and so they avoided us. It was only because we did a lot of show that our reputation got around as a good live band.\n \n As was noted by rock journalist Cameron Crowe years later: &quot;It was a time of &quot;super-groups,&quot; of furiously hyped bands who could barely cut it, and Led Zeppelin initially found themselves fighting upstream to prove their authenticity.&quot;\n \n However, press reaction to the album was not entirely negative. In Britain the album received a glowing review in the Melody Maker. Chris Welch wrote, in a review titled &quot;Jimmy Page triumphs — Led Zeppelin is a gas!&quot;: &quot;their material does not rely on obvious blues riffs, although when they do play them, they avoid the emaciated feebleness of most so-called British blues bands&quot;.\n \n The album was very commercially successful. It was initially released in America on 17 January 1969 to capitalise on the band's first U.S. concert tour. Before that, Atlantic Records had distributed a few hundred advance white label copies to key radio stations and reviewers. A positive reaction to its contents, coupled with a good reaction to the band's opening concerts, resulted in the album generating 50,000 advance orders. Within two months of its release the album had reached Billboard's Top 10. It stayed on the Billboard chart for 73 weeks and held a 79-week run on the British charts. By 1975 it had grossed $7,000,000.\n \n The success and influence of the album is today widely acknowledged, even amongst those critics who were initially skeptical. In 2006, for example, Rolling Stone stated that\n \n     The album was pretty much unlike anything else. The arrangements were more sculpted than those of Cream or Jimi Hendrix, and the musicianship wasn't cumbersome like Iron Butterfly's or bombastic like Vanilla Fudge's. The closest comparisons might be to MC5 or the Stooges—both from Michigan—yet neither had the polish or prowess of Led Zeppelin, nor did Led Zeppelin have the political, social or die-hard sensibility of those landmark bands. What they did have, though, was the potential for a mass audience.\n \n According to Lewis:\n \n     Time has done nothing to diminish the quality of one of the finest debut albums ever recorded. There's an urgency and enthusiasm about their performance that retains timeless charm. The nine cuts offer a tour de force of powerful yet often subtle dynamics ... And let's not forget the fact that with this album, Page virtually invents the guitar riff as a key songwriting component.\n \n In 2003, VH1 named Led Zeppelin the 44th greatest album of all time, while Rolling Stone ranked it 29th on the magazine's list of the 500 greatest albums of all time. It is widely regarded as marking a significant turning point in the evolution of hard rock and heavy metal.\n \n Publication   Country    Accolade     Year      Rank\n \n The Times United Kingdom &quot;The 100 Best Albums of All Time&quot; 1993 41\n Rolling Stone United States The Rolling Stone 500 Greatest Albums of All Time 2003 29\n Grammy Awards \tUnited States Grammy Hall of Fame Award 2004\t*\n Q United Kingdom &quot;The Music That Changed the World&quot; 2004 7\n Robert Dimery United States 1001 Albums You Must Hear Before You Die 2006 *\n Classic Rock United Kingdom\t&quot;100 Greatest British Rock Album Ever&quot;\t2006 81\n Uncut United Kingdom 100 Greatest Debut Albums 2006 7\n Rock and Roll Hall of Fame United States The Definitive 200 2007 165\n Q United Kingdom 21 Albums That Changed Music 2007 6\n \n \n &quot;How Many More Times&quot; was listed as 3:30 on the record sleeve deliberately by Jimmy Page in order to trick radio stations into playing the song.citation needed\n \n Robert Plant participated in songwriting but wasn't given credit because of unexpired contractual obligations resulting from his association with CBS Records.\n \n Some cassette versions of the album reversed the order of the sides. For these versions, side one began with &quot;Your Time Is Gonna Come&quot; and ended with &quot;How Many More Times&quot;, while side two began with &quot;Good Times, Bad Times&quot; and ended with &quot;Dazed and Confused&quot;.\n \n Jimmy Page (b. 1944) g, pedal steel g, producer\n Robert Plant (b. 1948) voc, harmonica, \n John Paul Jones (b. 1946) b, keyb., John Bonham (1948-1980) dr\n \n Viram Jasani  Tabla, Chris Dreja  back cover photo\n George Hardie album design\n Glyn Johns  mixer, Peter Grant prod.\n Recorded Oct. 1968 London, Publ. 12.1.1969 , UK#6, US#10\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Led Zeppelin is the debut album of English rock  band Led Zeppelin. It was recorded in October 1968 at Olympic Studios in London and released on Atlantic Records on 12 January 1969. The album featured integral contributions from each of the group's four musicians and established Led Zeppelin's fusion of blues and rock. Led Zeppelin also created a large and devoted following for the band, with their unique heavy metal sound endearing them to a section of the counterculture on both sides of the Atlantic. ", "published": "Wed, 7 Apr 2010 14:06:22 +0000"}, "name": "Led Zeppelin", "artist": "Led Zeppelin", "url": "http://www.last.fm/music/Led+Zeppelin/Led+Zeppelin", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/90391351.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/90391351.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90391351.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90391351.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/90391351/Led+Zeppelin++I+PNG.png", "size": "mega"}], "listeners": "351352", "toptags": {"tag": [{"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/classic%20rock", "name": "classic rock"}, {"url": "http://www.last.fm/tag/hard%20rock", "name": "hard rock"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}]}, "releasedate": "    9 Nov 2007, 00:00", "mbid": "913e4310-e710-4f8d-8c33-41befd7591f1", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Good Times Bad Times", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Good+Times+Bad+Times", "mbid": "95c9dbc4-ab0e-4760-a522-ae78f304e6f5", "duration": "166"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Babe I'm Gonna Leave You", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Babe+I%27m+Gonna+Leave+You", "mbid": "683ab72f-bc21-453d-abbf-a5f7518881a7", "duration": "401"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "You Shook Me", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/You+Shook+Me", "mbid": "00eca842-a1e1-4c71-90db-fda0fcfc49e8", "duration": "388"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Dazed and Confused", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Dazed+and+Confused", "mbid": "f0e05957-961b-46e4-a338-c14db0f9401a", "duration": "386"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Your Time Is Gonna Come", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Your+Time+Is+Gonna+Come", "mbid": "ed5a0305-1ba4-402e-9e40-10d10d6b5418", "duration": "402"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Black Mountain Side", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Black+Mountain+Side", "mbid": "6f1cf8eb-43fc-46be-9f6f-aabbd068c0b5", "duration": "132"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Communication Breakdown", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/Communication+Breakdown", "mbid": "e729f616-959c-4923-9887-66272a9c5285", "duration": "147"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "I Can't Quit You Baby", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/I+Can%27t+Quit+You+Baby", "mbid": "", "duration": "258"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "How Many More Times", "artist": {"url": "http://www.last.fm/music/Led+Zeppelin", "mbid": "678d88b2-87b0-403b-b63d-5da7465aecc3", "name": "Led Zeppelin"}, "url": "http://www.last.fm/music/Led+Zeppelin/_/How+Many+More+Times", "mbid": "", "duration": "508"}]}, "playcount": "4315106", "id": "2025240"}}