{"album": {"wiki": {"content": "Automatic for the People is the eighth album by the American alternative rock band R.E.M., released in 1992 on Warner Bros. Records. While R.E.M. had intended to make a harder-rocking album after dealing primarily with acoustic based sounds on its previous record Out of Time (1991), the group eventually abandoned that goal and created an album that was musically subdued and dealt with mortality. Automatic for the People reached number two on the US album charts and yielded six singles. It was ranked #247 in Rolling Stone’s 500 Greatest Albums of All Time.\n \n After promotional duties for their previous album Out of Time in May 1991, the members of R.E.M. began work on their next album. Starting the first week of June, guitarist Peter Buck, bassist Mike Mills, and drummer Bill Berry met several times a week in a rehearsal studio to work on new material. Once a month they would take a week-long break. The musicians would often trade instruments: Buck would play mandolin, Mills would play piano or organ, and Berry would play bass. Buck explained that writing without drums was productive for the band members. The band, intent on delivering an album of harder-rocking material after Out of Time, made an effort to write some faster rock songs during rehearsals, but came up with less than a half dozen prospective songs in that vein.\n \n When it came time to make demos, the musicians recorded them in their standard band configuration. According to Buck, the musicians recorded about 30 songs. Singer Michael Stipe was not present at these sessions; instead, the band gave him the finished demos at the start of 1992. Stipe described the music to Rolling Stone early that year as “very mid-tempo, pretty fucking weird More acoustic, more organ-based, less drums”. In February, R.E.M. recorded another set of demos at Daniel Lanois’ Kingsway Studios in New Orleans.\n \n The group decided to create finished recordings with co-producer Scott Litt at Bearsville Studios in Woodstock, New York, starting on March 30. The band recorded overdubs in Miami and New York City. String arrangements were recorded in Atlanta, Georgia. After recording sessions were completed in July, the album was mixed at Bad Animals Studio in Seattle.\n \n Automatic for the People was released in October 1992. In the United States, the album reached number two on the Billboard 200 album charts. The album reached number one in the United Kingdom, where it topped the UK Albums Chart on four separate occasions. Despite not having toured after the release of Out of Time, R.E.M. again declined to tour in support of this album. Automatic for the People has been certified four times platinum in the United States (four million copies shipped), six times platinum in the United Kingdom (1.8 million shipped), and three times platinum in Australia (210,000 shipped). The album has sold 3.5 million copies in the United States, according to Nielsen SoundScan.\n \n Automatic for the People yielded six singles over the course of 1992 and 1993: “Drive”, “Man on the Moon”, “The Sidewinder Sleeps Tonite”, “Everybody Hurts”, “Nightswimming”, and “Find the River”. Lead single “Drive” was the album’s highest-charting domestic hit, reaching number 28 on the Billboard Hot 100. Other singles charted higher overseas: “Everybody Hurts” charted in the top ten in the United Kingdom, Canada, and Australia.\n \n R.E.M. biographer David Buckley wrote, “Automatic for the People is regarded by Peter Buck and Mike Mills, and by most critics, as being the finest R.E.M. album ever recorded.” Rolling Stone gave the album five stars. Reviewer Paul Evans wrote, “Despite its difficult concerns, most of Automatic is musically irresistible.” Melody Maker reviewer Allan Jones commented, “It’s almost impossible to write about the record without mentioning the recent grim rumors concerning Stipe’s health”, in reference to the rumors at the time that the singer was dying of AIDS or cancer. Jones concluded his review by noting, “Amazingly, initial reactions to Automatic for the People in this particular vicinity have been mixed Psshaw to them. Automatic for the People is R.E.M. at the very top of their form.” Ann Powers, reviewing the album for The New York Times, noted that only three of the songs on the album went beyond mid-tempo and said, “Only ‘Man on the Moon’ shines with a wit that balances R.E.M.’s somber tendencies”. Powers finished her review by saying, “Even in the midst of such disenchantment, R.E.M. can’t resist its own talent for creating beautiful and moving sounds. Buck, Mills and Berry can still conjure melodies that fall like summer sunlight. And Stipe still possesses a gorgeous voice that cannot shake its own gift for meaning.”Guy Garcia, for Time, also noted the album’s themes of “hopelessness, anger and loss”. Garcia added that the album proves “that a so-called alternative band can keep its edge after conquering the musical mainstream” and that it “manages to dodge predictability without ever sounding aimless or unfocussed”. Automatic for the People placed third in the Village Voice Pazz &amp; Jop year-end critics’ poll. The album was nominated for Album of the Year at the Grammy Awards of 1993. It was also ranked #247 in Rolling Stone’s 500 Greatest Albums of All Time.\n \n In 2005, Warner Bros. Records issued a two-disc edition of Automatic for the People which includes a CD, a DVD-Audio disc containing a 5.1-channel surround sound mix of the album done by Elliot Scheiner, and the original CD booklet with expanded liner notes.\n \n The album name refers to the motto of Athens, Georgia, eatery Weaver D’s Delicious Fine Foods. The photograph on the front cover is not related to the restaurant: it shows a star ornament that was part of the sign for the Sinbad Motel on Biscayne Boulevard in Miami, near Criteria Studios, where the bulk of the album was recorded. The motel is still there, but the star is not. The slanted support where it was once attached is still there on the roof of the Sinbad. The interior jacket shows a two–three story circular platform that was the sign for the old Bon Aire Motel on the former Motel Row on Miami Beach. The Bon Aire and other motel row establishments have mostly been demolished for new high-rise condominiums.\n \n The front cover of the album shows a greyed-out photograph of a Miami motel sign placed over an embossed image, which is also included inside the album’s booklet distorted on a white background. The back cover features a photograph of an old building with the track listing written over at the same angle from which the building is viewed. Other photographs, taken by Anton Corbijn, feature the band members on a beach.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Automatic for the People is the eighth album by the American alternative rock band R.E.M., released in 1992 on Warner Bros. Records. While R.E.M. had intended to make a harder-rocking album after dealing primarily with acoustic based sounds on its previous record Out of Time (1991), the group eventually abandoned that goal and created an album that was musically subdued and dealt with mortality. Automatic for the People reached number two on the US album charts and yielded six singles. It was ranked #247 in Rolling Stone’s 500 Greatest Albums of All Time. ", "published": "Thu, 3 Sep 2009 15:26:36 +0000"}, "name": "Automatic for the People", "artist": "R.E.M.", "url": "http://www.last.fm/music/R.E.M./Automatic+for+the+People", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/87711671.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/87711671.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/87711671.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/87711671.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/87711671/Automatic+for+the+People+PNG.png", "size": "mega"}], "listeners": "563159", "toptags": {"tag": [{"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/alternative%20rock", "name": "alternative rock"}, {"url": "http://www.last.fm/tag/1992", "name": "1992"}]}, "releasedate": "    3 Dec 2002, 00:00", "mbid": "def0d8be-d3fb-49a3-aac2-b579334f4299", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Drive", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Drive", "mbid": "336a4661-bc99-4466-b051-b2c20a923d40", "duration": "265"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Try Not to Breathe", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Try+Not+to+Breathe", "mbid": "ee9f7725-7f52-4610-95a8-5521f16262ae", "duration": "229"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "The Sidewinder Sleeps Tonite (Album Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/The+Sidewinder+Sleeps+Tonite+(Album+Version+)", "mbid": "", "duration": "249"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Everybody Hurts", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Everybody+Hurts", "mbid": "188548dc-0b03-4da9-9fbb-b33455d8629a", "duration": "363"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "New Orleans Instrumental No.1 ( LP Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/New+Orleans+Instrumental+No.1+(+LP+Version+)", "mbid": "", "duration": "135"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Sweetness Follows ( LP Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/Sweetness+Follows+(+LP+Version+)", "mbid": "", "duration": "260"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Monty Got A Raw Deal (LP Version)", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/Monty+Got+A+Raw+Deal+(LP+Version)", "mbid": "", "duration": "196"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Ignoreland ( LP Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/Ignoreland+(+LP+Version+)", "mbid": "", "duration": "266"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Star Me Kitten ( LP Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/Star+Me+Kitten+(+LP+Version+)", "mbid": "", "duration": "195"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "Man on the Moon", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Man+on+the+Moon", "mbid": "09f63d5c-d4d4-4625-9f0b-0a3909b3b7ae", "duration": "314"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "Nightswimming", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/R.E.M./_/Nightswimming", "mbid": "841cd3fb-6427-4b44-a26d-cbee3c6f0e08", "duration": "255"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "Find The River ( LP Version )", "artist": {"url": "http://www.last.fm/music/R.E.M.", "mbid": "ea4dfa26-f633-4da6-a52a-f49ea4897b58", "name": "R.E.M."}, "url": "http://www.last.fm/music/+noredirect/R.E.M./_/Find+The+River+(+LP+Version+)", "mbid": "", "duration": "228"}]}, "playcount": "7248275", "id": "1412108"}}