{"album": {"wiki": {"content": "Relapse is the sixth studio album by American rapper Eminem. It was released by record label Interscope Records, along with subsidiaries Aftermath Entertainment and Shady Records, first on May 15, 2009, followed by May 19 in the United States. Relapse will be Eminem's first studio album since Encore in 2004, thus ending the rapper's musical hiatus.\n \n Since 2005, Eminem had intended to take a break from recording his own music in order to become a hip hop producer for other rap acts, especially for the artists signed on his own label Shady Records. Such a break came when Eminem canceled the European leg of the Anger Management Tour in the summer of 2005 due to exhaustion and an addiction to sleeping pills. In the following year, the rapper's remarriage to his former wife Kimberly Scott lasted only eleven weeks before a second divorce, while his closest friend and fellow rapper DeShaun &quot;Proof&quot; Holton was later shot and killed during an altercation outside a nightclub in Detroit. Devastated by this, Eminem relapsed into prescription drugs and became increasingly reclusive from the outside world, as he would rarely leave his house nor appear in public.\n \n     “ But, for some reason, in hindsight, the way I felt was almost like [Proof's death] happened to just me … I just went into such a dark place that, with everything, the drugs, my thoughts, everything. [sic] And the more drugs I consumed, and it was all depressants I was taking, the more depressed I became, the more self-loathing I became…”\n \n         — Eminem, XXL, Issue of June 2009\n \n Speculation on an upcoming album by Eminem was reported since mid–2007 from announcements made by artists 50 Cent and Stat Quo, a current and former member of Shady Records respectively. Also, rapper Bizarre—member of the hip hop group D12—stated that the release of the group's third studio album was on hold because Interscope Records wanted to release Eminem's album first. By the end of the year, additional musicians associated with Shady Records, including The Alchemist, Bishop Lamont, Cashis and Obie Trice had confirmed on different occasions that the rapper was effectively working on a new album. On September 12, 2007, during a call at the radio station WQHT Hot 97, Eminem stated that he was in limbo and was not sure whether he would release any new material in the near future. The rapper then elaborated that at that point he was constantly working in the recording studio and was happy he had come to terms with his personal issues.\n \n In the initial recording stages of Relapse, record producer and long-time Detroit collaborator Jeff Bass of the Bass Brothers worked with Eminem on twenty-five tracks during the two-year period after the rapper had received treatment for his sleeping pill-addiction in 2005. Bass described the production of those songs as an attempt to return to Eminem's original sound, similar to The Marshall Mathers LP, and to allow the artist to rap &quot;off the top of his head, as opposed to writing a story.&quot; At the same time, according to the Eminem's song rights supervisor Joel Martin, the rapper began collecting additional songs without noticing it, as Eminem would often record material for other people's musical projects and inevitably end up with tracks he really liked.\n \n Eminem purchased the Effigy Studio in Ferndale, Michigan in 2007, and ended his working relationship with much of his former production team of the 54 Sound recording studio, including the Bass Brothers. He then continued recording the album with producer Dr. Dre, who in September 2007 stated his intention to dedicate two months to the production of Relapse. The making of the album progressed at the Effigy Studio up to a year after, as recording sessions were then moved to Miami in September 2008. Originally, Eminem and Dr. Dre had planned to work in the studio for only a few more days since September, but this eventually became six months. Eminem would later say the two were on a hot recording streak and had collected a large amount of new music, adding to his previous claim in November where the rapper estimated he had recorded an estimated hundred songs in the last two years.\n \n During this recording period, a handful of songs intended for Relapse were leaked on the Internet, including an incomplete version of &quot;Crack a Bottle&quot;. The song was then finished in January 2009 with additional vocals from Dr. Dre and 50 Cent. Despite the leak, in February 2009 the album was being completed in a state of near-total secrecy, according to the British newspaper The Independent. Even Polydor Records, the multinational owner of Interscope, had no information on the album at the time. On April 23, Eminem suggested he and possibly Dr. Dre were the only ones in possession of the final copy of Relapse, while his manager Paul Rosenberg added that even Eminem's record labels were not in possession of the music at less than one month from the release date in order to prevent possible bootlegging.\n \n Relapse is produced entirely by Dr. Dre, except for one song Eminem produced himself. According to Eminem, to work with Dr. Dre allowed him to concentrate on the processes of songwriting rather than the production, which was taken care of by Dre himself. The rapper justified his choice of using Dr. Dre for the vast majority of the production due to their long collaborative history and a musical &quot;chemistry&quot; only he and Dr. Dre shared. This allowed the rapper to pick the beats from Dr. Dre's catalog that challenged him rhythm-wise in order to experiment with different flows. The album features guest appearances by Dr. Dre and 50 Cent.\n \n In November 2008, 50 Cent stated that the death of Eminem's close friend and fellow rapper Proof, in 2006, would be an inspiration for the record's material, adding that Eminem &quot;has some really serious things to write about that he didn't quite get a chance to express.&quot; Eminem too confirmed in January 2009 that the departed artist would be a theme on the album, with at least one song dealing with Proof's death. Otherwise, he described the music as more upbeat than before, explaining that he had become a happier person and had learned to cope with his friend's loss. In contrast, in April 2009 Eminem then stated that the album would feature the return of his evil alter-ego Slim Shady and would be similar to the dark themes of &quot;3am&quot;, which depicts him as a psychotic serial killer during a spring of homicides at late-night.\n \n \n The album cover for Relapse was first published through Eminem's Twitter account on April 21, 2009. It illustrates a head shot of the rapper composed by a mosaic of thousands of pills. A sticker on the cover resembles a prescription drug label, on which the patient is Eminem and Dr. Dre is the prescribing doctor. Gil Kaufman of MTV News described the cover as a reference to the rapper's struggle and addiction to prescription drugs, adding that it follows Eminem's habit of displaying personal issues in his art. The album booklet follows a pill prescription design, so does the back cover. On the backside of the booklet is a dedication to Proof, where Eminem explains that he's sober and that he tried to write a song for him, but no one was good enough, therefore he dedicates the whole album to him. The CD itself is grey with the big red inscription &quot;Push Down &amp; Turn&quot;.\n \n In 2007, Shady Records rapper Cashis discussed the album, referring to it by the title King Mathers, adding that it would be released later that year. However, Eminem's publicist Dennis Dennehy would later deny this, stating that &quot;there [was] no album scheduled for a 2007 release&quot; and that as of August 2007 there was no confirmed title either. No other official statement was made for over a year, when on September 15, 2008, at an event held by Shade 45 to celebrate the publication of Eminem's autobiography The Way I Am, the rapper confirmed his plans to release a studio album by the title of Relapse. During the party, he also previewed to the audience a song called &quot;I'm Having a Relapse&quot;.\n \n In regards to the album's release date, Rolling Stone wrote on the issue of October 2008 that Virgin Megastores had planned to distribute Relapse on November 27, 2008, coincidentally on Thanksgiving in the United States. On October 27, a spokesperson for Interscope explained that there was no official date at the time, and that any release dates that had been posted on any website were unfounded. In a phone conversation during the finale of Total Request Live on November 16, 2008, Eminem asserted that Relapse would be released during the first quarter of 2009, precisely during either of the first two months of the year, explaining that he was in the process of selecting the songs for the album.\n \n Despite the leak two months before, &quot;Crack a Bottle&quot; was eventually released for legal paid digital download as well as a promotional single on February 2, 2009 and also reached the number one position on the U.S. Billboard Hot 100, while, according Eminem's manager Paul Rosenberg, a music video for the song was produced and directed by Syndrome, but has not been released thus far. At the time of the release, various contradicting reports disputed whether the song would be included on Relapse. Despite the initial confusion, in a press release head label Universal Music Group eventually confirmed the single's inclusion on the album. In similar press statements, since March 5, Universal made public the regional release dates for Relapse. The album will be available as early as May 15, 2009 in Italy and the Netherlands, while it will be sold in most European countries and Brazil on May 18, and the following day also in the United States and Australia. Additionally, the record label also announced a second album by Eminem, Relapse 2, which will be released by the end of the year. Eminem explained that he and Dr. Dre had recorded a considerable amount of music and thus, by releasing two albums would allow listeners to have access to all of his music.\n \n After the release of &quot;Crack a Bottle&quot;, the music video of the single &quot;We Made You&quot; was aired on April 7, and became available for purchase a week later on April 13. The video was directed by Joseph Kahn and premiered simultaneously on several MTV channels, as well as MTV's website. On April 28, the third overall single for the album, &quot;3am&quot;, was released once again for paid music download. A music video for &quot;3am&quot; was directed by Syndrome and filmed in Detroit. It premiered on May 2 on Cinemax, several days after a trailer for the video was posted online. Two more singles were distributed prior to the album's release, as &quot;Old Time's Sake&quot; and &quot;Beautiful&quot; went on sale on the iTunes Store on May 5 and May 12 respectively.\n \n Previously on April 4, 2009, Eminem was featured on CBS during the network's coverage of the 2009 NCAA Final Four, in segment where he recited the spoken word &quot;Love Letter to Detroit&quot;. Later on the same day, the rapper inducted the hip hop group Run-D.M.C. to the Rock and Roll Hall of Fame. Adam Graham of The Detroit News described this as &quot;all part of the calculated promotional push&quot; for Relapse. The rapper will perform live at the 2009 MTV Movie Awards on May 31, while he will also be featured on the covers of hip hop magazines Vibe and XXL in their respective issues of June 2009. Eminem also announced through his website that an iPhone game to accompany the album is set to be released on May 19, 2009.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Relapse is the sixth studio album by American rapper Eminem. It was released by record label Interscope Records, along with subsidiaries Aftermath Entertainment and Shady Records, first on May 15, 2009, followed by May 19 in the United States. Relapse will be Eminem's first studio album since Encore in 2004, thus ending the rapper's musical hiatus.  Since 2005, Eminem had intended to take a break from recording his own music in order to become a hip hop producer for other rap acts, especially for the artists signed on his own label Shady Records.", "published": "Mon, 17 Jan 2011 20:14:03 +0000"}, "name": "Relapse", "artist": "Eminem", "url": "http://www.last.fm/music/Eminem/Relapse", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/88163217.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/88163217.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88163217.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88163217.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/88163217/Relapse.png", "size": "mega"}], "listeners": "499464", "toptags": {"tag": [{"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/horrorcore", "name": "horrorcore"}, {"url": "http://www.last.fm/tag/2009", "name": "2009"}]}, "releasedate": "    19 May 2009, 00:00", "mbid": "c0c2f1bf-57d9-4d4f-88a0-4da54ac7c65e", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Dr. West (Skit (Edited))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Dr.+West+(Skit+(Edited))", "mbid": "", "duration": "89"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "3 a.m.", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/3+a.m.", "mbid": "285e3895-438f-43bb-b578-e63adb8e1e55", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "My Mom", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/My+Mom", "mbid": "b9ba7418-87c7-4c89-acd7-9dd5cddec7cf", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Bagpipes From Baghdad", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Bagpipes+From+Baghdad", "mbid": "8d8888f7-f63b-4f16-9ec4-e2a412c8411b", "duration": "283"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Hello", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Hello", "mbid": "3881123c-64e6-48a3-9368-56d61022dcdf", "duration": "248"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Tonya (Skit (Edited))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Tonya+(Skit+(Edited))", "mbid": "", "duration": "42"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Same Song & Dance", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Same+Song+&+Dance", "mbid": "f00d3e3d-3967-4651-b302-77bde600bc15", "duration": "247"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Medicine Ball", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Medicine+Ball", "mbid": "745d71cf-051b-4ef9-a828-2458b06af698", "duration": "237"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Paul (Skit (Edited))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Paul+(Skit+(Edited))", "mbid": "", "duration": "19"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "Stay Wide Awake", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Stay+Wide+Awake", "mbid": "56bc036a-306d-40e4-9dc4-ee63886906de", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "Old Time's Sake", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Old+Time%27s+Sake", "mbid": "", "duration": "278"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "Must Be The Ganja", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Must+Be+The+Ganja", "mbid": "0bc46f62-6a56-437e-9543-df6ee02ca130", "duration": "243"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "Mr. Mathers ((Skit) Album Version)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Mr.+Mathers+((Skit)+Album+Version)", "mbid": "", "duration": "42"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "Deja Vu", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Deja+Vu", "mbid": "", "duration": "284"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "15"}, "name": "Steve Berman (Skit (Edited))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Steve+Berman+(Skit+(Edited))", "mbid": "", "duration": "89"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "16"}, "name": "Underground/Ken Kaniff", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Underground%2FKen+Kaniff", "mbid": "", "duration": "372"}]}, "playcount": "10199227", "id": "23854099"}}