{"album": {"wiki": {"content": "The Marshall Mathers LP is the third studio album by American rapper Eminem. Released May 23, 2000, the album sold more than 1.79 million copies in its first week just in the US, earning a spot in the Guinness Book of World Records as the fastest selling solo album ever. In 2001, the album won the Grammy Award for Best Rap Album and was nominated for Album of the Year. It has gone on to be certified 9x platinum by the RIAA in the United States, The album has now sold over 10.2 million copies in the US and as of 2005 had sold over 19 million units worldwide.\n \n Often cited as Eminem's magnum opus, The Marshall Mathers LP has been ranked as one of the greatest hip-hop albums of all-time by such magazines as Rolling Stone, Time, and XXL. Rolling Stone placed the album at number 7 on its list of the best albums of the 2000s. The album was ranked number 302 by Rolling Stone on their list of The 500 Greatest Albums of All Time. In 2010, Rhapsody featured it on its list of &quot;The 10 Best Albums By White Rappers&quot;.\n \n n the album's title, The Marshall Mathers LP is a more serious and personal album than his major-label debut, The Slim Shady LP, which predominantly featured his exaggerated Slim Shady persona. Much of the album is spent addressing his rise to fame and attacking those who criticized his first album. Other themes include his relationship with his family, most notably his mother and Kim Mathers, his former wife.\n \n The Marshall Mathers LP was released in both clean and explicit versions. However, some lyrics of the album are censored even on its explicit version, making it an extremely explicit album. Some songs are censored because of events surrounding the album's release. These include the lines &quot;I take seven kids from Columbine, stand 'em all in line&quot; from &quot;I'm Back&quot;, &quot;Which is it bitch, Mrs. Briggs or Ms. Mathers? It doesn't matter your attorney Fred Gibson's a faggot!&quot; from &quot;Marshall Mathers&quot;. Unlike Eminem's debut, The Slim Shady LP, The Marshall Mathers LP  is more introspective in its lyrics and less of the Slim Shady persona. Eminem's lyrical topics range from the controversy surrounding his lyrics to the Columbine High School massacre. Most songs cover Eminem's childhood struggles and family issues, involving his mother (&quot;Marshall Mathers&quot;), the relationship struggles with his wife (&quot;Kim&quot;), his struggles with his superstardom and expectations (&quot;Stan&quot;,&quot;I'm Back&quot;), his return and effect on the music industry (&quot;Remember Me?&quot;, &quot;Bitch Please II&quot;), his drug use (&quot;Under the Influence&quot;, &quot;Drug Ballad&quot;), his effect on the American youth and society (&quot;The Way I Am&quot;) (&quot;Who Knew&quot;), and reactionary barbs to critical response of his vulgarity and dark themes (&quot;Criminal&quot;, &quot;Kill You&quot;). Throughout the entire album, the listener is presented with a mix of dark themes, controversy, and life stories. Despite the large amount of controversy regarding the lyrics, the lyrics on the album were overwhelmingly well-received among critics and the hip-hop community, many praising Eminem's verbal energy and dense rhyme patterns. Eminem went on to answer his critics more frequently in some of his later works.\n \n The album contains various lyric samples and references. It features a number of lines mimicking songs from Eric B. &amp; Rakim's album Paid in Full. The chorus to &quot;The Way I Am&quot; resembles lines from the song &quot;As the Rhyme Goes On&quot;, and the first two lines from the third verse of &quot;I'm Back&quot; are based on lines from &quot;My Melody&quot;. In &quot;Marshall Mathers&quot;, Eminem parodies the song &quot;Summer Girls&quot; by LFO when he says &quot;New Kids on the Block sucked a lotta dick, boy-girl groups make me sick&quot; singing the same melody of the &quot;Summer Girls&quot;, when the original line is &quot;New Kids on the Block had a bunch of hits, Chinese food makes me sick&quot;.\n \n The clean version of the album is only slightly censored, as it leaves &quot;ass&quot;, &quot;shit&quot;, &quot;bitch&quot;, &quot;goddamn&quot;, &quot;faggot&quot; and &quot;nigga&quot; uncensored. The only censored profanities are &quot;fuck&quot; and a few other words which were deemed inappropriate which are normally either backmasked or blanked. However, the line from &quot;The Real Slim Shady&quot;, &quot;fuck him and fuck you too&quot; was bleeped out as a reference/joke on television censorship. The only content significantly edited were offensive and violent parts that were aimed at police, prostitutes, women, gays, and schools such as Columbine, and even the names of guns were censored out, along with the sound effects of guns firing bullets is completely cut (in response to the recent Columbine massacre). Explicit drug content and alcohol references are also removed. On many copies, the 25-second &quot;Public Service Announcement&quot; is shortened to just two seconds of silence. On other copies though, the track is still left fully intact. On the clean version, the song &quot;Kim&quot; was completely removed because of the violent messages aimed at his wife and was replaced with the South Park themed song &quot;The Kids&quot;, which was about doing drugs.\n \n The Marshall Mathers LP contains references to Eminem's feud with Insane Clown Posse: A skit entitled &quot;Ken Kaniff&quot; parodies the group members Shaggy 2 Dope and Violent J performing fellatio  on Eminem's recurring character Ken Kaniff, while in the song &quot;Marshall Mathers&quot; Eminem raps &quot;I was put here to put fear in faggots who spray Faygo Root Beer and call themselves &quot;clowns&quot; cause they look queer/Faggy 2 Dope and Silent Gay/claimin' Detroit, when y'all live twenty miles away...&quot;, as well as &quot;Slim Anus/You damn right, Slim Anus/I don't get fucked in mine like you two little flamin' faggots.&quot;\n \n Much of the first half of the album is produced by Dr. Dre and Mel-Man, who typically employ sparse, stripped-down beats, allowing Eminem's rapping to take center stage. Bass Brothers and Eminem produced most of the second half, which ranges from the laid-back guitars of &quot;Marshall Mathers&quot; to the gritty atmosphere of &quot;Amityville.&quot; The only outside producer on the album is The 45 King, who sample the chorus of Dido's song &quot;Thank You&quot; for &quot;Stan&quot;, while adding a slow bass line.\n \n During the first week of sales, the album sold 1.76 million copies, becoming the fastest-selling rap album in history, more than doubling the previous record held by Snoop Dogg's 1993 debut Doggystyle, and topping Britney Spears' record for highest one-week sales by any solo artist. The Marshall Mathers LP  is still Eminem's best-selling album. The album sold 800,000 in its second week, 598,000 in its third week, and 519,000 in its fourth week for a four week total of 3.65 million, and became one of few albums to sell over half a million copies for four consecutive weeks. It finished out the year 2000 as the second highest selling album of the year with over 7.9 million sold.  In 2010, the Nielsen Company reported that up until November 2009, the album had sold 10,216,000 units in the US, making it the fourth-best selling album of the decade. The album's US shipments have earned it a 9x Platinum certification from the RIAA.\n \n On October 26, 2000, Eminem was to perform at a concert in Toronto's Skydome. However, Ontario Attorney General Jim Flaherty argued that Canada should stop Eminem at the border. &quot;I personally don't want anyone coming to Canada who will come here and advocate violence against women,&quot; he said. Flaherty claims to have been &quot;disgusted&quot; when reading transcriptions of Eminem's song &quot;Kill You&quot;, which includes lines like &quot;Slut, you think I won't choke no whore/till the vocal cords don't work in her throat no more?&quot; The opinion of the general public to the requests made by the province were negative. Eugenia Lopes, an 18-year old who held concert tickets, said &quot;If you're going to blame music, you also have to blame movies. You can't just blame one source.&quot; Others said the issue was one of free speech. Liberal MPP Michael Bryant suggested that the government lay hate crime charges against Eminem for the advocation of violence against women found in his lyrics. In a Globe and Mail editorial, author Robert Everett-Green wrote, &quot;Being offensive is Eminem's job description.&quot; Eminem's Toronto concert went on as planned that night.\n \n Protests against the album's content reached a climax when it was nominated for four Grammy Awards in 2001 including Album of the Year, marking the first time a hardcore rap album was ever nominated in this category. At the ceremony, Eminem performed &quot;Stan&quot; in a duet with openly gay artist Elton John playing piano and singing the chorus, as a response to claims by GLAAD and others who claimed his lyrics were homophobic. GLAAD did not change its position, however, and spoke out against Elton John's decision. Despite significant protests and debate, The Marshall Mathers LP went on to win Best Rap Album.\n \n Despite the controversy surrounding the album and its commercial success, the album received general favorable reviews from music critics. At Metacritic, which assigns a normalized rating out of 100 to reviews from mainstream critics, the album has received an average score of 79, based on 20 reviews. Critic and writer Robert Christgau from Village Voice applauded the album and declared it &quot;a work of art whose immense entertainment value in no way compromises its intimations of a pathology that's both personal and political.&quot; Christgau also acknowledged Eminem as exceptionally witty, musical, discernibly thoughtful, and good-hearted. Allmusic called the album fairly brilliant and noted its production for its liquid basslines, slight sound effects, and spacious soundscapes. NME gave the album a 9 out of 10 rating and described it as a &quot;gruelling assault course of lyrical genius&quot;. Entertainment Weekly commended the album for its diversity, calling it &quot;indefensible and critic-proof, hypocritical and heartbreaking, unlistenable and undeniable&quot; and &quot;the first great pop record of the 21st century&quot;. Online music magazine Pitchfork Media placed The Marshall Mathers LP at number 119 on their list of top 200 albums of the 2000s. In 2010, Rhapsody (online music service) featured it on its list of &quot;The 10 Best Albums By White Rappers&quot;.\n \n In 2002, French jazz pianist Jacques Loussier filed a $10 million lawsuit against Eminem, claiming the beat for &quot;Kill You&quot; was stolen from his song.\n \n # In 2003, the album was ranked number 302 on Rolling Stone's list of The 500 Greatest Albums of All Time. In its book format, the album was moved up to #298.\n # In 2006, the album was chosen by Time as one of the 100 greatest albums of all time.\n # IGN placed the album at number twenty-four on their 2004 list of the greatest rap albums in history.\n # Digital Dream Door listed the album as the nineteenth greatest rap album of all time.\n # In 2005, Pitchfork Media and Stylus Magazine named the album #93 and #24, respectively, in their list of the best albums released between 2000 and 2004.\n # It was the highest ranked rap album on the National Association of Recording Merchandisers &amp; the Rock and Roll Hall of Fame's list of the 200 greatest albums of all time at number 28.\n # In 2006, Q ranked the album #85 on a list of the greatest albums of all time, the highest position held by any rap album on the list.\n # In 2007, Q named it one of the three best and most essential hip hop/rap CDs of all time. The other two were Public Enemy's It Takes a Nation of Millions to Hold Us Back and Wu-Tang Clan's Enter the Wu-Tang (36 Chambers).\n # It is one of the few albums ever to receive the top ranking of &quot;XXL&quot; from XXL. It was Eminem's first album to be rated by the magazine.\n # It was named the fourth greatest Music Album of 2000's by Complex Magazine.\n # Rolling Stone placed the album at #7 on its list of the best albums of the 2000s.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "The Marshall Mathers LP is the third studio album by American rapper Eminem. Released May 23, 2000, the album sold more than 1.79 million copies in its first week just in the US, earning a spot in the Guinness Book of World Records as the fastest selling solo album ever. In 2001, the album won the Grammy Award for Best Rap Album and was nominated for Album of the Year. It has gone on to be certified 9x platinum by the RIAA in the United States, The album has now sold over 10.2 million copies in the US and as of 2005 had sold over 19 million units worldwide. ", "published": "Mon, 2 Aug 2010 16:43:57 +0000"}, "name": "The Marshall Mathers LP", "artist": "Eminem", "url": "http://www.last.fm/music/Eminem/The+Marshall+Mathers+LP", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/93278307.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/93278307.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/93278307.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/93278307.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/93278307/The+Marshall+Mathers+LP.png", "size": "mega"}], "listeners": "681577", "toptags": {"tag": [{"url": "http://www.last.fm/tag/albums%20i%20own", "name": "albums i own"}, {"url": "http://www.last.fm/tag/rap", "name": "rap"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/eminem", "name": "eminem"}, {"url": "http://www.last.fm/tag/00s", "name": "00s"}]}, "releasedate": "    22 May 2000, 00:00", "mbid": "c91de8fc-8674-4273-bbcb-5c9185dc6567", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Public Service Announcement 2000 (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Public+Service+Announcement+2000+(Explicit)", "mbid": "", "duration": "27"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Kill You (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Kill+You+(Explicit)", "mbid": "", "duration": "264"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "Stan", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Stan", "mbid": "01d82066-4634-4e6d-9c63-40a4d77cc4a8", "duration": "381"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Paul (Skit) (Explicit)", "artist": {"url": "http://www.last.fm/music/Paul+%22Bunyan%22+Rosenburg", "mbid": "", "name": "Paul \"Bunyan\" Rosenburg"}, "url": "http://www.last.fm/music/Paul+%22Bunyan%22+Rosenburg/_/Paul+(Skit)+(Explicit)", "mbid": "", "duration": "10"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Who Knew (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Who+Knew+(Explicit)", "mbid": "", "duration": "227"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "Steve Berman (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Steve+Berman+(Explicit)", "mbid": "", "duration": "53"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "The Way I Am (Explicit Version)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/The+Way+I+Am+(Explicit+Version)", "mbid": "", "duration": "291"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "The Real Slim Shady (Explicit Version)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/The+Real+Slim+Shady+(Explicit+Version)", "mbid": "", "duration": "284"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Remember Me? (Album Version (Explicit))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Remember+Me%3F+(Album+Version+(Explicit))", "mbid": "", "duration": "218"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "I'm Back (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/I%27m+Back+(Explicit)", "mbid": "", "duration": "309"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "Marshall Mathers (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Marshall+Mathers+(Explicit)", "mbid": "", "duration": "321"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "12"}, "name": "Ken Kaniff (Skit) (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Ken+Kaniff+(Skit)+(Explicit)", "mbid": "", "duration": "61"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "13"}, "name": "Drug Ballad (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Drug+Ballad+(Explicit)", "mbid": "", "duration": "300"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "14"}, "name": "Amityville (Featuring Bizarre From D-12) (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Amityville+(Featuring+Bizarre+From+D-12)+(Explicit)", "mbid": "", "duration": "254"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "15"}, "name": "Bitch Please II (Album Version (Explicit))", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Bitch+Please+II+(Album+Version+(Explicit))", "mbid": "", "duration": "288"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "16"}, "name": "Kim (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Kim+(Explicit)", "mbid": "", "duration": "377"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "17"}, "name": "Under The Influence (Explicit Version)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Under+The+Influence+(Explicit+Version)", "mbid": "", "duration": "321"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "18"}, "name": "Criminal (Explicit)", "artist": {"url": "http://www.last.fm/music/Eminem", "mbid": "b95ce3ff-3d05-4e87-9e01-c97b66af13d4", "name": "Eminem"}, "url": "http://www.last.fm/music/Eminem/_/Criminal+(Explicit)", "mbid": "", "duration": "313"}]}, "playcount": "9585615", "id": "23729"}}