{"album": {"wiki": {"content": "“This album coincides with a happier time in my life. I think it’s very obvious in the music. It reflects how I’m feeling now, the joy that I have in my marriage and family, and hopefully in the future.”\n \n It had only been a few days since singer and pianist Diana Krall publicly announced that she and husband Elvis Costello were expecting their first child. Her remarks may have primarily focused on her upcoming album, but it was easy to discern the rosy glow as she discussed imminent arrivals, and how she came up with the name for one of them.\n \n “I already knew before we went into the studio the title of the record. I definitely knew it was going to be From This Moment On.”\n \n Cole Porter’s romantic ode to great expectations (with its hip, heartening couplet, “No more blue songs/Only whoop-dee-doo songs”) could not be more apt a title track for Krall’s tenth album. From This Moment On is an eleven-song collection that captures the Canadian-born sensation in full swing, in great company, and at the top of her game. It could also be called her strongest, most cohesive release to date.\n \n Krall is the first to admit that the album’s marked, upbeat theme was not originally her intention (“I never try to link tunes together or find songs that work together as a whole. It happens organically in the recording process, or not at all.”) But she does assume credit for knowing the songs she would be recording when she, her quartet and the Clayton/Hamilton Jazz Orchestra assembled for two weeks in Los Angeles’s famed Capitol Studios this spring.\n \n “I didn’t really sit down with anybody prior to recording it and say, ‘I think I want to do this.’ I knew exactly what I wanted from the get go. I started writing down song titles last summer, but a lot of these tunes I’ve had in my back pocket for years. I’ve been working on ‘How Insensitive’ for about ten years. ‘Day In, Day Out’ I started working on when I was about 24. I mean these are all tunes that finally have found their place.\n \n “Every tune has to have some sort of personal connection. But I didn’t want it all to be too upbeat – like ‘Willow Weep For Me’, which for me is more of a social comment, adds a question mark to that positive feeling.”\n \n In songs, mood and delivery, From This Moment On reveals Krall’s personal ardor for that golden era of song-making, when Frank Sinatra, Ella Fitzgerald and (especially) Nat “King” Cole were in their prime. It’s musical territory that Krall has often explored, but this album was certainly not a case of simply repeating past formulas: Krall’s A-team of support – producer Tommy LiPuma, engineer Al Schmitt and arranger/bandleader John Clayton – were on hand to ensure that inspiration was kept on an edge, unhindered by the studio environment.\n \n “I’m not exactly working with people who are going to just say, ‘Oh it’s lovely, Diana.’ We never go an automatic pilot, you know? Sometimes I feel incredibly exposed during the recording process but fortunately I have the safety net of people whom I can listen to, and agree or disagree with. There’s nobody hanging over me and saying you have to do this or that. But that doesn’t mean that there aren’t surprises and it can be an extraordinarily intense environment. The emotions can run high since people care so passionately about the music and what we are doing.”\n \n Krall – for the few still unknowing – is the sensation whose cool, heavy-lidded vocals and strikingly sensitive piano-playing has helped her transcend barriers of genre to become a popular artist of the first order who has carved herself a permanent position at the top of the jazz charts.\n \n The seeds of Krall’s crossover success are firmly rooted in her upbringing. Born in Nanaimo, Canada, to a musical family – her father is a stride-style pianist and serious record collector -- she grew up absorbing music that laid the foundation for her future growth. She attended Berklee College of Music in the early ‘80s, moved to Los Angeles where she continued her studies with the likes of bassist Ray Brown and pianist Jimmy Rowles, who convinced the young pianist to focus on her singing as well. By 1990, Krall relocated to New York City where she began performing on a regular basis with her trio. In 1993, she released her debut album on a small Canadian independent label.\n \n Thirteen years later, she can look back over a stellar career path: in ’99, signed to Verve, her career exploded when When I Look in Your Eyes won a GRAMMY© for best jazz vocal and became the first jazz disc to be nominated for Album of the Year in twenty-five years. In 2002, The Look of Love was a #1 bestseller in the US and a seven-time platinum album in Canada. 2004’s The Girl in the Other Room, was her first to focus on her own songwriting – featuring six tunes co-written with her husband – and last year’s Christmas Songs proved one of the season’s best-sellers.\n \n From This Moment On delivers Krall closer than ever to her musical aspirations and, in many ways, serves as a tribute to her heroes and mentors. One can detect her gratitude in a variety of musical moments.\n \n “There’s a couple of pieces that I put Ray Brown into – like his introduction to Count Basie’s Little Darlin’ on ‘You Can Depend On Me’ -- and a lot of [vocalist/pianist] Shirley Horn was present in ‘Come Dance With Me.’ Our treatment of ‘From This Moment On’ came together after listening to [trumpeter/composer] Kenny Dorham’s version which I really love. I hear [arranger] Billy May especially in ‘Day In Day Out.’\n \n “I have to mention Fred Astaire’s influence on ‘I Was Doing All Right’ – and in fact, all through the album. I listened to a lot of Fred with Oscar Peterson while preparing for this project, as well as watching a lot of his early movies, like Swing Time.&quot;\n \n “Do you know that great album with Duke Ellington and Frank Sinatra, where he sings ‘Poor Butterfly’? ‘ Isn’t This A Lovely Day’ is very reminiscent of that. John [Clayton] wrote that arrangement at dinner the night before we recorded it. We were all sitting at a restaurant and he’s got a pad of paper. He was laughing and having the conversation and you see the wheels turning at the same time. And I loved playing piano on that. I think that’s my favorite piano work on the whole record – that, and ‘Exactly Like You.’”\n \n Krall’s piano work and her arrangements – particularly on the album’s four quartet performances – are all standouts, as are a number of instrumental solos that she recalls with a marked fondness.\n \n “That’s Gerald Clayton on piano on the title track -- he’s an amazing piano player and I think he played the hell out of that tune. I think Jeff Clayton’s alto sax solo on ‘Isn’t This A Lovely Day’ is a masterpiece -- definitely one of the highlights of the record. And Terell Stafford played the perfect trumpet solo right after that! He walked in, nailed it in front of the whole band, and I said ‘Terell, you sound like an old man.’ He’s only in his 30s! I meant it as the best compliment.\n \n Krall is quick to point out that she is happy with everything on the album for different reasons, especially for the collaborative results. “I’m proud of tunes like ‘Exactly Like You’ specifically for every little note that [guitarist] Anthony [Wilson] plays, and simply for how the subtlety can work when we all play together, and how we all play what matters.”\n \n “Playing what matters” could well be the subtitle to From This Moment On. There’s an economy and confidence that speak to the maturity of Krall as a performer, and a recording artist. “I really settled in with this record. I think I’ve let go of trying to prove something, and I wasn’t out to overplay solos. To just settle back into the bench and play those tough tempos and keep the solos simple and melodic and beautiful, and not have to pass a poll of some kind? That’s enough.”\n \n From This Moment On is also a recording that cannot help but expose Krall’s feelings of being a wife and expectant mother. “It’s a reflection of who I am and where I am at this time. So I need to get that album out like now because that’s how I feel now. I don’t know how I’m going to feel six months down the road, so ‘Only whoop-dee-doo songs’? Yeah. Exactly.”\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "“This album coincides with a happier time in my life. I think it’s very obvious in the music. It reflects how I’m feeling now, the joy that I have in my marriage and family, and hopefully in the future.”  It had only been a few days since singer and pianist Diana Krall publicly announced that she and husband Elvis Costello were expecting their first child. Her remarks may have primarily focused on her upcoming album, but it was easy to discern the rosy glow as she discussed imminent arrivals, and how she came up with the name for one of them. ", "published": "Tue, 9 Jun 2009 22:07:57 +0000"}, "name": "From This Moment On", "artist": "Diana Krall", "url": "http://www.last.fm/music/Diana+Krall/From+This+Moment+On", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/90275227.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/90275227.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/90275227.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/90275227.jpg", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/90275227/From+This+Moment+On.jpg", "size": "mega"}], "listeners": "88713", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/diana%20krall", "name": "diana krall"}, {"url": "http://www.last.fm/tag/female%20vocalists", "name": "female vocalists"}, {"url": "http://www.last.fm/tag/vocal%20jazz", "name": "vocal jazz"}, {"url": "http://www.last.fm/tag/jazz%20vocal", "name": "jazz vocal"}]}, "releasedate": "    16 Oct 2006, 00:00", "mbid": "33ae3c5f-6f93-4521-b5c3-83f69768f4d5", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "It Could Happen To You", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/It+Could+Happen+To+You", "mbid": "1e1f5b65-a218-4b92-9c0a-7cf62955027b", "duration": "208"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Isn't This A Lovely Day?", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/+noredirect/Diana+Krall/_/Isn%27t+This+A+Lovely+Day%3F", "mbid": "", "duration": "367"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "How Insensitive", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/How+Insensitive", "mbid": "19752102-3d7d-4ce6-9d90-ef01ec3bb691", "duration": "320"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Exactly Like You", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/Exactly+Like+You", "mbid": "27ee6e85-950e-4139-a01a-5c48e398d394", "duration": "182"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "From This Moment On", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/From+This+Moment+On", "mbid": "1bff259d-589b-4640-bf7e-431ee0e8de3c", "duration": "203"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "6"}, "name": "I Was Doing All Right", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/I+Was+Doing+All+Right", "mbid": "fe2cb7d7-9d3f-4e0c-8584-7f7181e62599", "duration": "311"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "7"}, "name": "Little Girl Blue", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/Little+Girl+Blue", "mbid": "0269c946-f685-4ce1-98d5-7268bd436e25", "duration": "340"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "8"}, "name": "Day In Day Out", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/Day+In+Day+Out", "mbid": "3776b8c7-5981-4b50-ad4a-8eed9287fc4b", "duration": "239"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "9"}, "name": "Willow Weep For Me", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/Willow+Weep+For+Me", "mbid": "0076a589-ca05-4731-829e-f35fe07db09b", "duration": "338"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "10"}, "name": "Come Dance With Me", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/Come+Dance+With+Me", "mbid": "19bae535-c0f9-4607-97d8-f91c8bc30e03", "duration": "263"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "11"}, "name": "It Was A Beautiful Day In August / You Can Depend On Me", "artist": {"url": "http://www.last.fm/music/Diana+Krall", "mbid": "67d2cb7a-9ddb-4a7f-82bf-5a2d1a038e98", "name": "Diana Krall"}, "url": "http://www.last.fm/music/Diana+Krall/_/It+Was+A+Beautiful+Day+In+August+%2F+You+Can+Depend+On+Me", "mbid": "17ca020d-559b-4fc1-9382-30fe5942868c", "duration": "317"}]}, "playcount": "770606", "id": "3207447"}}