{"album": {"wiki": {"content": "Saxophone Colossus is one of Sonny Rollins' most acclaimed albums. Recorded and released in 1956, it is widely considered the masterpiece of his mid-1950s series of recordings for Prestige.\n \n There are five tracks on the album, three of which are credited to Rollins. &quot;St. Thomas&quot; is a calypso-inspired piece named after Saint Thomas in the Virgin Islands. The tune is traditional and had already been recorded by Randy Weston in 1955 under the title &quot;Fire Down There&quot;. (In the booklet provided with the boxed set, The Complete Prestige Recordings, Rollins makes it clear that it was the record company that insisted on his taking credit.) In any case, the piece has since become a jazz standard, and this is its most famous recorded version.\n \n &quot;You Don't Know What Love Is&quot; is a ballad standard by Don Raye and Gene DePaul, given a distinctively bleak treatment by Rollins. &quot;Strode Rode&quot; is an up-tempo hard bop number, notable for its staccato motif and for a brief, high-spirited duet between Rollins and Doug Watkins on bass. The tune is named after the Strode Hotel in Chicago, in tribute to the ill-fated trumpeter Freddie Webster, who died there.\n \n The second side of the original LP consists of two longer cuts, both in B flat. &quot;Moritat&quot; is another standard, a song from Bertolt Brecht and Kurt Weill's The Threepenny Opera, better known in English as &quot;Mack the Knife&quot;. The album's liner notes point out that the Brecht–Weill musical was enjoying a surge of popularity at the time of the recording. This version, full of mischief and foreboding, is probably closer to the original intent of its authors than some of the more frivolous covers recorded by other musicians. Rollins concludes the song by restating the melody followed by a short, soaring bit of ornamentation, backed by Watkins's bowed pedal tones.\n \n Finally, &quot;Blue 7&quot; is a blues, over eleven minutes long. Its main, rather disjunct melody was spontaneously composed. The performance is among Rollins' most acclaimed, and is the subject of an article by Gunther Schuller entitled &quot;Sonny Rollins and the Challenge of Thematic Improvisation&quot;. Schuller praises Rollins on &quot;Blue 7&quot; for the use of motivic development exploring and developing melodic themes throughout his three solos, so that the piece is unified, rather than being composed of unrelated ideas. Rollins also improvises using ideas and variations from the melody, which is based on the tritone interval, and strongly suggests bitonality (the melody by itself is harmonically ambiguous, simultaneously suggesting the keys of Bb and E). Also notable is Max Roach's solo, which uses a triplet rhythm figure later imitated by Rollins, again helping to give the piece a coherent feel.\n \n The original 22 June 1956 session was recorded by Rudy Van Gelder. A remastered version was issued in 1999; no additional performances were included. Another remastered version, this time by Van Gelder, was released on 21 March 2006. The album's title was devised by Prestige Records' in-house publicity director Bob Altshuler.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Saxophone Colossus is one of Sonny Rollins' most acclaimed albums. Recorded and released in 1956, it is widely considered the masterpiece of his mid-1950s series of recordings for Prestige.  There are five tracks on the album, three of which are credited to Rollins. &quot;St. Thomas&quot; is a calypso-inspired piece named after Saint Thomas in the Virgin Islands. The tune is traditional and had already been recorded by Randy Weston in 1955 under the title &quot;Fire Down There&quot;.", "published": "Sat, 7 Mar 2009 10:51:12 +0000"}, "name": "Saxophone Colossus", "artist": "Sonny Rollins", "url": "http://www.last.fm/music/Sonny+Rollins/Saxophone+Colossus", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/72361970.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/72361970.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/72361970.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/72361970.png", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/72361970/Saxophone+Colossus+folder.png", "size": "mega"}], "listeners": "145493", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/saxophone", "name": "saxophone"}, {"url": "http://www.last.fm/tag/bebop", "name": "bebop"}, {"url": "http://www.last.fm/tag/1956", "name": "1956"}, {"url": "http://www.last.fm/tag/cool%20jazz", "name": "cool jazz"}]}, "releasedate": "    5 May 2008, 00:00", "mbid": "882d4f82-e411-4ab4-a5f3-13e8a334f1db", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "St. Thomas", "artist": {"url": "http://www.last.fm/music/Sonny+Rollins", "mbid": "235c5cb3-511c-4717-8a2c-bc0fa5899318", "name": "Sonny Rollins"}, "url": "http://www.last.fm/music/Sonny+Rollins/_/St.+Thomas", "mbid": "744d82fe-8dcf-426a-8f41-63c05a0f4032", "duration": "407"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "You Don't Know What Love Is", "artist": {"url": "http://www.last.fm/music/Sonny+Rollins", "mbid": "235c5cb3-511c-4717-8a2c-bc0fa5899318", "name": "Sonny Rollins"}, "url": "http://www.last.fm/music/Sonny+Rollins/_/You+Don%27t+Know+What+Love+Is", "mbid": "894ab4fd-423b-4c16-ac47-6163a8f1e261", "duration": "391"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "Strode Rode", "artist": {"url": "http://www.last.fm/music/Sonny+Rollins", "mbid": "235c5cb3-511c-4717-8a2c-bc0fa5899318", "name": "Sonny Rollins"}, "url": "http://www.last.fm/music/Sonny+Rollins/_/Strode+Rode", "mbid": "44bd38cc-8c7d-4389-a620-1a3e9a11525c", "duration": "314"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Moritat", "artist": {"url": "http://www.last.fm/music/Sonny+Rollins", "mbid": "235c5cb3-511c-4717-8a2c-bc0fa5899318", "name": "Sonny Rollins"}, "url": "http://www.last.fm/music/Sonny+Rollins/_/Moritat", "mbid": "7864e5c7-b37f-45fb-a8f5-af97d07b613c", "duration": "605"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "5"}, "name": "Blue Seven", "artist": {"url": "http://www.last.fm/music/Sonny+Rollins", "mbid": "235c5cb3-511c-4717-8a2c-bc0fa5899318", "name": "Sonny Rollins"}, "url": "http://www.last.fm/music/Sonny+Rollins/_/Blue+Seven", "mbid": "8b369b80-46f1-4029-97dd-c884d1ba3b09", "duration": "681"}]}, "playcount": "664206", "id": "2375461"}}