{"album": {"wiki": {"content": "<strong>Head Hunters</strong> is an album by Herbie Hancock, released in 1973 on Columbia Records. The album is a key release in Hancock's career and a defining moment in the genre of <a href=\"http://www.last.fm/tag/jazz%20fusion\" class=\"bbcode_tag\" rel=\"tag\">jazz fusion</a>.\n \n <strong>Structure and release</strong>:\n Head Hunters followed a series of experimental albums by Hancock's sextet: Mwandishi (1970), Crossings (1971), and Sextant (1972), released at a time when Hancock was looking for a new direction in which to take his music:\n \n <em>    &quot;I began to feel that I had been spending so much time exploring the upper atmosphere of music and the more ethereal kind of far-out spacey stuff. Now there was this need to take some more of the earth and to feel a little more tethered; a connection to the earth....I was beginning to feel that we (the sextet) were playing this heavy kind of music, and I was tired of everything being heavy. I wanted to play something lighter.&quot; (Hancock's sleeve notes: 1997 CD reissue)</em>\n \n For the new album, Hancock assembled a new band, The Headhunters, of whom only Bennie Maupin had been a sextet member. Hancock handled all synthesizer parts himself (having previously shared these duties with Patrick Gleeson) and he decided against the use of guitar altogether, favouring instead the clavinet, one of the defining sounds on the album. The new band featured a tight rhythm and blues-oriented rhythm section, and the album has a relaxed, funky groove that gave the album an appeal to a far wider audience. Perhaps the defining moment of the jazz-fusion movement (or perhaps even the spearhead of the Jazz-funk style of the fusion genre), the album made jazz listeners out of rhythm and blues fans, and vice versa. The album mixes funk rhythms, like the busy high hats in 16th notes on the opening track &quot;Chameleon&quot;, with the jazz AABA form and extended soloing.\n \n Of the four tracks on the album &quot;Watermelon Man&quot; was the only one not written for the album. A hit from Hancock's hard bop days, originally appearing on his first album Takin' Off, it was reworked by Hancock and Mason and has an instantly recognisable intro featuring Bill Summers blowing into a beer bottle, an imitation of the hindewho, an instrument of the Mbuti Pygmies of Northeastern Zaire. The track features heavy use of African percussion. &quot;Sly&quot; was dedicated to pioneering funk musician Sly Stone, leader of Sly &amp; the Family Stone. &quot;Chameleon&quot; (the opening track) is another track with an instantly recognisable intro, the very funky bassline being played on an ARP Odyssey synth. &quot;Vein Melter&quot; is a slow-burner, predominantly featuring Hancock and Maupin, with Hancock mostly playing Fender Rhodes electric piano, but occasionally bringing in some heavily effected synth parts.\n \n Heavily edited versions of &quot;Chameleon&quot; and &quot;Vein Melter&quot; were released as a 45 rpm single.\n \n After its initial release, the album was also mixed into Quadraphonic (4-channel sound) and released by Columbia in 1974 in the vinyl and 8-track tape formats. The quad mixes features audio elements not heard in the stereo version, including a 2-second keyboard melody at the beginning of &quot;Sly&quot; that was edited out. It was released digitally on the hybrid SACD edition for the album (Columbia/Legacy CS 65123).\n \n At the time of the 1992 CD reissue it was the largest-selling jazz album of all time, and has been an inspiration not only for jazz musicians, but also to funk, soul music, jazz funk and hip hop artists.\n \n The HeadHunters band worked with Hancock on a number of other albums, including Thrust (1974), Man-Child (1975), Flood (recorded live in Japan, 1975), Secrets (1976) and Sunlight (1977), and themselves produced a couple of fine funk albums, Survival of the Fittest (1975) and Straight from the Gate (1978), the first of which was produced by Hancock and featured the big hit &quot;God Make me Funky&quot;.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Head Hunters is an album by Herbie Hancock, released in 1973 on Columbia Records. The album is a key release in Hancock's career and a defining moment in the genre of <a href=\"http://www.last.fm/tag/jazz%20fusion\" class=\"bbcode_tag\" rel=\"tag\">jazz fusion</a>.  Structure and release:\n Head Hunters followed a series of experimental albums by Hancock's sextet: Mwandishi (1970), Crossings (1971), and Sextant (1972), released at a time when Hancock was looking for a new direction in which to take his music:  ", "published": "Sun, 23 Nov 2008 14:38:07 +0000"}, "name": "Head Hunters", "artist": "Herbie Hancock", "url": "http://www.last.fm/music/Herbie+Hancock/Head+Hunters", "image": [{"#text": "http://userserve-ak.last.fm/serve/34s/89741251.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/64s/89741251.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/89741251.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/89741251.jpg", "size": "extralarge"}, {"#text": "http://userserve-ak.last.fm/serve/_/89741251/Head+Hunters+Cover.jpg", "size": "mega"}], "listeners": "235090", "toptags": {"tag": [{"url": "http://www.last.fm/tag/jazz", "name": "jazz"}, {"url": "http://www.last.fm/tag/funk", "name": "funk"}, {"url": "http://www.last.fm/tag/jazz%20fusion", "name": "jazz fusion"}, {"url": "http://www.last.fm/tag/jazz-funk", "name": "jazz-funk"}, {"url": "http://www.last.fm/tag/fusion", "name": "fusion"}]}, "releasedate": "    ", "mbid": "c37188bc-2542-449f-adff-63bb612b2474", "tracks": {"track": [{"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "1"}, "name": "Chameleon", "artist": {"url": "http://www.last.fm/music/Herbie+Hancock", "mbid": "27613b78-1b9d-4ec3-9db5-fa0743465fdd", "name": "Herbie Hancock"}, "url": "http://www.last.fm/music/Herbie+Hancock/_/Chameleon", "mbid": "5a2fbdf9-3867-4ab5-ac52-d2a4510bbcab", "duration": "623"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "2"}, "name": "Watermelon Man", "artist": {"url": "http://www.last.fm/music/Herbie+Hancock", "mbid": "27613b78-1b9d-4ec3-9db5-fa0743465fdd", "name": "Herbie Hancock"}, "url": "http://www.last.fm/music/Herbie+Hancock/_/Watermelon+Man", "mbid": "5919f6ba-60c8-4803-85c0-be7bb0c678a9", "duration": "417"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "3"}, "name": "Sly", "artist": {"url": "http://www.last.fm/music/Herbie+Hancock", "mbid": "27613b78-1b9d-4ec3-9db5-fa0743465fdd", "name": "Herbie Hancock"}, "url": "http://www.last.fm/music/Herbie+Hancock/_/Sly", "mbid": "50d22ec5-52e3-47a2-92a7-d9393c311016", "duration": "615"}, {"streamable": {"#text": "0", "fulltrack": "0"}, "@attr": {"rank": "4"}, "name": "Vein Melter", "artist": {"url": "http://www.last.fm/music/Herbie+Hancock", "mbid": "27613b78-1b9d-4ec3-9db5-fa0743465fdd", "name": "Herbie Hancock"}, "url": "http://www.last.fm/music/Herbie+Hancock/_/Vein+Melter", "mbid": "63d6c2fa-98be-4210-9861-5045085245c3", "duration": "550"}]}, "playcount": "1040999", "id": "2379343"}}