{"track": {"album": {"@attr": {"position": "2"}, "title": "Reggae Greats", "url": "http://www.last.fm/music/Lee+%22Scratch%22+Perry/Reggae+Greats", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/44652307.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/44652307.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/44652307.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/44652307.jpg", "size": "extralarge"}], "artist": "Lee \"Scratch\" Perry", "mbid": "cd02b695-e303-4732-a5be-ead521c03a41"}, "wiki": {"content": "&quot;Police &amp; Thieves&quot; is a well known reggae song first recorded in the Jamaican reggae version with the falsetto singer Junior Murvin from 1976 (Island WIP 6316) and one year later in the punk-reggae version with <a href=\"http://www.last.fm/music/The+Clash\" class=\"bbcode_artist\">The Clash</a>.\n \n The song is written by Murvin and the man who originally produced the song, Lee &quot;Scratch&quot; Perry. The studio band was jamming and Murvin was playing with words at Perry's Black Ark Studio when suddenly sound, rhythm, melody and lyrics appeared in a structured form and Perry decided to record the song the same afternoon. The next day dub-versions and versions with different lyrics were recorded. The song, about gang war and police brutality, was out on the street in a couple of days and became a big hit in Jamaica. Later on, the song proved to be a bigger sales and club hit in England than in Murvin's and Perry's native Jamaica.\n \n Junior Murvin's original version can be found on several Lee Perry compilations released or licensed by Island Records, including albums This Is Reggae Music, vol 3 (together with War Ina Babylon by Max Romeo), Reggae Greats and Lee Scratch Perry Arkology.\n \n The English punk rock band Clash's punk/reggae version appeared on their eponymous debut album. The Clash's version, which is six minutes in length, is an example of a rock band incorporating reggae into their repertoire.\n \n The song had been a rehearsal room favourite of the band. It had not originally been planned for inclusion on The Clash, but an impromptu version the band started playing during a break in a recording session, spurred the decision to finalize their own arrangement, record it, and include the finished article on their album.\n \n In the beginning of the song, Joe Strummer reinterprets the line &quot;They're going through a tight wind&quot; as a tribute to the <a href=\"http://www.last.fm/music/Ramones\" class=\"bbcode_artist\">Ramones</a>, already an established American punk band and an influence on The Clash. The lyric line appears in the Ramones' &quot;<a title=\"Ramones &ndash; Blitzkrieg Bop\" href=\"http://www.last.fm/music/Ramones/_/Blitzkrieg+Bop\" class=\"bbcode_track\">Blitzkrieg Bop</a>&quot;\n .\n Murvin's version appeared in the 1998 movie Lock, Stock and Two Smoking Barrels by Guy Ritchie. It was also covered by the group <a href=\"http://www.last.fm/music/dubversive\" class=\"bbcode_artist\">dubversive</a> in 1997 as a drum and bass song and as a reggae version the following year.\n \n The Clash version of the song also appears on the soundtrack for the Wes Anderson film, The Royal Tenenbaums, and in the Reno 911!: Miami movie where it is performed by <a href=\"http://www.last.fm/music/Dave+Grohl\" class=\"bbcode_artist\">Dave Grohl</a>, who is listed in the credits under the pseudonym &quot;Sprechen Sie Deutsch&quot;.\n \n The song is also the basis for the name of the socio-political band, <a href=\"http://www.last.fm/music/+noredirect/Police+and+Thieves\" class=\"bbcode_artist\">Police and Thieves</a>.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Police &amp; Thieves&quot; is a well known reggae song first recorded in the Jamaican reggae version with the falsetto singer Junior Murvin from 1976 (Island WIP 6316) and one year later in the punk-reggae version with <a href=\"http://www.last.fm/music/The+Clash\" class=\"bbcode_artist\">The Clash</a>.  The song is written by Murvin and the man who originally produced the song, Lee &quot;Scratch&quot; Perry. The studio band was jamming and Murvin was playing with words at Perry's Black Ark Studio when suddenly sound, rhythm, melody and lyrics appeared in a structured form and Perry decided to record the song the same afternoon.", "published": "Sun, 26 Apr 2009 18:29:24 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Police & Thieves", "artist": {"url": "http://www.last.fm/music/Junior+Murvin", "mbid": "8411d1f6-0f7a-4e9b-9745-a474780cd5b7", "name": "Junior Murvin"}, "url": "http://www.last.fm/music/Junior+Murvin/_/Police+&+Thieves", "listeners": "61066", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/roots%20reggae", "name": "roots reggae"}, {"url": "http://www.last.fm/tag/soundtrackgdchill", "name": "soundtrackgdchill"}, {"url": "http://www.last.fm/tag/dub", "name": "dub"}, {"url": "http://www.last.fm/tag/lee%20perry", "name": "lee perry"}]}, "mbid": "04c45677-de3e-47c5-b03f-a53cd4d457c4", "duration": "233000", "playcount": "163760", "id": "36888"}}