{"track": {"album": {"@attr": {"position": "1"}, "title": "Who Let The Dogs Out", "url": "http://www.last.fm/music/Baha+Men/Who+Let+The+Dogs+Out", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92606131.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92606131.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92606131.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92606131.png", "size": "extralarge"}], "artist": "Baha Men", "mbid": "6669db0a-e2fd-45e8-a09d-d9be426eb66d"}, "wiki": {"content": "&quot;Who Let the Dogs Out?&quot; is a song written and originally recorded by Anslem Douglas for Trinidad and Tobago's Carnival season of 1998. It was heard and taped on a float by hairdresser Keith from the London salon Smile, who played it to Jonathan King, who recorded it and released it under the name Fatt Jakk and his Pack of Pets. It then came to the attention of King's friend Steve Greenberg, who produced it with a group he was promoting called The Baha Men. The Baha Men covered the song and placed it in the movie Rugrats in Paris: The Movie and then released it as a single in 2000, when it became the band's first hit in the US and the UK. It reached #40 on the Billboard Hot 100 in the United States and #2 on the UK Singles Chart. It was the 4th biggest-selling single of 2000 in the UK. It was also a big hit in Australia, where it reached #1. The track went to win the Grammy for Best Dance Recording on the 2001 Grammy Awards.\n \n In a poll conducted by the Rolling Stone to identify the 20 most annoying songs, this song was ranked third.\n \n The Anslem Douglas version was played mainly in parties and dance halls across the islands of Trinidad and Tobago in 1998. After the Baha Men re-released the song, it became a ubiquitous sports anthem at stadiums and arenas throughout the world based largely on the efforts of a sports marketing company hired by the song's producer, Steve Greenberg. Pro Sports Music Marketing founder Frederic Traube created the concept of introducing and marketing the song to sports stadiums.\n The first use of the song at a sporting event was at Mississippi State University. The university's mascot is the Bulldog, and the university school first played the song during football games in the fall of 1999 using the version sung by Chuck Smooth. It was accompanied by the crowd singing along and the team performing a dance on the field called &quot;The Dawg Pound Rock&quot; just before a kickoff. Later the Southeastern Conference ruled that they could not perform the dance on the field, so the team moved it to the sidelines. Several other teams followed suit, and the song quickly became a national phenomenon.\n \n In June 2000, Gregg Greene, then Director of Promotions for the Seattle Mariners, was the first to play the Baha Men's version of &quot;Who Let the Dogs Out&quot; at a Major League Baseball game. He debuted the tune as a joke for the team's backup catcher, Joe Oliver. Two days later, shortstop Alex Rodriguez requested the ditty for his batter introduction music and the song quickly became the Mariners team anthem. The Baha Men played live at Safeco Field during a Mariners game in September of 2000. The New York Mets, however, claimed that they were the first MLB team to adopt the song (ESPN.com later commented, &quot;This is a little like scientists arguing over who discovered a deadly virus&quot;). The Baha Men recorded a version of the song that changed the chorus to &quot;Who let the Mets out?&quot; and all the lyrics to reflect the team and its players, which was played at Shea Stadium throughout the Mets' 2000 postseason run, including a live performance on the Shea Stadium field before Game 4 of the 2000 World Series against the New York Yankees. The song was written by David Brody of Z100 New York and recorded by the Baha Men initially for Z100. Brody then gave the song to the Mets to play at Shea. Brody has also written songs for the 2006 and 2007 Mets. Richard Hidalgo used the original song as his entrance music while playing for the Houston Astros. The song is the theme song for Monster Mutt(Monster Truck) while he is doing his freestyle run as he runs on the Monster Jam circuit.\n \n The song was also used by the Baltimore Ravens football team on their run to the Super Bowl in the 2000 season.\n \n In the NRL, the premier rugby league competition in the world, the Canterbury Bulldogs often play this song at home games.\n \n Finnish Ice-Hockey team Espoo Blues uses the song as their goalsong.\n \n New York - Penn League baseball team the Batavia Muckdogs also use the song to this day. It was also a stadium anthem during the league's Mahoning Valley Scrappers's McNamara Division championship run in 2000.\n \n The song is used at games for the Arizona Sundogs, a minor league hockey team located in Prescott Valley, Arizona. Their mascot is a dog named Bernie.\n \n The song is also used at the beginning of each of the periods at the American Hockey League's Hamilton Bulldogs games. Their mascot is named Bruiser.\n \n This catch phrase may have derived from &quot;Who let the dogs loose?&quot; rapped in the same rhythm in Gillette's song &quot;Bad Boys&quot; on her 1994 album &quot;On the Attack&quot;.\n \n In the UK, the song was quickly appropriated by Liverpool supporters under then-manager Gerard Houllier. Regular chants of 'Hou led the reds out' by Liverpool fans (a reference to Liverpool's cup treble in 2001) were followed soon after by opposition fans' chants of 'Hou had a heart attack' (a reference to Houllier's illness in October 2001). The song is played after every goal which Dougie Freedman scores for Crystal Palace F.C. at Selhurst Park, with fans singing &quot;Who let the Doug out? Who? Who?&quot; with reference to him. Similarly, Chelsea F.C. fans sing &quot;Who let the Drog out? Who? Who?&quot;, in reference to Didier Drogba. Celtic F.C. occasionally play the song before the start of the second half, with the Celtic fans singing &quot;Who let the Tims out?&quot;\n \n In the 2000-2001 NHL season, the Vancouver Canucks used a remix of this song as their goal song.\n \n     * The song was used in Rugrats in Paris: The Movie.\n     * The song has been used in the film, Open Season 2.\n     * In WarioWare Tooned episode &quot;It's a Perfect Day in Diamond City&quot;, during the street party, Dr. Crygor can be heard singing &quot;Who Let the 9-Volt Out?&quot; instead of &quot;Who Let the Dogs Out?&quot;.\n     * In South Park episode, &quot;About Last Night...&quot;, Stan's dad, Randy Marsh, sings &quot;Who Let the Obama Out?&quot; during the night street party for Obama.\n     * In an episode of Super Mario Bros., Mario starts to chase a Yoshi, the song can be heard during Mario's cat chase.\n     * The song has been used in the 2006 film, The Shaggy Dog.\n     * The song was uses in the 2009 film, The Hangover.\n     * In an episode of The Simpsons, Homer can be heard singing &quot;Who Let the Dogs Out?&quot; along the radio on his car.\n     * In WarioWare, Inc. episode, Dr. Crygor can be heard singing along the radio on his van.\n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Who Let the Dogs Out?&quot; is a song written and originally recorded by Anslem Douglas for Trinidad and Tobago's Carnival season of 1998. It was heard and taped on a float by hairdresser Keith from the London salon Smile, who played it to Jonathan King, who recorded it and released it under the name Fatt Jakk and his Pack of Pets. It then came to the attention of King's friend Steve Greenberg, who produced it with a group he was promoting called The Baha Men.", "published": "Wed, 27 May 2009 18:06:30 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Who Let The Dogs Out", "artist": {"url": "http://www.last.fm/music/Baha+Men", "mbid": "00f82af1-6537-4d4b-9e03-103fffe19999", "name": "Baha Men"}, "url": "http://www.last.fm/music/Baha+Men/_/Who+Let+The+Dogs+Out", "listeners": "124075", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/dancehall", "name": "dancehall"}, {"url": "http://www.last.fm/tag/fun", "name": "fun"}, {"url": "http://www.last.fm/tag/soca", "name": "soca"}]}, "mbid": "06d1078c-823a-407f-a840-93268a5416de", "duration": "211000", "playcount": "448655", "id": "1038254"}}