{"track": {"album": {"@attr": {"position": "3"}, "title": "Kiss Presents The Mixtape", "url": "http://www.last.fm/music/Wayne+Wonder/Kiss+Presents+The+Mixtape", "image": [{"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "small"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "medium"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "large"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "extralarge"}], "artist": "Wayne Wonder", "mbid": ""}, "wiki": {"content": "&quot;Temperature&quot; is a reggae–dancehall song written by Sean Paul for his third album The Trinity (2005). The song reached #1 on the U.S. Billboard Hot 100, Sean Paul's third U.S. #1 along with &quot;Get Busy&quot; and &quot;Baby Boy&quot; with Beyonce.\n \n &quot;Temperature&quot; was the (second US single) from Sean Paul's The Trinity album. The song was produced by Rohan &quot;Snowcone&quot; Fuller and received a positive reception from music critics. The song was released as the second U.S. single in the first quarter of 2006 and reached number one in the United States on the Billboard Hot 100 and became Paul's third number one hit single. It reached the top ten in Canada and France and the top twenty in the United Kingdom, peaking at #11 there. In Australia, &quot;Temperature&quot; debuted at number nineteen but quickly found its way to number five the following weeks.\n \n &quot;Temperature&quot; became Sean Paul's biggest hit single in the US. In Australia it became a smash hit, with Sean Paul making interview appearances on the Paul Celoni Radio Show, and shows alike. Even though it only spent one week at #1, as opposed to &quot;Get Busy&quot; and its three weeks on top, &quot;Temperature&quot; showed extreme longevity on The Billboard Hot 100 spending 17 weeks in the top 10. Until Nelly Furtado and Timbaland's &quot;Promiscuous,&quot;this was the longest run in the top ten for a single in 2006. On top of that it became Sean Paul's first single to sell an excess of one million digital downloads, earning platinum certification.\n \n The song uses the dancehall riddim &quot;Applause&quot;. It was also used in the game Dance Dance Revolution SuperNOVA 2. It can be heard in the 2007 film, Norbit.\n \n Officially, there are two versions of the song. Only the use of the riddim makes both versions different.\n \n In 2008 the media reported a story regarding Stacey Gayle of New York City who experienced seizures as a result of hearing the song.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Temperature&quot; is a reggae–dancehall song written by Sean Paul for his third album The Trinity (2005). The song reached #1 on the U.S. Billboard Hot 100, Sean Paul's third U.S. #1 along with &quot;Get Busy&quot; and &quot;Baby Boy&quot; with Beyonce.  &quot;Temperature&quot; was the (second US single) from Sean Paul's The Trinity album. The song was produced by Rohan &quot;Snowcone&quot; Fuller and received a positive reception from music critics. The song was released as the second U.S.", "published": "Mon, 23 Aug 2010 02:08:15 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Temperature", "artist": {"url": "http://www.last.fm/music/Sean+Paul", "mbid": "3f5b487a-ea74-46bb-92e8-3c8ef71e159f", "name": "Sean Paul"}, "url": "http://www.last.fm/music/Sean+Paul/_/Temperature", "listeners": "324229", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/dancehall", "name": "dancehall"}, {"url": "http://www.last.fm/tag/sean%20paul", "name": "sean paul"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}, {"url": "http://www.last.fm/tag/dance", "name": "dance"}]}, "mbid": "088d6735-f5b0-4370-a996-f8560dfac939", "duration": "216000", "playcount": "1491840", "id": "24878989"}}