{"track": {"album": {"@attr": {"position": "1"}, "title": "Israelites: The Best Of Desmond Dekker", "url": "http://www.last.fm/music/Desmond+Dekker/Israelites:+The+Best+Of+Desmond+Dekker", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/44715029.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/44715029.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/44715029.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/44715029.jpg", "size": "extralarge"}], "artist": "Desmond Dekker", "mbid": ""}, "wiki": {"content": "&quot;Israelites&quot; is a song written by Desmond Dekker and Leslie Kong that became a hit for Dekker's group, Desmond Dekker &amp; The Aces. Although few could understand all the lyrics, the single was the first UK reggae number one and the first to crack the United States Top Ten. Lyrically paralleling ancient travails with the overwhelming toil of modern-day poverty, Dekker composed a &quot;timeless masterpiece that knew no boundaries&quot;.\n \n <strong>Song</strong>\n \n It was one of the first reggae songs to become an international hit, despite Dekker's strong Jamaican accent which made his lyrics difficult to understand for audiences outside Jamaica. In 1969 it reached the Top Ten in the United States, peaking at #9 on the Billboard Hot 100 singles chart. It hit number one in the United Kingdom,[4] Netherlands, Jamaica, South Africa, Canada, Sweden and West Germany. The song came almost two years after Dekker first made his mark with the rude boy song, &quot;007 (Shanty Town)&quot;.\n \n &quot;Israelites&quot; brought a Jamaican beat to the British pop fans for the first time since <a href=\"http://www.last.fm/music/Millie\" class=\"bbcode_artist\">Millie</a>'s number two hit &quot;<a title=\"Millie &ndash; My Boy Lollipop\" href=\"http://www.last.fm/music/Millie/_/My+Boy+Lollipop\" class=\"bbcode_track\">My Boy Lollipop</a>&quot;. But 1969 was the right time for reggae to make a breakthrough in the United Kingdom. The Beatles, as always the trendsetters back then, had recorded their own reggae-influenced song, &quot;Ob-La-Di, Ob-La-Da&quot;, which the pop group Marmalade subsequently took to number one. The disc was released in the UK in March 1969 and was number one for two weeks, selling over 250,000 copies. A global million sales was reported in June 1969.\n \n Years later Dekker explained how &quot;Israelites&quot; was written. &quot;It all happened so quickly. I didn't write that song sitting around a piano or playing a guitar. I was walking in the park, eating corn. I heard a couple arguing about money. She was saying she needed money and he was saying the work he was doing was not giving him enough. I relate to those things and began to sing a little song - 'You get up in the morning and you slaving for bread.' By the time I got home it was complete.&quot;\n \n Desmond Dekker had two more UK Top Ten hits over the next year, &quot;It Miek&quot; and his cover of <a href=\"http://www.last.fm/music/Jimmy+Cliff\" class=\"bbcode_artist\">Jimmy Cliff</a>'s song, &quot;You Can Get It If You Really Want&quot;.\n \n Dekker recorded on the Pyramid record label, and when its catalogue was acquired by Cactus Records in 1975, &quot;Israelites&quot; was re-issued. The song again reached a Top Ten position in the United Kingdom a little over six years after the original release. Dekker re-recorded the song later in the decade, and almost accomplished the same feat in Belgium, where it just missed the Top Ten.\n \n <strong>Lyrics</strong>\n \n &quot;Get up in the morning / Slaving for bread sir / So that every mouth can be fed / Oh, oh, the Israelites&quot;. So begins one of the most seminal songs ever released by a Jamaican artist. The impact of &quot;The Israelites&quot; can never be overstated. It was the first of the island's releases in history to achieve an international breakthrough, the first to ever top the British chart, and the first to break into the U.S. market, where it soared into the Top Ten.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Israelites&quot; is a song written by Desmond Dekker and Leslie Kong that became a hit for Dekker's group, Desmond Dekker &amp; The Aces. Although few could understand all the lyrics, the single was the first UK reggae number one and the first to crack the United States Top Ten. Lyrically paralleling ancient travails with the overwhelming toil of modern-day poverty, Dekker composed a &quot;timeless masterpiece that knew no boundaries&quot;.  Song  ", "published": "Sat, 6 Jun 2009 08:53:38 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Israelites", "artist": {"url": "http://www.last.fm/music/Desmond+Dekker+&+The+Aces", "mbid": "ba971bf0-8316-4d0d-820b-57f4882c497f", "name": "Desmond Dekker & The Aces"}, "url": "http://www.last.fm/music/Desmond+Dekker+&+The+Aces/_/Israelites", "listeners": "66723", "comments": ["OK, this is simply a classic...and Jimmy Cliff? I think I love him most from this era, (I KNOW this is Desmond Dekker-or \"Dekkar\" as it says on my old Trojan \"This Is...\" LP (which this track isn't on...) BUT, I must recommend for those of you who like a laugh, the video called \"A Collection Of Misheard Lyrics\", on Youtube, by \"Debz\". Really funny, my current favourite: \"Oh I can't forget the semen on your face as you were leaving...\", yeah, Nilson. Now, who seh more cut? Go Deh! (oh, this is a Ska station, apologies, we're not quite there yet in the great JA musical story). Love It!", "About time lastfm, added this ages ago! Love this song!!♥", "my ears are alight????", "love dat bassline", "Slow solo jam to this everytime ;)", "I'll never forget... man, I was island hopping in the Antillies. Sitting alone by myself in a shanty bar drinking Carrib when this came across the radio. Damn strait, I'm the only white man skanking and singing every word. Love it!", "GREAT:)", "long time music love it you dont hear good music like this anymore", "YEP (2)", "Drugstore Cowboys is how I found about this song. I was watching that movie with my dad when I was 13, and when I heard it, I thought \"Holy shit, that song is awesome!\" It's been one of my very favorites ever since. I don't really remember the movie much at all, but this song left quite an impression.", "just watched drugstore cowboy today, forgot this song was in it", "YEP", ":D <3 Thiiiissssss", "do like", "had the pleasure to see him live in the old days! great concert (maybe the best of all i`ve ever seen)", "HERO!!!", "such a powerful song with a catchy beat.  love this song.", "Love it!!!", "true~~~CLASSIC~~~ that made its mark early on and still going strong over 4 decades later", ".......Darling Cheese Head I was yards too greasy......"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/ska", "name": "ska"}, {"url": "http://www.last.fm/tag/rocksteady", "name": "rocksteady"}, {"url": "http://www.last.fm/tag/60s", "name": "60s"}, {"url": "http://www.last.fm/tag/roots%20reggae", "name": "roots reggae"}]}, "mbid": "31017e48-ed46-4bdd-995c-dda392185da8", "duration": "156000", "playcount": "194972", "id": "2914427"}}