{"track": {"album": {"@attr": {"position": "5"}, "title": "Sublime", "url": "http://www.last.fm/music/Sublime/Sublime", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/81149223.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/81149223.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/81149223.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/81149223.png", "size": "extralarge"}], "artist": "Sublime", "mbid": "89d23e67-eb40-4ce6-89d2-32a42dc26363"}, "wiki": {"content": "Song about the Los Angeles riots of 1992.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Song about the Los Angeles riots of 1992.", "published": "Wed, 18 Jan 2012 00:15:57 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "April 29, 1992 (Miami)", "artist": {"url": "http://www.last.fm/music/Sublime", "mbid": "0545e834-eca1-471d-b929-89d575904aaa", "name": "Sublime"}, "url": "http://www.last.fm/music/Sublime/_/April+29,+1992+(Miami)", "listeners": "168215", "comments": [":) <3 <3", "♥❤♥", "❤", "From Alex_babe14: \"HAHAHA Brad (that \"junkie\"), did so much for music and accomplished more in his 28 years of life than you ever will. Show some respect.\" Like he did for his child? Nice work Brad (\"that junkie\")", "Wow 20 years since that day. Since I live between LA and Long Beach, my mom and dad were told to go home that day, and when my dad was working that day he told me when he was delivering soda in Long Beach a group of blacks were looking at him probably thinking of stealing his product, and a store owner told him it's best if he got out of there.", "20 years since. Brad was an asshole and he's actually speaking of what he did during the riots.", "RoyalFur \r\nRiot in DC -FUCK OBAMA[2] \r\n\r\nhahahahaha", "I bet that the liquor store and music shop were independently-owned businesses....", "The Los Angeles riots were crazy I guess. I was too young to really remember. You should read about it, whoever you are: http://en.wikipedia.org/wiki/1992_Los_Angeles_riots. Also that's really interesting @xgreenxcloverx, thanks for sharing.", "I remember when that happen..I was living in L.A. at the time..What a disaster that was...", "I've been listening to this cd pretty regularly since the late-90's and I just now noticed a second vocal track during the riot shoutouts at the end. Around 3:15 Brad shouts \"*something* Michigan.\" It sounds like he says \"Northern Michigan\" but what the hell ever happened there besides richfolk vacationing? Detroit had some serious riots in 1943 and 1967, so maybe he mentions D-town and I just can't decipher it. Either way, Sublime is ear-candy.", "I had always wondered why he said \"April 26 1992.\" That is the date of my 3rd birthday. :D", "One of my favorite songs of theirs, as its highly underrated, should be top 5 of their collection easy with more airplay.", "never heard this track before, but like the fact the names on my birthday but 2 days before i war born xD", "let it burn....let it burn...", "Riot in DC -FUCK OBAMA[2]", "Wanna let it burn!", "This is  a great track - love the sound of it...", "\"i love sublime, but i always thought it was funny/hypocritical how they simultaneously preach riots/stealing/arson/murder in one song & then in another they'll say 'don't start a riot' and preach love and the golden rule. whatever \"\n\nyou obviously don't understand the song. he's not singing about how awesome it is to start a riot, hes simply explaining what happened as if he were a part of it", "From wikipedia: The official title of the song references the date April 29, 1992 (of which news spread throughout the United States following the acquittal of four police officers accused in the videotaped beating of Rodney King) however the lyric is sung as, \"April 26, 1992.\"  It has been said this was a mistake, but the take was strong enough the band kept it."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/ska", "name": "ska"}, {"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/rock", "name": "rock"}, {"url": "http://www.last.fm/tag/90s", "name": "90s"}, {"url": "http://www.last.fm/tag/alternative", "name": "alternative"}]}, "mbid": "417f494b-f7dc-432f-a21e-9b07bbb4654a", "duration": "233000", "playcount": "816691", "id": "1026661"}}