{"track": {"album": {"@attr": {"position": "12"}, "title": "Legend", "url": "http://www.last.fm/music/Bob+Marley+&+The+Wailers/Legend", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/88141215.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/88141215.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/88141215.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/88141215.png", "size": "extralarge"}], "artist": "Bob Marley & The Wailers", "mbid": ""}, "wiki": {"content": "&quot;Redemption Song&quot; is a song by Bob Marley. It is the final track on Bob Marley &amp; the Wailers' ninth album, Uprising, produced by Chris Blackwell and released by Island Records. The song is considered one of Marley's seminal works, with some key lyrics derived from a speech given by the Pan-Africanist orator Marcus Garvey.\n \n At the time he wrote the song, circa 1979, Bob Marley had been diagnosed with the cancer that later was to take his life. According to Rita Marley, &quot;he was already secretly in a lot of pain and dealt with his own mortality, a feature that is clearly apparent in the album, particularly in this song&quot;.\n \n Unlike most of Bob Marley's tracks, it is strictly a solo acoustic recording, consisting of Marley singing and playing an acoustic guitar, without accompaniment. In subsequent live performances, however, a full band was used. A full band rendition of &quot;Redemption Song&quot; was made available as a bonus track on the 2001 reissue of Uprising, as well as featuring on the 2001 compilation One Love: The Very Best of Bob Marley &amp; the Wailers. However, the solo performance remains the take most familiar to listeners.\n \n In 2004, Rolling Stone placed the song at #66 among The 500 Greatest Songs of All Time. In 2010, the New Statesman listed it as one of the Top 20 Political Songs.\n \n \n Personnel\n \n Bob Marley – vocals, acoustic guitar, production\n \n     With Bob accompanying himself on Guitar, &quot;Redemption Song&quot; was unlike anything he had ever recorded: an acoustic ballad, without any hint of reggae rhythm. In message and sound it recalled Bob Dylan. Biographer Timothy White called it an 'acoustic spiritual' and another biographer, Stephen Davis, pointed out the song was a 'total departure', a deeply personal verse sung to the bright-sounding acoustic strumming of Bob's Ovation Adamis guitar.\n     — James Henke, author of Marley Legend\n \n \n Meaning and social impact\n \n The song urges listeners to &quot;Emancipate yourself from mental slavery,&quot; because &quot;None but ourselves can free our minds&quot;. These lines were taken from a speech given by Marcus Garvey in Nova Scotia during October 1937 and published in his Black Man magazine:\n \n     We are going to emancipate ourselves from mental slavery because whilst others might free the body, none but ourselves can free the mind. Mind is your only ruler, sovereign. The man who is not able to develop and use his mind is bound to be the slave of the other man who uses his mind ...\n \n In 2009, Jamaican poet and broadcaster Mutabaruka chose &quot;Redemption Song&quot; as the most influential recording in Jamaican music history.\n \n \n Covers\n \n     * Michael McDonald made this song his own on his 2008 album &quot;Soul Speak&quot;.\n     * Manfred Mann's Earth Band covered the song on their 1983 album Somewhere in Afrika.\n     * Jackson Browne performed an acoustic version at the 1995 opening of the Rock and Roll Hall of Fame that was released on the all-star album Concert for the Rock and Roll Hall of Fame\n     * English R&amp;B girl group Eternal covered the song on their 1995 album Power of a Woman.\n     * Life Of Agony included an acoustic version on limited editions of their 1995 album Ugly.\n     * Punk rock band No Use For A Name recorded a cover for their 1995 album Leche Con Carne.\n     * A rare cover recorded by Stevie Wonder was included on his 1996 compilation Stevie Wonder - Song Review: Greatest Hits.\n     * US-based duo Moodswings included a cover of the song on their 1997 release Psychedelicatessen.\n     * Sinéad O'Connor performed this song live during her 1997 tour. A recording of this was used as B-side on the This Is a Rebel Song CD single.\n     * Sweet Honey in the Rock performed an a capella version of it on their 1998 album Twenty-Five\n     * Seggae band Baster recorded a version for their album Raskok in 2001.[10]\n     * Irish folk music band The Chieftains recorded a cover with Bob Marley's son, Ziggy Marley, on their 2002 album The Wide World Over: A 40 Year Celebration.\n     * Joe Strummer, formerly of The Clash, recorded a version on his last album Streetcore not long before his death in 2002. The track featured producer Rick Rubin on melodica and piano. Rubin also produced a version with Strummer and Johnny Cash for Cash's posthumous box set, Unearthed.\n     * New Zealand reggae band Katchafire (initially a Bob Marley tribute band) included a cover of Redemption song on their 2003 debut album, Revival.\n     * A cover by Canadian artist Chantal Kreviazuk was included on the 2003 compilation Peace Songs.\n     * Ethiopian-American neo-soul artist Wayna recorded a version for her 2004 album 2004.\n     * Serbian rock band Bajaga i Instruktori recorded a Serbian language cover of the song, titled &quot;Pesma slobode&quot;, with guest appearance by pop singer Bebi Dol, releasing it on their 2005 album Šou počinje u ponoć.[11]\n     * Danish band Outlandish recorded a version and included it in the deluxe version of their 2005 album Closer Than Veins.\n     * In 2009, Angelique Kidjo released a version of the song on the compilation album Oh Happy Day: An All-Star Music Celebration.[12]\n     * The song was a charity cover song by singer Rihanna. It was released for the Hope For Haiti Now campaign in January 2010.\n     * Aly Michalka and Ben Cotten performed their version of this song on an episode of Hellcats (Season 1 Episode 15), premiered in 2010.\n     * Chris Cornell has covered &quot;Redemption Song&quot; acoustically.\n \n \n \n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Redemption Song&quot; is a song by Bob Marley. It is the final track on Bob Marley &amp; the Wailers' ninth album, Uprising, produced by Chris Blackwell and released by Island Records. The song is considered one of Marley's seminal works, with some key lyrics derived from a speech given by the Pan-Africanist orator Marcus Garvey.  At the time he wrote the song, circa 1979, Bob Marley had been diagnosed with the cancer that later was to take his life.", "published": "Thu, 12 Jan 2012 00:31:36 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Redemption Song", "artist": {"url": "http://www.last.fm/music/Bob+Marley+&+The+Wailers", "mbid": "92999875-b86e-40df-be98-18b3fdd3d285", "name": "Bob Marley & The Wailers"}, "url": "http://www.last.fm/music/Bob+Marley+&+The+Wailers/_/Redemption+Song", "listeners": "368272", "comments": ["Man this song hits me. It almost makes me cry. My favorite part is \"Emancipate yourself from mental slavery, none but ourselves can free our minds.\" So powerful and beautiful.   [2]\r\n\r\nI've always found it poignant that he wrote the song at the end of his oh too short life, when he knew he had cancer.  It's a simple, moving farewell.", "So moving and such emotional words - thanks Bob for a classic in every sense :-)", "Man this song hits me. It almost makes me cry. My favorite part is \"Emancipate yourself from mental slavery, none but ourselves can free our minds.\" So powerful and beautiful.", "so so good ~ LEGENDman was most defintely one of the most influential artists if ALLTime", "RIP Bob....  :(", "None but ourselves can free our minds....", "favorite tune, says a lot", "MY FAVORITE MALE ARTIST!!!!!!!!!", "OUR TRUE HISTORY", "Deeply disturbed by @kingsprayball's avatar haha", "Great song, but I find it quite difficult to listen to. So moving.", "http://www.youtube.com/watch?v=MnJgIq48C9k&feature=plcp", "This will be the song we sing as we toil in the asteroid fields when our alien overlords enslave us.", "NESTA~!", "Redemtion............we all have uor version...", "changed the course of history.... maybe", "changed the course of my life... literally.", "PROPPER BOB", "I once listened to this song for 8 hours straight...\nwhy on earth didn't I had last fm back then? (I guess it didn't even existed back then but what the hell..) \none of the best songs ever written... I need to plan a day like that once again..", "Emancipate yourselves from mental slavery..."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/bob%20marley", "name": "bob marley"}, {"url": "http://www.last.fm/tag/acoustic", "name": "acoustic"}, {"url": "http://www.last.fm/tag/roots%20reggae", "name": "roots reggae"}, {"url": "http://www.last.fm/tag/jamaican", "name": "jamaican"}]}, "mbid": "5b3cdf20-73c5-4fa1-8d66-c8c54eb0bae9", "duration": "228000", "playcount": "1601851", "id": "2813737"}}