{"track": {"album": {"@attr": {"position": "10"}, "title": "Hot Shot", "url": "http://www.last.fm/music/Shaggy/Hot+Shot", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/56636517.png", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/56636517.png", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/56636517.png", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/56636517.png", "size": "extralarge"}], "artist": "Shaggy", "mbid": "89d58ec8-ece2-36ce-95de-b3216f096438"}, "wiki": {"content": "&quot;It Wasn't Me&quot; is a 2000 number one hit song by reggae artist Shaggy, featuring Ricardo &quot;RikRok&quot; Ducent. It achieved a huge success in many countries, topping the charts in the US, France, UK, the Netherlands, Australia and Ireland.\n \n The song was originally never intended to be released as a single, MCA Records wanted &quot;Dance and Shout&quot; to be the first single released from the Hot Shot album and didn't offer other tracks to DJs. Hawaiian DJ Pablo Sato downloaded the album from &quot;a Napster-like MP3 site he won’t name&quot; and discovered it &quot;was the album’s standout cut.&quot; He played the song on the radio the next day. &quot;The phone lines lit up right away. Within a couple of days, it was our number-one requested song.&quot;\n \n The lyrics depict one man (Rikrok) asking his friend (Shaggy) what to do after his girlfriend caught him with another woman. Shaggy's advice is to deny everything with the phrase &quot;It wasn't me&quot;, despite all evidence to the contrary.\n \n Two versions of the song and video exist: the radio and television edit version replace the lyric &quot;Picture this; we were both butt-naked banging on the bathroom floor&quot; with &quot;Picture this; we were both caught making love on the bathroom floor.&quot;\n \n The song is particularly famous on the Case Western Reserve University campus for being played excessive amounts of times on the jukebox in the Leutner Commons Cafe.\n \n \n \n The song was Shaggy's first number-one hit in the U.S., and the follow-up, &quot;Angel,&quot; also reached number one. The single also reached number one in the UK Singles Chart on 4 March 2001, making the song a transatlantic chart topper. It also reached number one in Australia on April 1, 2001. It is also the 4th biggest selling single of the 21st century in the United Kingdom. Prior to this the song reached number 31 on import sales in the UK before its release.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;It Wasn't Me&quot; is a 2000 number one hit song by reggae artist Shaggy, featuring Ricardo &quot;RikRok&quot; Ducent. It achieved a huge success in many countries, topping the charts in the US, France, UK, the Netherlands, Australia and Ireland.  The song was originally never intended to be released as a single, MCA Records wanted &quot;Dance and Shout&quot; to be the first single released from the Hot Shot album and didn't offer other tracks to DJs. Hawaiian DJ Pablo Sato downloaded the album from &quot;a Napster-like MP3 site he won’t name&quot; and discovered it &quot;was the album’s standout cut.", "published": "Sat, 1 Jun 2013 13:05:05 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "It Wasn't Me", "artist": {"url": "http://www.last.fm/music/Shaggy", "mbid": "b97c5aad-078c-4a88-a6ff-42251bb80f26", "name": "Shaggy"}, "url": "http://www.last.fm/music/Shaggy/_/It+Wasn%27t+Me", "listeners": "251704", "comments": ["love it when this song is blasted in a bar, it's so fun to act like i know the words. how could i forget that i had given her an extra key, all this time she was standing there she never took her eyes off me, OOHUMISSAMASSAVILLA, JUSAONAWEAKNESSONAPILLA", "I lost my virginaty to this album..", ":-DD", "It wasnt me never", "★★★super song★★★", "My family LOVES this song every friday u hear this song (it wasn't me) lol", "Gotta be quick on ya mousey legs>>>>>>>>I'm off hehehehe go Shaggy run!!!! :-)", "\"I'm a spanish speaker and I think this is the first time after many many years that I pay attention to the lyrics of this song. Incredible! This guy does not value what he has. \" - I love this comment, Shaggy morality :)", "i love this song:)", "i love this song:)", "zajebista wersia to jest to", "it was me", "http://www.youtube.com/watch?v=DxdvSAYm9d0", "it wasn't me''''''''''';;;;;.", "i always take the shaggy amendment.......it wasn't me", "i love that he is he telles u everything!!!! nvr gets tired tho.", "PLEASE DON'T READ THIS. YOU WILL BE KISSED ON THE NEAREST POSSIBLE FRIDAY BY THE LOVE OF YOUR LIFE.TOMORROW WILL BE THE BEST DAY OF YOUR LIFE. NOW YOU'VE STARTED READING THIS. DON'T STOP. THIS IS SO FREAKY. 1. say your name 10 times 2. say your mom's name 5 times 3. say your crushes name 3 times 4. paste this to 4 other songs. if you do this, your crush will kiss you on the nearest Friday. but if you read this and do not paste this, then you will have very bad luck. SEND THIS TO 5 SONGS IN 143 MINUTES. WHEN YOU'RE DONE PRESS F6 AND YOUR CRUSH'S NAME WILL APPEAR IN BIG LETTERS ON THE SCREEN. THIS IS SO FREAKY BECAUSE IT ACTUALLY WORK", "hi my name is matt i enjoy cheeseburgers and rollerblading", "hi my name is lilie im single i live in miami", "I'm a spanish speaker and I think this is the first time after many many years that I pay attention to the lyrics of this song. Incredible! This guy does not value what he has."], "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/shaggy", "name": "shaggy"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/rnb", "name": "rnb"}, {"url": "http://www.last.fm/tag/hip-hop", "name": "hip-hop"}]}, "mbid": "", "duration": "228000", "playcount": "966463", "id": "1022933"}}