{"track": {"album": {"@attr": {"position": "1"}, "title": "Dancehall 101 - Vol. 3", "url": "http://www.last.fm/music/Various/Dancehall+101+-+Vol.+3", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/92178565.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/92178565.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/92178565.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/92178565.jpg", "size": "extralarge"}], "artist": "Various", "mbid": ""}, "wiki": {"content": "&quot;Pass the Dutchie&quot; was a song recorded by the British group Musical Youth from their 1982 album The Youth of Today. It was a major hit, holding the number one position on the UK singles charts for three weeks in September and October 1982.\n \n  The song was a cover version of the song &quot;Pass the Koutchie&quot; by The Mighty Diamonds, which deals with the recreational use of cannabis, &quot;koutchie&quot; being slang for a cannabis pipe. For the cover version, the song's title was bowdlerized to &quot;Pass the Dutchie&quot;, and all obvious drug references were removed from the lyrics; e. g., when the original croons &quot;How does it feel when you got no herb?&quot;, the cover version refers to &quot;food&quot; instead. (The term &quot;dutchie&quot; has itself become a drug reference; it refers to a blunt rolled in a wrap from a Dutch Masters cigar.) &quot;Dutchie&quot; was slang at the time for &quot;cooking pot&quot; as in cookware. However, it doesn't take much imagination to figure out what they were trying to say.\n \n The song was first championed by radio DJ Zach Diezel and became an instant hit when it was picked up by MCA Records in September 1982. \n \n It debuted at #26 on the chart and rose to #1 the following week. In February of the following year, it reached #10 on the Billboard Hot 100 singles chart in the USA. \n \n The song also scored a top 5 success in the Norwegian chart, eventually selling over 4 million copies worldwide.\n \n  The video, shot partly on the banks of the River Thames in London, across from the Palace of Westminster, was one of the first by black artists to get airplay on MTV.\n \n \n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Pass the Dutchie&quot; was a song recorded by the British group Musical Youth from their 1982 album The Youth of Today. It was a major hit, holding the number one position on the UK singles charts for three weeks in September and October 1982.   The song was a cover version of the song &quot;Pass the Koutchie&quot; by The Mighty Diamonds, which deals with the recreational use of cannabis, &quot;koutchie&quot; being slang for a cannabis pipe.", "published": "Sat, 16 Apr 2011 19:55:50 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Pass the Dutchie", "artist": {"url": "http://www.last.fm/music/Musical+Youth", "mbid": "1a3e7a10-72ed-4591-a363-c1e3bc92fc09", "name": "Musical Youth"}, "url": "http://www.last.fm/music/Musical+Youth/_/Pass+the+Dutchie", "listeners": "76803", "comments": ["Groovy.", "a cover version of two songs: \"Gimme the Music\" by U Brown, and \"Pass the Kouchie\" by The Mighty Diamonds.  Still pretty great.", "21 Gun Salute ....... This is the Sh#@ I grew up listening ...... Nuff Respekkkkkkk !!!", "These guys kick the shit out of the Jackson 5 IMHO", "i very love this riddim and the voice..", "I see an attempt of a new Jackson 5 here...", "how does it feel when you got no food..", "Great memories of my childhood.", "pass the dutchie pan on the left hand side", "MUSICAL YOUTH 'Pass The Dutchie' will headline a show at New Cross Inn in London NEXT SATURDAY, 8th September! Supporting them will be...CHAINSKA BRASSICA + ONE JAH + One more support to be announced. Tickets are £10 in advance: www.newcrossinn.com/?p=2&id=549 Facebook event: www.facebook.com/events/302277133193658/", "Неплохо так!))", "You know what would be cool??? If a real Reggare group was to remake this song as some sort of drug, dope smokin' song. Luckily that will never happen and we are left with this bouncy pop single. Lollipop, anyone?", "love the song so much....", "Such an awesome song.", "30 years ago, i was dancin like crazy to that song...GREAT!!!", "<3 <3 <3 <3 pass the dutchie!!!", "χχχ ℓσνє ιт χχχ", "I turned the LP over and over. I'm as old as they are. Or could be. I grew up with the Guys. Greetings from Hannover/Germany.", "classic", "TONGUETWISTER, GREAT☺☺♥"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/80s", "name": "80s"}, {"url": "http://www.last.fm/tag/pop", "name": "pop"}, {"url": "http://www.last.fm/tag/1982", "name": "1982"}, {"url": "http://www.last.fm/tag/weed", "name": "weed"}]}, "mbid": "a65ecbe0-6dff-43e8-8ab6-451d629f33f7", "duration": "204000", "playcount": "262844", "id": "1012358"}}