{"track": {"album": {"@attr": {"position": "2"}, "title": "B Is For Bob", "url": "http://www.last.fm/music/Bob+Marley/B+Is+For+Bob", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/29614463.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/29614463.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/29614463.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/29614463.jpg", "size": "extralarge"}], "artist": "Bob Marley", "mbid": "ba46ea14-3811-4e64-a486-065b17689c2e"}, "wiki": {"content": "&quot;Redemption Song&quot; is the last track on Bob Marley's ninth Island music album, Uprising. At the time he wrote the song, circa 1979, Marley already had been diagnosed with the cancer that later was to take his life. According to Rita Marley, he was already secretly in a lot of pain and dealt with his own mortality, a feature that is clearly apparent in the album, particularly in this song.\n \n Unlike most of Bob Marley's tracks, it is strictly a solo acoustic recording, consisting of Marley's singing and playing an acoustic guitar, without accompaniment.\n \n The song also urges listeners to &quot;Emancipate yourselves from mental slavery,&quot; because &quot;None but ourselves can free our minds&quot;. These memorable lines appear to have been taken from a speech given by Marcus Garvey in Nova Scotia during October 1937 and published in his Black Man magazine:\n \n     We are going to emancipate ourselves from mental slavery because whilst others might free the body, none but ourselves can free the mind. Mind is your only ruler, sovereign. The man who is not able to develop and use his mind is bound to be the slave of the other man who uses his mind....[1]\n \n A full band rendition of &quot;Redemption Song&quot; was made available as a bonus track on the 2001 reissue of Uprising, as well as being featured on the 2001 compilation One Love: The Very Best of Bob Marley &amp; the Wailers. However, the solo performance remains the take most familiar to listeners.\n \n In 2004, Rolling Stone placed the song at #66 among The 500 Greatest Songs of All Time.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;Redemption Song&quot; is the last track on Bob Marley's ninth Island music album, Uprising. At the time he wrote the song, circa 1979, Marley already had been diagnosed with the cancer that later was to take his life. According to Rita Marley, he was already secretly in a lot of pain and dealt with his own mortality, a feature that is clearly apparent in the album, particularly in this song.  Unlike most of Bob Marley's tracks, it is strictly a solo acoustic recording, consisting of Marley's singing and playing an acoustic guitar, without accompaniment. ", "published": "Mon, 17 Nov 2008 02:24:48 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Redemption Song", "artist": {"url": "http://www.last.fm/music/Bob+Marley", "mbid": "41ac07cd-8c7b-4766-9422-2c772a2b027b", "name": "Bob Marley"}, "url": "http://www.last.fm/music/Bob+Marley/_/Redemption+Song", "listeners": "222043", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/acoustic", "name": "acoustic"}, {"url": "http://www.last.fm/tag/bob%20marley", "name": "bob marley"}, {"url": "http://www.last.fm/tag/jamaican", "name": "jamaican"}, {"url": "http://www.last.fm/tag/roots%20reggae", "name": "roots reggae"}]}, "mbid": "ad8b04e7-d3fa-478e-8f8e-c6cf64b33718", "duration": "394000", "playcount": "1227704", "id": "1090202"}}