{"track": {"album": {"@attr": {"position": "17"}, "title": "2006-08-23: Red Rocks Amphitheatre, Morrison, CO, USA", "url": "http://www.last.fm/music/Damian+Marley/2006-08-23:+Red+Rocks+Amphitheatre,+Morrison,+CO,+USA", "image": [{"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "small"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "medium"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "large"}, {"#text": "http://cdn.last.fm/flatness/catalogue/noimage/2/default_album_medium.png", "size": "extralarge"}], "artist": "Damian Marley", "mbid": "e750d2c6-53c9-4005-b7c4-8455645ec94a"}, "wiki": {"content": "Welcome to Jamrock&quot; is the first single from Damian Marley's album of the same name.\n \n <strong>Lyrics</strong>\n \n Welcome to Jamrock covers issues such as crime, poverty and political corruption as part of the harsh reality of &quot;Jamrock&quot;, Marley's personification of Jamaica, as opposed to the Jamaica advertised as a popular tourist destination. Marley laments Jamaica's high crime rate and unceasing violence, demanding that those in charge do something about it. In this sense he carries on the legacy of his father before him, in inspiring Jamaicans to stand together.\n \n Both the rhythm (known as World Jam) and the hook are sampled from the 1984 track &quot;<a title=\"Ini Kamoze &ndash; World-A-Music\" href=\"http://www.last.fm/music/Ini+Kamoze/_/World-A-Music\" class=\"bbcode_track\">World-A-Music</a>&quot; by <a href=\"http://www.last.fm/music/Ini+Kamoze\" class=\"bbcode_artist\">Ini Kamoze</a> - the original rhythm from the Ini Kamoze album was provided by <a href=\"http://www.last.fm/music/+noredirect/Sly+And+Robbie\" class=\"bbcode_artist\">Sly And Robbie</a>.\n \n The track also samples the bassline from <a href=\"http://www.last.fm/music/Zap+Pow\" class=\"bbcode_artist\">Zap Pow</a>'s hit song &quot;[track artist=zap pow]Reggae Music&quot;. An edited version of &quot;Welcome to Jamrock&quot; was featured on the popular video game franchise FIFA 06.\n \n The song was also on the playlist of the video game Midnight Club 3, but on the remix version.\n There are many remixes to this song. One features G-Unit rapper Tony Yayo in a diss towards the rap group D-Block. Another features The Notorious B.I.G. Finally, a remix called &quot;Welcome to My Block&quot; features 2Pac, Nas, and Scarface. The Game released a diss song towards Tony Yayo and 50 Cent called &quot;Body Bags&quot; which samples the chorus, while a remix featuring 2Pac, Snoop Dogg and Dr. Dre is also available on the mixtape circuit.\n \n The originally-released recording contains the lyrics Funnyman a get dropped like a bad habit. A 'funny man' has in Jamaican English the same meaning like 'batty bwoy' or 'chi chi man', both pejorative designations for homosexual men. Since the widely-spread homonegativity in Jamaica and its reflections in popular Jamaican music has been a subject of heavy criticisms and protests outside of Jamaica, the word &quot;Funnyman&quot; has been edited out on following releases and remixes of the song, and when performing the song live Marley uses the word 'Babylonians' instead.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "Welcome to Jamrock&quot; is the first single from Damian Marley's album of the same name.  Lyrics  Welcome to Jamrock covers issues such as crime, poverty and political corruption as part of the harsh reality of &quot;Jamrock&quot;, Marley's personification of Jamaica, as opposed to the Jamaica advertised as a popular tourist destination. Marley laments Jamaica's high crime rate and unceasing violence, demanding that those in charge do something about it. In this sense he carries on the legacy of his father before him, in inspiring Jamaicans to stand together. ", "published": "Mon, 18 May 2009 15:29:03 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "Welcome to Jamrock", "artist": {"url": "http://www.last.fm/music/Damian+Marley", "mbid": "cbfb9bcd-c5a0-4d7c-865f-2c641c171e1c", "name": "Damian Marley"}, "url": "http://www.last.fm/music/Damian+Marley/_/Welcome+to+Jamrock", "listeners": "266534", "comments": ["♥", "Live at The Belly Up in June and July!!", "http://youtu.be/_GZlJGERbvE\r\n\r\noriginal videoclip", "omg i spot blasphemy on this page, to compare the offspring to the source might be natural, however it's ignorant. Although the two are related, (and the younger could say he was influenced), the latter can NEVER be better than the original. I don't care how many great songs he puts out. Sorry u wasted ur breath on such a stupid post.", "Jamaica, Jamaica..", "VIVA O REGGAE E SUES FRUTOS O PAZ E AMOR......", "a ghetto education's basic and most of the youths waste it and when dem waste it, that's when dem take the guns replace it then dem don't stand a chance at all -- one of my favorite lines", "I love the Marley family", "That groove ROCKS!! I guess my neighbours like it too)))))", "better than his father? I vote yes.", "veeery very gooooood :D", "when is lastfm gonna play me some \"master has come back!!!???\"", "RIDDIM !!!!!!\nHAILE SELASSI I !!!!!!!!!", "<3", "♡ Dis!", "east coast, west coast of the US? tehe", "buh", "This song never gets old.", "OUT ON THE STREET THEY CALL IT MURDER!!!!!!!", "what a way to start the day!"], "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/dancehall", "name": "dancehall"}, {"url": "http://www.last.fm/tag/ragga", "name": "ragga"}, {"url": "http://www.last.fm/tag/damian%20marley", "name": "damian marley"}, {"url": "http://www.last.fm/tag/jamaica", "name": "jamaica"}]}, "mbid": "e33e97cc-cb95-4a22-bc2b-6c3bdfa19c27", "duration": "210000", "playcount": "1548549", "id": "14373407"}}