{"track": {"album": {"@attr": {"position": "74"}, "title": "One Love Peace Concert", "url": "http://www.last.fm/music/Bob+Marley/One+Love+Peace+Concert", "image": [{"#text": "http://userserve-ak.last.fm/serve/64s/20667565.jpg", "size": "small"}, {"#text": "http://userserve-ak.last.fm/serve/126/20667565.jpg", "size": "medium"}, {"#text": "http://userserve-ak.last.fm/serve/174s/20667565.jpg", "size": "large"}, {"#text": "http://userserve-ak.last.fm/serve/300x300/20667565.jpg", "size": "extralarge"}], "artist": "Bob Marley", "mbid": ""}, "wiki": {"content": "&quot;<strong>War</strong>&quot; is a song recorded and made popular by Bob Marley. The lyrics are derived from a speech made by Ethiopian Emperor Haile Selassie I before the United Nations General Assembly in 1963. The song is credited to Alan Cole and late Wailers percussionist Carlton 'Carly' Barrett as song writers, and not to Bob Marley. It first appeared on the Wailers' 1976 album, Rastaman Vibration.\n \n <strong>Background</strong>\n \n Marley, along with fellow Rastafarians, worshiped Haile Selassie I of Ethiopia as the incarnation of God, and refer to him as “The Lion,” which Marley does in many of his songs. Haile Selassie I gave the speech calling for world peace at the 1963 U.N. Conference in New York City. The song uses part of Selassie’s speech that calls for equality among all without regard to race, class, or nationality in his hymnal cry for peace. It also asserts, quoting Selassie directly, that until the day of an equal society, there will be war. In the original speech, Selassie urged U.N. officials and country representatives to disarm nuclear weapons, and to end international exploitation (specifically with Africa). The song honors Haile Selassie I while calling for action against racial inequality and international injustice.\n \n Here is the part of Haile Selassie’s speech that appears in “War:”\n <span class=\"quote\">Last May, in Addis Ababa, I convened a meeting of Heads of African States and Governments. In three days, the thirty-two nations represented at that Conference demonstrated to the world that when the will and the determination exist, nations and peoples of diverse backgrounds can and will work together. In unity, to the achievement of common goals and the assurance of that equality and brotherhood which we desire.On the question of racial discrimination, the Addis Ababa Conference taught, to those who will learn, this further lesson:\n \n That until the philosophy which holds one race superior and another inferior is finally and permanently discredited and abandoned; That until there are no longer first-class and second class citizens of any nation; That until the color of a man's skin is of no more significance than the color of his eyes; That until the basic human rights are equally guaranteed to all without regard to race; That until that day, the dream of lasting peace and world citizenship and the rule of international morality will remain but a fleeting illusion, to be pursued but never attained; And until the ignoble and unhappy regimes that hold our brothers in Angola, in Mozambique and in South Africa in subhuman bondage have been toppled and destroyed; Until bigotry and prejudice and malicious and inhuman self-interest have been replaced by understanding and tolerance and good-will; Until all Africans stand and speak as free beings, equal in the eyes of all men, as they are in the eyes of Heaven; Until that day, the African continent will not know peace. We Africans will fight, if necessary, and we know that we shall win, as we are confident in the victory of good over evil - Haile Selassie I</span>\n \n In his speech to the U.N., Selassie reminded his listeners that these are only words; their value depends wholly on our will to observe and honour them and give them content and meaning.\n        \nUser-contributed text is available under the Creative Commons By-SA License and may also be available under the GNU FDL.", "summary": "&quot;War&quot; is a song recorded and made popular by Bob Marley. The lyrics are derived from a speech made by Ethiopian Emperor Haile Selassie I before the United Nations General Assembly in 1963. The song is credited to Alan Cole and late Wailers percussionist Carlton 'Carly' Barrett as song writers, and not to Bob Marley. It first appeared on the Wailers' 1976 album, Rastaman Vibration.  Background  Marley, along with fellow Rastafarians, worshiped Haile Selassie I of Ethiopia as the incarnation of God, and refer to him as “The Lion,” which Marley does in many of his songs.", "published": "Tue, 18 Aug 2009 22:54:51 +0000"}, "streamable": {"#text": "0", "fulltrack": "0"}, "name": "War", "artist": {"url": "http://www.last.fm/music/Bob+Marley", "mbid": "41ac07cd-8c7b-4766-9422-2c772a2b027b", "name": "Bob Marley"}, "url": "http://www.last.fm/music/Bob+Marley/_/War", "listeners": "84155", "toptags": {"tag": [{"url": "http://www.last.fm/tag/reggae", "name": "reggae"}, {"url": "http://www.last.fm/tag/bob%20marley", "name": "bob marley"}, {"url": "http://www.last.fm/tag/roots%20reggae", "name": "roots reggae"}, {"url": "http://www.last.fm/tag/political", "name": "political"}, {"url": "http://www.last.fm/tag/77davez-all-tracks", "name": "77davez-all-tracks"}]}, "mbid": "fc355aeb-2b24-4c72-a5e0-599aa737b0f4", "duration": "350000", "playcount": "351607", "id": "15575"}}